pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// bl602_demo_wifi_text_0005.c
// Generated by decompiling bl602_demo_wifi.elf
// using Reko decompiler version 0.9.3.0.

#include "bl602_demo_wifi.h"

// 2305044A: void iot_tls_is_connected()
void iot_tls_is_connected()
{
}

// 2305044E: void iot_tls_connect(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_266582) a0, Register word32 a1, Register (ptr32 Eq_266584) a2, Register (ptr32 Eq_266585) a3, Register (ptr32 Eq_266586) a4, Register Eq_2 s4, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_7997 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48)
void iot_tls_connect(Eq_2 ra, Eq_2 s0, struct Eq_266582 * a0, word32 a1, struct Eq_266584 * a2, struct Eq_266585 * a3, struct Eq_266586 * a4, Eq_2 s4, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_7997 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48)
{
	if (a0 == null)
		return;
	if (a1 != 0x00)
	{
		struct Eq_266756 * a1_35 = a2->ptr0008;
		int32 a6_33 = a3->ptr0000->dw0004;
		int32 a7_36 = a1_35->dw000C;
		word32 a5_40 = (word32) a4->ptr0014->b0018;
		a0->w0028 = (word16) (word32) a1_35->w0010;
		a0->dw0024 = a7_36;
		a0->dw001C = a6_33;
		a2->ptr0020 = a0;
		a3->ptr0018 = a0;
		a4->ptr002C = a0;
		a0->b0030 = (byte) a5_40;
	}
	mbedtls_net_init(&a0->b0030 + 0x06F8);
	Eq_2 a3_104;
	word32 a1_2370;
	word32 a0_2369;
	word32 a5_2372;
	word32 a0_2373;
	word32 a1_2374;
	word32 a3_2371;
	word32 a5_2375;
	Eq_2 ra_107 = mbedtls_x509_crt_init(mbedtls_x509_crt_init(mbedtls_ctr_drbg_init(mbedtls_ssl_config_init(mbedtls_ssl_init(ra, &a0->b0030 + 844), &a0->b0030 + 0x040C), &a0->b0030 + 524), &a0->b0030 + 0x0488, out a0_2369, out a1_2370, out a3_2371, out a5_2372), &a0->b0030 + 0x05BC, out a0_2373, out a1_2374, out a3_104, out a5_2375);
	mbedtls_pk_init(&a0->b0030 + 1776);
	Eq_2 s7_133;
	struct Eq_266666 * s9_135;
	word32 s1_2376;
	word32 a2_2379;
	word32 a0_2377;
	word32 a3_2380;
	word32 a1_2378;
	word32 a4_2381;
	word32 a5_2382;
	word32 s3_2385;
	word32 a7_2383;
	word32 s4_2386;
	word32 s2_2384;
	word32 s6_2388;
	word32 s8_2389;
	word32 s5_2387;
	word32 s11_2391;
	word32 t4_2392;
	word32 s10_2390;
	Eq_2 ra_144 = mbedtls_entropy_init(printf(ra_107, &g_t23087CF4, a3_104, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2376, out a0_2377, out a1_2378, out a2_2379, out a3_2380, out a4_2381, out a5_2382, out a7_2383, out s2_2384, out s3_2385, out s4_2386, out s5_2387, out s6_2388, out s7_133, out s8_2389, out s9_135, out s10_2390, out s11_2391, out t4_2392), s7_133);
	Eq_2 a3_148 = g_t4200D968;
	word32 a3_2395;
	word32 a5_2397;
	word32 a1_2393;
	word32 a4_2396;
	word32 a2_2394;
	strlen(a3_148, out a1_2393, out a2_2394, out a3_2395, out a4_2396, out a5_2397);
	Eq_2 dwLocCC_1704 = a3_148;
	word32 a0_163;
	Eq_2 a3_166;
	byte * a5_168;
	Eq_2 ra_171 = mbedtls_ctr_drbg_seed(ra_144, s9_135, 587555770, s7_133, dwLoc78, out a0_163, out a3_166, out a5_168);
	if (a0_163 != 0x00)
	{
		word32 t4_2416;
		word32 s11_2415;
		word32 s10_2414;
		word32 s7_2411;
		word32 s9_2413;
		word32 s8_2412;
		word32 a3_2402;
		word32 a1_2400;
		word32 a2_2401;
		word32 a5_2404;
		word32 a4_2403;
		word32 a0_2399;
		word32 s1_2398;
		word32 a7_2405;
		word32 s2_2406;
		word32 s3_2407;
		word32 s4_2408;
		word32 s5_2409;
		word32 s6_2410;
		printf(ra_171, &g_t23087D24, a3_166, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2398, out a0_2399, out a1_2400, out a2_2401, out a3_2402, out a4_2403, out a5_2404, out a7_2405, out s2_2406, out s3_2407, out s4_2408, out s5_2409, out s6_2410, out s7_2411, out s8_2412, out s9_2413, out s10_2414, out s11_2415, out t4_2416);
		return;
	}
	ptr32 mstatus_249;
	Eq_2 a3_235;
	Eq_2 ra_237;
	int32 a0_233;
	if ((word32) *a5_168 == 47)
	{
		Eq_2 a3_270;
		Eq_2 s2_277;
		Eq_2 s3_278;
		Eq_2 s4_279;
		Eq_2 s6_281;
		word32 s11_2444;
		word32 a5_2446;
		word32 t4_2445;
		word32 s10_2443;
		word32 s9_2442;
		word32 s8_2441;
		word32 s7_2440;
		word32 s5_2439;
		word32 a7_2438;
		word32 a5_2437;
		word32 a4_2436;
		word32 a2_2435;
		word32 a1_2434;
		word32 a0_2433;
		word32 s1_2432;
		ra_237 = mbedtls_x509_crt_parse_file(printf(ra_171, &g_t23087D5C, a3_166, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2432, out a0_2433, out a1_2434, out a2_2435, out a3_270, out a4_2436, out a5_2437, out a7_2438, out s2_277, out s3_278, out s4_279, out s5_2439, out s6_281, out s7_2440, out s8_2441, out s9_2442, out s10_2443, out s11_2444, out t4_2445), s6_281, a3_270, s2_277, s3_278, s4_279, mstatus, dwLoc014C, dwLoc0148, dwLoc013C, dwLoc0138, dwLoc012C, dwLoc0120, dwLoc011C, dwLoc0118, dwLoc010C, dwLocFC, dwLocF8, dwLocEC, dwLocDC, dwLocD8, dwLocD4, dwLocB8, dwLoc98, dwLoc7C, dwLoc78, dwLoc64, dwLoc58, dwLoc38, s4, dwArg08, dwArg28, out a0_233, out a3_235, out a5_2446, out mstatus_249);
	}
	else
	{
		dwLocCC_1704 = a1_200;
		Eq_2 a1_200;
		Eq_2 s10_207;
		Eq_2 s11_208;
		Eq_2 s2_209;
		Eq_2 s5_212;
		Eq_2 s6_213;
		Eq_2 s8_215;
		Eq_2 a3_223;
		Eq_2 a4_224;
		Eq_2 a5_225;
		Eq_2 a1_226;
		word32 s4_2425;
		word32 a5_2431;
		word32 a1_2430;
		word32 s7_2426;
		word32 s9_2427;
		word32 a2_2429;
		word32 t4_2428;
		word32 a0_2418;
		word32 s3_2424;
		word32 a7_2423;
		word32 a2_2419;
		word32 a3_2420;
		word32 a5_2422;
		word32 a4_2421;
		word32 s1_2417;
		ra_237 = mbedtls_x509_crt_parse(printf(ra_171, &g_t23087D90, a3_166, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2417, out a0_2418, out a1_200, out a2_2419, out a3_2420, out a4_2421, out a5_2422, out a7_2423, out s2_209, out s3_2424, out s4_2425, out s5_212, out s6_213, out s7_2426, out s8_215, out s9_2427, out s10_207, out s11_208, out t4_2428), *((word32) a1_200 + 24), s6_213, a1_226, (word32) strlen(a1_200, out a1_226, out a2_2429, out a3_223, out a4_224, out a5_225) + 1, a3_223, a4_224, a5_225, s2_209, s5_212, s6_213, s8_215, s10_207, s11_208, mstatus, dwLoc014C, dwLoc0148, dwLoc0138, dwLoc012C, dwLoc0128, dwLoc011C, dwLoc0118, dwLocF8, dwLocDC, dwLocD8, dwLocBC, dwLocB8, dwLoc98, dwLoc5C, dwLoc58, dwLoc44, s4, out a0_233, out a1_2430, out a3_235, out a5_2431, out mstatus_249);
	}
	if (a0_233 < 0x00)
	{
		word32 t4_2482;
		word32 s2_2472;
		word32 s4_2474;
		word32 s5_2475;
		word32 s6_2476;
		word32 s7_2477;
		word32 s8_2478;
		word32 s9_2479;
		word32 s10_2480;
		word32 s11_2481;
		word32 s3_2473;
		word32 a3_2468;
		word32 a5_2470;
		word32 a7_2471;
		word32 a4_2469;
		word32 s1_2464;
		word32 a1_2466;
		word32 a2_2467;
		word32 a0_2465;
		printf(ra_237, &g_t23087DC4, a3_235, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2464, out a0_2465, out a1_2466, out a2_2467, out a3_2468, out a4_2469, out a5_2470, out a7_2471, out s2_2472, out s3_2473, out s4_2474, out s5_2475, out s6_2476, out s7_2477, out s8_2478, out s9_2479, out s10_2480, out s11_2481, out t4_2482);
		return;
	}
	ptr32 mstatus_405;
	Eq_2 a3_391;
	Eq_2 ra_393;
	byte * a5_403;
	word32 a0_389;
	byte * a5_328;
	Eq_2 a3_332;
	word32 s9_2460;
	word32 s11_2462;
	word32 t4_2463;
	word32 s10_2461;
	word32 s3_2454;
	word32 s5_2456;
	word32 s6_2457;
	word32 s7_2458;
	word32 s8_2459;
	word32 s4_2455;
	word32 s1_2447;
	word32 a0_2448;
	word32 a1_2449;
	word32 a2_2450;
	word32 a4_2451;
	word32 a7_2452;
	word32 s2_2453;
	Eq_2 ra_335 = printf(ra_237, &g_t23087E14, a3_235, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2447, out a0_2448, out a1_2449, out a2_2450, out a3_332, out a4_2451, out a5_328, out a7_2452, out s2_2453, out s3_2454, out s4_2455, out s5_2456, out s6_2457, out s7_2458, out s8_2459, out s9_2460, out s10_2461, out s11_2462, out t4_2463);
	if ((word32) *a5_328 == 47)
	{
		Eq_2 a3_426;
		Eq_2 s2_433;
		Eq_2 s3_434;
		Eq_2 s4_435;
		word32 s10_2508;
		word32 t4_2510;
		word32 s11_2509;
		word32 s6_2504;
		word32 s8_2506;
		word32 s9_2507;
		word32 s7_2505;
		word32 a0_2497;
		word32 a2_2499;
		word32 a4_2500;
		word32 a5_2501;
		word32 a7_2502;
		word32 s5_2503;
		word32 a1_2498;
		word32 s1_2496;
		ra_393 = mbedtls_x509_crt_parse_file(printf(ra_335, &g_t23087E2C, a3_332, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2496, out a0_2497, out a1_2498, out a2_2499, out a3_426, out a4_2500, out a5_2501, out a7_2502, out s2_433, out s3_434, out s4_435, out s5_2503, out s6_2504, out s7_2505, out s8_2506, out s9_2507, out s10_2508, out s11_2509, out t4_2510), s4_435, a3_426, s2_433, s3_434, s4_435, mstatus_249, dwLoc014C, dwLoc0148, dwLoc013C, dwLoc0138, dwLoc012C, dwLoc0120, dwLoc011C, dwLoc0118, dwLoc010C, dwLocFC, dwLocF8, dwLocEC, dwLocDC, dwLocD8, dwLocD4, dwLocB8, dwLoc98, dwLoc7C, dwLoc78, dwLoc64, dwLoc58, dwLoc38, s4, dwArg08, dwArg28, out a0_389, out a3_391, out a5_403, out mstatus_405);
	}
	else
	{
		dwLocCC_1704 = a1_357;
		Eq_2 a1_357;
		Eq_2 s10_364;
		Eq_2 s11_365;
		Eq_2 s2_366;
		Eq_2 s4_368;
		Eq_2 s5_369;
		Eq_2 s6_370;
		Eq_2 s8_372;
		Eq_2 a3_380;
		Eq_2 a4_381;
		Eq_2 a5_382;
		Eq_2 a1_383;
		word32 s3_2490;
		word32 s9_2492;
		word32 t4_2493;
		word32 a2_2494;
		word32 a1_2495;
		word32 s7_2491;
		word32 a0_2484;
		word32 a3_2486;
		word32 a4_2487;
		word32 a5_2488;
		word32 a7_2489;
		word32 a2_2485;
		word32 s1_2483;
		ra_393 = mbedtls_x509_crt_parse(printf(ra_335, &g_t23087E58, a3_332, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2483, out a0_2484, out a1_357, out a2_2485, out a3_2486, out a4_2487, out a5_2488, out a7_2489, out s2_366, out s3_2490, out s4_368, out s5_369, out s6_370, out s7_2491, out s8_372, out s9_2492, out s10_364, out s11_365, out t4_2493), *((word32) a1_357 + 28), s4_368, a1_383, (word32) strlen(a1_357, out a1_383, out a2_2494, out a3_380, out a4_381, out a5_382) + 1, a3_380, a4_381, a5_382, s2_366, s5_369, s6_370, s8_372, s10_364, s11_365, mstatus_249, dwLoc014C, dwLoc0148, dwLoc0138, dwLoc012C, dwLoc0128, dwLoc011C, dwLoc0118, dwLocF8, dwLocDC, dwLocD8, dwLocBC, dwLocB8, dwLoc98, dwLoc5C, dwLoc58, dwLoc44, s4, out a0_389, out a1_2495, out a3_391, out a5_403, out mstatus_405);
	}
	if (a0_389 != 0x00)
	{
		word32 t4_2529;
		word32 s4_2521;
		word32 s5_2522;
		word32 s6_2523;
		word32 s7_2524;
		word32 s8_2525;
		word32 s9_2526;
		word32 s10_2527;
		word32 s11_2528;
		word32 s3_2520;
		word32 s2_2519;
		word32 a7_2518;
		word32 a5_2517;
		word32 a4_2516;
		word32 a3_2515;
		word32 s1_2511;
		word32 a0_2512;
		word32 a1_2513;
		word32 a2_2514;
		printf(ra_393, &g_t23087E88, a3_391, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2511, out a0_2512, out a1_2513, out a2_2514, out a3_2515, out a4_2516, out a5_2517, out a7_2518, out s2_2519, out s3_2520, out s4_2521, out s5_2522, out s6_2523, out s7_2524, out s8_2525, out s9_2526, out s10_2527, out s11_2528, out t4_2529);
		return;
	}
	ptr32 mstatus_1054;
	Eq_2 a3_526;
	Eq_2 ra_531;
	word32 a0_551;
	if ((word32) *a5_403 == 47)
	{
		struct Eq_267453 * a1_558;
		Eq_2 a3_560;
		Eq_2 s3_568;
		Eq_2 s4_569;
		Eq_2 s5_570;
		word32 s7_572;
		word32 t4_2560;
		word32 s9_2557;
		word32 s10_2558;
		word32 s11_2559;
		word32 s8_2556;
		word32 s6_2555;
		word32 s2_2554;
		word32 a7_2553;
		word32 a5_2552;
		word32 a4_2551;
		word32 a2_2550;
		word32 a0_2549;
		word32 s1_2548;
		ra_531 = mbedtls_pk_parse_keyfile(printf(ra_393, &g_t23087EDC, a3_391, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2548, out a0_2549, out a1_558, out a2_2550, out a3_560, out a4_2551, out a5_2552, out a7_2553, out s2_2554, out s3_568, out s4_569, out s5_570, out s6_2555, out s7_572, out s8_2556, out s9_2557, out s10_2558, out s11_2559, out t4_2560), a1_558->t0020, s5_570, s7_572 + -416, a3_560, s3_568, s4_569, mstatus_405, dwLoc014C, dwLoc0148, dwLoc013C, dwLoc0138, dwLoc0130, dwLoc012C, dwLoc011C, dwLoc0118, dwLoc010C, dwLoc0108, dwLocF8, dwLocE8, dwLocE4, dwLocD8, dwLocC8, dwLocB8, dwLocA8, dwLoc98, dwLoc88, dwLoc78, dwLoc68, dwLoc48, dwLoc38, s8, s0, dwArg18, out a0_551, out a3_526, out mstatus_1054);
	}
	else
	{
		dwLocCC_1704 = a1_490;
		Eq_2 a1_490;
		Eq_2 s1_496;
		Eq_2 s10_497;
		Eq_2 s11_498;
		Eq_2 s2_499;
		Eq_2 s3_500;
		Eq_2 s4_501;
		Eq_2 s7_504;
		Eq_2 a1_516;
		word32 a5_2547;
		word32 a4_2546;
		word32 a2_2545;
		word32 a2_2541;
		word32 a3_2542;
		word32 a4_2543;
		word32 a5_2544;
		word32 s6_2537;
		word32 s8_2538;
		word32 s9_2539;
		word32 t4_2540;
		word32 a4_2533;
		word32 a5_2534;
		word32 a7_2535;
		word32 s5_2536;
		word32 a0_2530;
		word32 a2_2531;
		word32 a3_2532;
		ra_531 = mbedtls_pk_parse_key(printf(ra_393, &g_t23087F0C, a3_391, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_496, out a0_2530, out a1_490, out a2_2531, out a3_2532, out a4_2533, out a5_2534, out a7_2535, out s2_499, out s3_500, out s4_501, out s5_2536, out s6_2537, out s7_504, out s8_2538, out s9_2539, out s10_497, out s11_498, out t4_2540), *((word32) a1_490 + 32), s1_496, a1_516, (word32) strlen(a1_490, out a1_516, out a2_2541, out a3_2542, out a4_2543, out a5_2544) + 1, 0x00, s2_499, s3_500, s4_501, s7_504, s10_497, s11_498, mstatus_405, dwLoc014C, dwLoc0148, dwLoc013C, dwLoc0138, dwLoc012C, dwLoc0128, dwLoc011C, dwLoc0118, dwLoc010C, dwLoc0108, dwLocEC, dwLocE8, dwLocDC, dwLocD8, dwLocC8, dwLocB8, dwLocA8, dwLoc98, dwLoc88, dwLoc78, dwLoc68, dwLoc58, dwLoc48, dwLoc38, s0, dwArg48, out a0_551, out a2_2545, out a3_526, out a4_2546, out a5_2547, out mstatus_1054);
	}
	if (a0_551 != 0x00)
	{
		word32 s11_2631;
		word32 t4_2632;
		word32 s10_2630;
		word32 s9_2629;
		word32 s8_2628;
		word32 s7_2627;
		word32 s6_2626;
		word32 s5_2625;
		word32 s3_2623;
		word32 s4_2624;
		word32 s2_2622;
		word32 a2_2617;
		word32 a3_2618;
		word32 a4_2619;
		word32 a5_2620;
		word32 a7_2621;
		word32 a0_2615;
		word32 a1_2616;
		word32 s1_2614;
		printf(ra_531, &g_t23087F3C, a3_526, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2614, out a0_2615, out a1_2616, out a2_2617, out a3_2618, out a4_2619, out a5_2620, out a7_2621, out s2_2622, out s3_2623, out s4_2624, out s5_2625, out s6_2626, out s7_2627, out s8_2628, out s9_2629, out s10_2630, out s11_2631, out t4_2632);
		return;
	}
	Eq_2 a3_648;
	Eq_2 a1_675;
	Eq_2 s1_681;
	Eq_2 s2_684;
	word32 a0_699;
	Eq_2 a3_702;
	union Eq_2 * s3_711;
	word32 s10_725;
	word32 t4_2613;
	word32 s9_2610;
	word32 s10_2611;
	word32 s11_2612;
	word32 s6_2607;
	word32 s7_2608;
	word32 s8_2609;
	word32 s5_2606;
	word32 s3_2604;
	word32 s4_2605;
	word32 a0_2598;
	word32 a2_2599;
	word32 a3_2600;
	word32 a4_2601;
	word32 a5_2602;
	word32 a7_2603;
	word32 s10_2596;
	word32 s11_2597;
	word32 s7_2593;
	word32 s8_2594;
	word32 s9_2595;
	word32 s3_2589;
	word32 s4_2590;
	word32 s5_2591;
	word32 s6_2592;
	word32 s2_2588;
	word32 a2_2584;
	word32 a4_2585;
	word32 a5_2586;
	word32 a7_2587;
	word32 a1_2583;
	word32 s0_2580;
	word32 s1_2581;
	word32 a0_2582;
	word32 t4_2579;
	word32 s11_2578;
	word32 s9_2576;
	word32 s10_2577;
	word32 s7_2574;
	word32 s8_2575;
	word32 s5_2572;
	word32 s6_2573;
	word32 s3_2570;
	word32 s4_2571;
	word32 a7_2568;
	word32 s2_2569;
	word32 a4_2566;
	word32 a5_2567;
	word32 a3_2565;
	word32 a2_2564;
	word32 a1_2563;
	word32 a0_2562;
	word32 s1_2561;
	Eq_2 ra_1499 = mbedtls_net_connect(printf(snprintf(printf(ra_531, &g_t23087F8C, a3_526, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2561, out a0_2562, out a1_2563, out a2_2564, out a3_2565, out a4_2566, out a5_2567, out a7_2568, out s2_2569, out s3_2570, out s4_2571, out s5_2572, out s6_2573, out s7_2574, out s8_2575, out s9_2576, out s10_2577, out s11_2578, out t4_2579), fp + -312, 0x06, &g_t230899B8, dwLoc0138, dwLoc0118, dwLocEC, dwLocD0, dwLocCC_1704, dwLocA8, dwLoc84, out s0_2580, out s1_2581, out a0_2582, out a1_2583, out a2_2584, out a3_648, out a4_2585, out a5_2586, out a7_2587, out s2_2588, out s3_2589, out s4_2590, out s5_2591, out s6_2592, out s7_2593, out s8_2594, out s9_2595, out s10_2596, out s11_2597), &g_t23087F98, a3_648, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_681, out a0_2598, out a1_675, out a2_2599, out a3_2600, out a4_2601, out a5_2602, out a7_2603, out s2_684, out s3_2604, out s4_2605, out s5_2606, out s6_2607, out s7_2608, out s8_2609, out s9_2610, out s10_2611, out s11_2612, out t4_2613), s1_681, a1_675, fp + -312, s2_684, mstatus_1054, dwLoc0148, dwLoc0140, dwLoc013C, dwLoc0128, dwLoc0118, dwLocF8, dwLocF4, dwLocE8, dwLocD8, dwLocC8, dwLocB8, dwLocA8, dwLoc98, dwLoc88, dwLoc78, dwLoc68, s4, out a0_699, out a3_702, out s3_711, out s10_725);
	if (a0_699 != 0x00)
	{
		int32 s7_1547;
		word32 t4_2650;
		word32 s8_2646;
		word32 s9_2647;
		word32 s10_2648;
		word32 s11_2649;
		word32 s6_2645;
		word32 s5_2644;
		word32 s4_2643;
		word32 s3_2642;
		word32 a7_2640;
		word32 s2_2641;
		word32 a2_2636;
		word32 a3_2637;
		word32 a4_2638;
		word32 a5_2639;
		word32 a1_2635;
		word32 s1_2633;
		word32 a0_2634;
		printf(ra_1499, &g_t23087FB8, a3_702, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2633, out a0_2634, out a1_2635, out a2_2636, out a3_2637, out a4_2638, out a5_2639, out a7_2640, out s2_2641, out s3_2642, out s4_2643, out s5_2644, out s6_2645, out s7_1547, out s8_2646, out s9_2647, out s10_2648, out s11_2649, out t4_2650);
		return;
	}
	struct Eq_274 * a0_1484;
	word32 a0_731;
	Eq_2 a3_1500;
	struct Eq_267764 * s0_738 = mbedtls_net_set_block(s3_711, a3_702, mstatus_1054, dwLoc011C, dwLoc010C, out a0_731, out a3_1500);
	if (a0_731 != 0x00)
	{
		a0_1484 = (struct Eq_274 *) &g_t23087FEC;
		goto l2305072E;
	}
	Eq_2 a3_750;
	Eq_2 s2_781;
	struct Eq_267826 * s6_785;
	struct Eq_267827 * s9_788;
	word32 t4_2684;
	word32 s11_2683;
	word32 s7_2680;
	word32 s8_2681;
	word32 s10_2682;
	word32 s3_2677;
	word32 s4_2678;
	word32 s5_2679;
	word32 a4_2674;
	word32 a5_2675;
	word32 a7_2676;
	word32 a1_2671;
	word32 a2_2672;
	word32 a3_2673;
	word32 t4_2668;
	word32 s1_2669;
	word32 a0_2670;
	word32 s11_2667;
	word32 s8_2664;
	word32 s9_2665;
	word32 s10_2666;
	word32 s7_2663;
	word32 s6_2662;
	word32 s5_2661;
	word32 s4_2660;
	word32 s3_2659;
	word32 s2_2658;
	word32 a2_2654;
	word32 a4_2655;
	word32 a5_2656;
	word32 a7_2657;
	word32 a1_2653;
	word32 a0_2652;
	word32 s1_2651;
	ra_1499 = printf(printf(ra_1499, s10_725 + -116, a3_1500, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2651, out a0_2652, out a1_2653, out a2_2654, out a3_750, out a4_2655, out a5_2656, out a7_2657, out s2_2658, out s3_2659, out s4_2660, out s5_2661, out s6_2662, out s7_2663, out s8_2664, out s9_2665, out s10_2666, out s11_2667, out t4_2668), &g_t23088020, a3_750, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2669, out a0_2670, out a1_2671, out a2_2672, out a3_2673, out a4_2674, out a5_2675, out a7_2676, out s2_781, out s3_2677, out s4_2678, out s5_2679, out s6_785, out s7_2680, out s8_2681, out s9_788, out s10_2682, out s11_2683, out t4_2684);
	Eq_2 a4_799;
	struct Eq_267908 * s2_803;
	Eq_2 s4_805;
	struct Eq_267910 * s5_806;
	if (mbedtls_ssl_config_defaults(s2_781, 0x00, 0x00, 0x00, out a3_1500, out a4_799, out s2_803, out s4_805, out s5_806) != 0x00)
	{
		a0_1484 = (struct Eq_274 *) &g_t2308804C;
		goto l2305072E;
	}
	mbedtls_ssl_conf_verify(s2_803, &g_t2305099A, null);
	ui32 a1_815 = 0x02;
	if ((word32) s0_738->b0030 == 0x00)
		a1_815 = 0x01;
	Eq_2 a5_821 = mbedtls_ssl_conf_authmode(s2_803, a1_815);
	mbedtls_ssl_conf_rng(s2_803, &g_t23056280, s9_788);
	mbedtls_ssl_conf_ca_chain(s2_803, s6_785, null);
	struct Eq_268011 * a0_842;
	Eq_2 s2_852;
	word32 s1_851;
	ra_1499 = mbedtls_ssl_conf_own_cert(ra_1499, s4_805, s5_806, a3_1500, a4_799, a5_821, mstatus_1054, dwLoc0150, dwLoc014C, dwLoc58, s4, out s1_851, out a0_842, out a3_1500, out s2_852);
	if (a0_842 != null)
	{
		a0_1484 = (struct Eq_274 *) &g_t23088088;
		goto l2305072E;
	}
	struct Eq_268040 * s0_861 = a0_842->ptr002C;
	mbedtls_ssl_conf_read_timeout(s2_852, a0_842);
	Eq_2 a4_863 = (word32) s0_861->w0028;
	Eq_2 a5_864 = 443;
	if (a4_863 == 443)
	{
		dwLoc0140.u0 = 0x230880C0;
		word32 a0_871;
		s1_851 = mbedtls_ssl_conf_alpn_protocols(s2_852, fp + -304, s8, out a0_871, out a3_1500, out a4_863, out a5_864, out s2_852);
		if (a0_871 != 0x00)
		{
			a0_1484 = (struct Eq_274 *) &g_t230880D0;
			goto l2305072E;
		}
	}
	word32 a0_896;
	Eq_2 a1_897;
	ra_1499 = mbedtls_ssl_setup(ra_1499, s1_851, s2_852, a3_1500, a4_863, a5_864, mstatus_1054, dwLoc0150, dwLoc014C, dwLoc0140, dwLoc013C, dwLoc0118, dwLoc48, dwLoc38, s8, s4, s0, dwArg08, dwArg18, dwArg28, dwArg38, out a0_896, out a1_897, out a3_1500);
	if (a0_896 != 0x00)
		a0_1484 = (struct Eq_274 *) &g_t23088110;
	else
	{
		word32 a0_923;
		ra_1499 = mbedtls_ssl_set_hostname(ra_1499, a1_897, mstatus_1054, dwLoc0140, dwLoc013C, dwLoc0118, dwLoc48, s0, out a0_923, out a3_1500);
		if (a0_923 == 0x00)
		{
			word32 s1_957;
			struct Eq_268136 * s3_961;
			word32 s8_966;
			word32 t4_2719;
			word32 s11_2718;
			word32 s10_2717;
			word32 s9_2716;
			word32 s5_2713;
			word32 s6_2714;
			word32 s7_2715;
			word32 a7_2710;
			word32 s2_2711;
			word32 s4_2712;
			word32 a5_2709;
			word32 a2_2706;
			word32 a3_2707;
			word32 a4_2708;
			word32 a1_2705;
			word32 a0_2704;
			Eq_2 ra_956 = printf(ra_1499, &g_t2308817C, a3_1500, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_957, out a0_2704, out a1_2705, out a2_2706, out a3_2707, out a4_2708, out a5_2709, out a7_2710, out s2_2711, out s3_961, out s4_2712, out s5_2713, out s6_2714, out s7_2715, out s8_966, out s9_2716, out s10_2717, out s11_2718, out t4_2719);
			mbedtls_ssl_set_bio(s1_957, s3_961, &g_t2305F510, null, &g_t2305F59E);
			Eq_2 a3_983;
			word32 s2_990;
			Eq_2 a3_1008;
			word32 t4_2771;
			word32 s11_2770;
			word32 s10_2769;
			word32 s9_2768;
			word32 s8_2767;
			word32 s7_2766;
			word32 s6_2765;
			word32 s5_2764;
			word32 s4_2763;
			word32 s3_2762;
			word32 s2_2761;
			word32 a7_2760;
			word32 a4_2759;
			word32 a3_2758;
			word32 a2_2757;
			word32 a1_2756;
			word32 a0_2755;
			word32 t4_2754;
			word32 s11_2753;
			word32 s10_2752;
			word32 s9_2751;
			word32 s8_2750;
			word32 s7_2749;
			word32 s6_2748;
			word32 s5_2747;
			word32 s4_2746;
			word32 s3_2745;
			word32 s2_2744;
			word32 a7_2743;
			word32 a5_2742;
			word32 a4_2741;
			word32 a2_2740;
			word32 a1_2739;
			word32 a0_2738;
			word32 s1_2737;
			word32 t4_2736;
			word32 s11_2735;
			word32 s10_2734;
			word32 s9_2733;
			word32 s8_2732;
			word32 s7_2731;
			word32 s6_2730;
			word32 s5_2729;
			word32 s4_2728;
			word32 s3_2727;
			word32 a7_2726;
			word32 a5_2725;
			word32 a4_2724;
			word32 a2_2723;
			word32 a1_2722;
			word32 a0_2721;
			word32 s1_2720;
			Eq_2 s1_1036;
			Eq_2 a5_1028;
