pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
			Eq_2 ra_1035 = printf(printf(printf(ra_956, s8_966 + -116, 0x00, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2720, out a0_2721, out a1_2722, out a2_2723, out a3_983, out a4_2724, out a5_2725, out a7_2726, out s2_990, out s3_2727, out s4_2728, out s5_2729, out s6_2730, out s7_2731, out s8_2732, out s9_2733, out s10_2734, out s11_2735, out t4_2736), s2_990 + 380, a3_983, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2737, out a0_2738, out a1_2739, out a2_2740, out a3_1008, out a4_2741, out a5_2742, out a7_2743, out s2_2744, out s3_2745, out s4_2746, out s5_2747, out s6_2748, out s7_2749, out s8_2750, out s9_2751, out s10_2752, out s11_2753, out t4_2754), &g_t2308819C, a3_1008, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1036, out a0_2755, out a1_2756, out a2_2757, out a3_2758, out a4_2759, out a5_1028, out a7_2760, out s2_2761, out s3_2762, out s4_2763, out s5_2764, out s6_2765, out s7_2766, out s8_2767, out s9_2768, out s10_2769, out s11_2770, out t4_2771);
			do
			{
				ui32 a0_1057;
				struct Eq_268383 * s0_1060;
				Eq_2 a3_1066;
				struct Eq_268330 * a4_1067;
				up32 a5_1068;
				ui32 s3_1076;
				word32 a1_2902;
				word32 a2_2903;
				word32 s2_2904;
				word32 s4_2905;
				word32 s5_2906;
				word32 s6_2907;
				ra_1035 = mbedtls_ssl_handshake(ra_1035, s1_1036, a5_1028, mstatus_1054, dwLocF8, dwLocAC, out s0_1060, out s1_1036, out a0_1057, out a1_2902, out a2_2903, out a3_1066, out a4_1067, out a5_1068, out s2_2904, out s3_1076, out s4_2905, out s5_2906, out s6_2907, out mstatus_1054);
				if (a0_1057 == 0x00)
				{
					Eq_2 a3_1205;
					Eq_2 ra_1208;
					mbedtls_ssl_get_ciphersuite(s1_1036, mbedtls_ssl_get_version(a4_1067, a5_1068));
					word32 a7_2776;
					word32 s2_2777;
					word32 s3_2778;
					word32 s4_2779;
					word32 s5_2780;
					word32 s6_2781;
					word32 s7_2782;
					word32 s8_2783;
					word32 s9_2784;
					Eq_2 a5_1156;
					struct Eq_268346 * a3_1160;
					struct Eq_268347 * a4_1161;
					word32 s10_2785;
					word32 a2_2775;
					word32 a1_2774;
					word32 a0_2773;
					word32 s1_2772;
					word32 s11_2786;
					word32 t4_2787;
					Eq_2 ra_1163 = printf(ra_1035, &g_t23088238, a3_1066, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2772, out a0_2773, out a1_2774, out a2_2775, out a3_1160, out a4_1161, out a5_1156, out a7_2776, out s2_2777, out s3_2778, out s4_2779, out s5_2780, out s6_2781, out s7_2782, out s8_2783, out s9_2784, out s10_2785, out s11_2786, out t4_2787);
					Eq_2 a3_1181;
					if (mbedtls_ssl_get_record_expansion(ra_1163, s0_1060, a3_1160, a4_1161, a5_1156, out a3_1181) >= 0x00)
					{
						word32 s1_2806;
						word32 a0_2807;
						word32 a1_2808;
						word32 a2_2809;
						word32 a4_2810;
						word32 a5_2811;
						word32 a7_2812;
						word32 s2_2813;
						word32 s3_2814;
						word32 s4_2815;
						word32 s5_2816;
						word32 s6_2817;
						word32 s7_2818;
						word32 s8_2819;
						word32 s9_2820;
						word32 s10_2821;
						word32 s11_2822;
						word32 t4_2823;
						ra_1208 = printf(ra_1163, &g_t23088270, a3_1181, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2806, out a0_2807, out a1_2808, out a2_2809, out a3_1205, out a4_2810, out a5_2811, out a7_2812, out s2_2813, out s3_2814, out s4_2815, out s5_2816, out s6_2817, out s7_2818, out s8_2819, out s9_2820, out s10_2821, out s11_2822, out t4_2823);
					}
					else
					{
						word32 s1_2788;
						word32 a0_2789;
						word32 a1_2790;
						word32 a2_2791;
						word32 a4_2792;
						word32 a5_2793;
						word32 a7_2794;
						word32 s2_2795;
						word32 s3_2796;
						word32 s4_2797;
						word32 s5_2798;
						word32 s6_2799;
						word32 s7_2800;
						word32 s8_2801;
						word32 s9_2802;
						word32 s10_2803;
						word32 s11_2804;
						word32 t4_2805;
						ra_1208 = printf(ra_1163, &g_t23088294, a3_1181, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2788, out a0_2789, out a1_2790, out a2_2791, out a3_1205, out a4_2792, out a5_2793, out a7_2794, out s2_2795, out s3_2796, out s4_2797, out s5_2798, out s6_2799, out s7_2800, out s8_2801, out s9_2802, out s10_2803, out s11_2804, out t4_2805);
					}
					Eq_2 a3_1293;
					Eq_2 ra_1296;
					Eq_2 s1_1297;
					struct Eq_274 * a0_1277;
					Eq_2 a3_1257;
					word32 s8_1270;
					word32 s1_2944;
					word32 a0_2945;
					word32 a1_2946;
					word32 a2_2947;
					word32 a4_2948;
					word32 a5_2949;
					word32 a7_2950;
					word32 s2_2951;
					word32 s3_2952;
					word32 s4_2953;
					word32 s5_2954;
					word32 s6_2955;
					word32 s7_2956;
					word32 s9_2957;
					word32 s10_2958;
					word32 s11_2959;
					word32 t4_2960;
					Eq_2 ra_1260 = printf(ra_1208, &g_t230882CC, a3_1205, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2944, out a0_2945, out a1_2946, out a2_2947, out a3_1257, out a4_2948, out a5_2949, out a7_2950, out s2_2951, out s3_2952, out s4_2953, out s5_2954, out s6_2955, out s7_2956, out s8_1270, out s9_2957, out s10_2958, out s11_2959, out t4_2960);
					struct Eq_268478 * a5_1275 = (word32) s0_1060->b0030;
					if (a5_1275 == null)
					{
						a0_1277 = (struct Eq_274 *) &g_t2308831C;
						goto l2305098A;
					}
					else
					{
						Eq_268475 a0_1279 = mbedtls_ssl_get_verify_result(a5_1275);
						s0_1060->t04B4 = a0_1279;
						if (a0_1279 != 0x00)
						{
							Eq_2 s3_1325;
							Eq_2 s5_1327;
							Eq_2 a3_1342;
							word32 s1_2824;
							word32 a0_2825;
							word32 a1_2826;
							word32 a2_2827;
							word32 a3_2828;
							word32 a4_2829;
							word32 a5_2830;
							word32 a7_2831;
							word32 s2_2832;
							word32 s4_2833;
							word32 s6_2834;
							word32 s7_2835;
							word32 s8_2836;
							word32 s9_2837;
							word32 s10_2838;
							word32 s11_2839;
							word32 t4_2840;
							word32 a0_2841;
							word32 a1_2842;
							word32 a2_2843;
							word32 a4_2844;
							word32 a5_2845;
							word32 a7_2846;
							word32 s2_2847;
							word32 s3_2848;
							word32 s4_2849;
							word32 s5_2850;
							word32 s6_2851;
							word32 s7_2852;
							word32 s8_2853;
							word32 s9_2854;
							word32 s10_2855;
							word32 s11_2856;
							word32 t4_2857;
							ra_1296 = printf(mbedtls_x509_crt_verify_info(printf(ra_1260, &g_t230882F8, a3_1257, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2824, out a0_2825, out a1_2826, out a2_2827, out a3_2828, out a4_2829, out a5_2830, out a7_2831, out s2_2832, out s3_1325, out s4_2833, out s5_1327, out s6_2834, out s7_2835, out s8_2836, out s9_2837, out s10_2838, out s11_2839, out t4_2840), fp + -304, 0x0100, s0_1060->t04B4, s3_1325, s5_1327, dwLoc0138, dwLoc010C, dwLocC8, dwLocA8, dwLocA4, out a3_1342), &g_t23088310, a3_1342, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1297, out a0_2841, out a1_2842, out a2_2843, out a3_1293, out a4_2844, out a5_2845, out a7_2846, out s2_2847, out s3_2848, out s4_2849, out s5_2850, out s6_2851, out s7_2852, out s8_2853, out s9_2854, out s10_2855, out s11_2856, out t4_2857);
						}
						else
						{
							a0_1277 = s8_1270 + -116;
l2305098A:
							word32 a0_2961;
							word32 a1_2962;
							word32 a2_2963;
							word32 a4_2964;
							word32 a5_2965;
							word32 a7_2966;
							word32 s2_2967;
							word32 s3_2968;
							word32 s4_2969;
							word32 s5_2970;
							word32 s6_2971;
							word32 s7_2972;
							word32 s8_2973;
							word32 s9_2974;
							word32 s10_2975;
							word32 s11_2976;
							word32 t4_2977;
							ra_1296 = printf(ra_1260, a0_1277, a3_1257, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1297, out a0_2961, out a1_2962, out a2_2963, out a3_1293, out a4_2964, out a5_2965, out a7_2966, out s2_2967, out s3_2968, out s4_2969, out s5_2970, out s6_2971, out s7_2972, out s8_2973, out s9_2974, out s10_2975, out s11_2976, out t4_2977);
						}
						if (mbedtls_ssl_get_peer_cert(s1_1297) != 0x00)
						{
							Eq_2 s1_1408;
							Eq_2 s2_1411;
							Eq_2 a3_1431;
							word32 a0_2858;
							word32 a1_2859;
							word32 a2_2860;
							word32 a3_2861;
							word32 a4_2862;
							word32 a5_2863;
							word32 a7_2864;
							word32 s3_2865;
							word32 s4_2866;
							word32 s5_2867;
							word32 s6_2868;
							word32 s7_2869;
							word32 s8_2870;
							word32 s9_2871;
							word32 s10_2872;
							word32 s11_2873;
							word32 t4_2874;
							word32 s0_2875;
							word32 s1_2876;
							word32 s2_2877;
							word32 s3_2878;
							word32 s4_2879;
							word32 s5_2880;
							word32 s7_2881;
							word32 s10_2882;
							word32 s1_2883;
							word32 a0_2884;
							word32 a1_2885;
							word32 a2_2886;
							word32 a3_2887;
							word32 a4_2888;
							word32 a5_2889;
							word32 a7_2890;
							word32 s2_2891;
							word32 s3_2892;
							word32 s4_2893;
							word32 s5_2894;
							word32 s6_2895;
							word32 s7_2896;
							word32 s8_2897;
							word32 s9_2898;
							word32 s10_2899;
							word32 s11_2900;
							word32 t4_2901;
							printf(mbedtls_x509_crt_info(printf(ra_1296, &g_t23088344, a3_1293, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1408, out a0_2858, out a1_2859, out a2_2860, out a3_2861, out a4_2862, out a5_2863, out a7_2864, out s2_1411, out s3_2865, out s4_2866, out s5_2867, out s6_2868, out s7_2869, out s8_2870, out s9_2871, out s10_2872, out s11_2873, out t4_2874), s1_1408, fp + -304, 0x00FF, mbedtls_ssl_get_peer_cert(s1_1408), s2_1411, dwLoc0150, dwLoc014C, dwLoc0140, dwLoc0138, dwLoc0130, dwLoc012C, dwLoc0128, dwLoc0118, dwLoc0114, dwLocF4, dwLocE4, dwLoc88, dwArg24, out s0_2875, out s1_2876, out a3_1431, out s2_2877, out s3_2878, out s4_2879, out s5_2880, out s7_2881, out s10_2882), &g_t23088374, a3_1431, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2883, out a0_2884, out a1_2885, out a2_2886, out a3_2887, out a4_2888, out a5_2889, out a7_2890, out s2_2891, out s3_2892, out s4_2893, out s5_2894, out s6_2895, out s7_2896, out s8_2897, out s9_2898, out s10_2899, out s11_2900, out t4_2901);
						}
						return;
					}
				}
				a5_1028 = a0_1057 & -0x0081;
			} while ((a0_1057 & -0x0081) == s3_1076);
			Eq_2 a3_1098;
			word32 s2_1105;
			word32 s1_2908;
			word32 a0_2909;
			word32 a1_2910;
			word32 a2_2911;
			word32 a4_2912;
			word32 a5_2913;
			word32 a7_2914;
			word32 s3_2915;
			word32 s4_2916;
			word32 s5_2917;
			word32 s6_2918;
			word32 s7_2919;
			word32 s8_2920;
			word32 s9_2921;
			word32 s10_2922;
			word32 s11_2923;
			word32 t4_2924;
			Eq_2 ra_1101 = printf(ra_1035, &g_t230881C8, a3_1066, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2908, out a0_2909, out a1_2910, out a2_2911, out a3_1098, out a4_2912, out a5_2913, out a7_2914, out s2_1105, out s3_2915, out s4_2916, out s5_2917, out s6_2918, out s7_2919, out s8_2920, out s9_2921, out s10_2922, out s11_2923, out t4_2924);
			if (s2_1105 == ~0x020006FF)
			{
				word32 s1_2925;
				word32 a0_2926;
				word32 a1_2927;
				word32 a2_2928;
				word32 a3_2929;
				word32 a4_2930;
				word32 a5_2931;
				word32 a7_2932;
				word32 s2_2933;
				word32 s3_2934;
				word32 s4_2935;
				word32 s5_2936;
				word32 s6_2937;
				word32 s7_2938;
				word32 s8_2939;
				word32 s9_2940;
				word32 s10_2941;
				word32 s11_2942;
				word32 t4_2943;
				printf(ra_1101, &g_t23088200, a3_1098, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2925, out a0_2926, out a1_2927, out a2_2928, out a3_2929, out a4_2930, out a5_2931, out a7_2932, out s2_2933, out s3_2934, out s4_2935, out s5_2936, out s6_2937, out s7_2938, out s8_2939, out s9_2940, out s10_2941, out s11_2942, out t4_2943);
			}
			return;
		}
		a0_1484 = (struct Eq_274 *) &g_t23088144;
	}
l2305072E:
	word32 t4_2703;
	word32 s11_2702;
	word32 s10_2701;
	word32 s9_2700;
	word32 s8_2699;
	word32 s5_2696;
	word32 s6_2697;
	word32 s7_2698;
	word32 s2_2693;
	word32 s3_2694;
	word32 s4_2695;
	word32 a4_2690;
	word32 a5_2691;
	word32 a7_2692;
	word32 a3_2689;
	word32 a2_2688;
	word32 s1_2685;
	word32 a0_2686;
	word32 a1_2687;
	printf(ra_1499, a0_1484, a3_1500, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2685, out a0_2686, out a1_2687, out a2_2688, out a3_2689, out a4_2690, out a5_2691, out a7_2692, out s2_2693, out s3_2694, out s4_2695, out s5_2696, out s6_2697, out s7_2698, out s8_2699, out s9_2700, out s10_2701, out s11_2702, out t4_2703);
}

