pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
Eq_2 g_t2305045A = 
	{
		0x1491
	};
// 2305099A: void _iot_tls_verify_cert(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_7997 dwArg64)
void _iot_tls_verify_cert(Eq_2 ra, Eq_2 a3, Eq_7997 dwArg64)
{
	Eq_2 s1_27;
	Eq_2 s2_30;
	Eq_2 a3_48;
	word32 a5_75;
	Eq_2 a3_79;
	word32 a2_201;
	word32 a1_200;
	word32 a0_199;
	word32 a3_202;
	word32 a4_203;
	word32 a5_204;
	word32 a7_205;
	word32 s3_206;
	word32 s4_207;
	word32 s5_208;
	word32 s6_209;
	word32 s7_210;
	word32 s8_211;
	word32 s9_212;
	word32 s10_213;
	word32 s11_214;
	word32 t4_215;
	word32 s0_216;
	word32 s1_217;
	word32 s2_218;
	word32 s3_219;
	word32 s4_220;
	word32 s5_221;
	word32 s7_222;
	word32 s10_223;
	word32 s1_224;
	word32 a0_225;
	word32 a1_226;
	word32 a2_227;
	word32 a4_228;
	word32 a7_229;
	word32 s2_230;
	word32 s3_231;
	word32 s4_232;
	word32 s5_233;
	word32 s6_234;
	word32 s7_235;
	word32 s8_236;
	word32 s9_237;
	word32 s10_238;
	word32 s11_239;
	word32 t4_240;
	Eq_2 ra_82 = printf(mbedtls_x509_crt_info(printf(ra, &g_t23087C84, a3, dwLoc0108, dwLocE8, dwLocA0, dwLoc9C, dwLoc78, dwLoc54, out s1_27, out a0_199, out a1_200, out a2_201, out a3_202, out a4_203, out a5_204, out a7_205, out s2_30, out s3_206, out s4_207, out s5_208, out s6_209, out s7_210, out s8_211, out s9_212, out s10_213, out s11_214, out t4_215), s1_27, fp + -272, 0x00FF, s1_27, s2_30, dwLoc0110, dwLoc010C, dwLoc0100, dwLocF8, dwLocF0, dwLocEC, dwLocE8, dwLocD8, dwLocD4, dwLocB4, dwLocA4, dwLoc48, dwArg64, out s0_216, out s1_217, out a3_48, out s2_218, out s3_219, out s4_220, out s5_221, out s7_222, out s10_223), &g_t23088374, a3_48, dwLoc0108, dwLocE8, dwLocA0, dwLoc9C, dwLoc78, dwLoc54, out s1_224, out a0_225, out a1_226, out a2_227, out a3_79, out a4_228, out a5_75, out a7_229, out s2_230, out s3_231, out s4_232, out s5_233, out s6_234, out s7_235, out s8_236, out s9_237, out s10_238, out s11_239, out t4_240);
	if (a5_75 == 0x00)
	{
		word32 s1_260;
		word32 a0_261;
		word32 a1_262;
		word32 a2_263;
		word32 a3_264;
		word32 a4_265;
		word32 a5_266;
		word32 a7_267;
		word32 s2_268;
		word32 s3_269;
		word32 s4_270;
		word32 s5_271;
		word32 s6_272;
		word32 s7_273;
		word32 s8_274;
		word32 s9_275;
		word32 s10_276;
		word32 s11_277;
		word32 t4_278;
		printf(ra_82, &g_t23087CB0, a3_79, dwLoc0108, dwLocE8, dwLocA0, dwLoc9C, dwLoc78, dwLoc54, out s1_260, out a0_261, out a1_262, out a2_263, out a3_264, out a4_265, out a5_266, out a7_267, out s2_268, out s3_269, out s4_270, out s5_271, out s6_272, out s7_273, out s8_274, out s9_275, out s10_276, out s11_277, out t4_278);
	}
	else
	{
		word32 s1_241;
		word32 a0_242;
		word32 a1_243;
		word32 a2_244;
		word32 a3_245;
		word32 a4_246;
		word32 a5_247;
		word32 a7_248;
		word32 s2_249;
		word32 s3_250;
		word32 s4_251;
		word32 s5_252;
		word32 s6_253;
		word32 s7_254;
		word32 s8_255;
		word32 s9_256;
		word32 s10_257;
		word32 s11_258;
		word32 t4_259;
		printf(ra_82, &g_t23087CD8, a3_79, dwLoc0108, dwLocE8, dwLocA0, dwLoc9C, dwLoc78, dwLoc54, out s1_241, out a0_242, out a1_243, out a2_244, out a3_245, out a4_246, out a5_247, out a7_248, out s2_249, out s3_250, out s4_251, out s5_252, out s6_253, out s7_254, out s8_255, out s9_256, out s10_257, out s11_258, out t4_259);
	}
}

// 23050A0E: void iot_tls_write(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack word32 dwArg1C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack word32 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack word32 dwArg0128, Stack Eq_2 dwArg0138)
void iot_tls_write(Eq_2 ra, Eq_2 s0, word32 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, word32 dwArg1C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, word32 dwArg78, Eq_2 dwArg8C, Eq_2 dwArgD8, Eq_2 dwArgF8, word32 dwArg0128, Eq_2 dwArg0138)
{
	Eq_2 s3_115 = a2;
	Eq_2 s5_139 = a4;
	Eq_2 s0_133 = 0x00;
	Eq_2 s9_122 = a0 + 892;
l23050A42:
	if (s0_133 < s3_115)
	{
		word32 a0_53;
		word32 a1_441;
		word32 s2_443;
		word32 s4_445;
		word32 s8_446;
		word32 a5_442;
		word32 s3_444;
		has_timer_expired(a2, a3, a4, mstatus, s0, dwLoc18, dwArg08, dwArgF8, dwArg0138, out a0_53, out a1_441, out a2, out a3, out a4, out a5_442, out s2_443, out s3_444, out s4_445, out s8_446);
		if (a0_53 == 0x00)
		{
			do
			{
				word32 a0_105;
				Eq_2 a5_107;
				Eq_2 s8_117;
				word32 a1_448;
				word32 s4_450;
				word32 s2_449;
				Eq_2 s1_108 = has_timer_expired(a2, a3, a4, mstatus, s0, dwLoc18, dwArg08, dwArgF8, dwArg0138, out a0_105, out a1_448, out a2, out a3, out a4, out a5_107, out s2_449, out s3_115, out s4_450, out s8_117);
				if (a0_105 != 0x00)
				{
l23050A6E:
					s0_133 += s1_108;
					goto l23050A42;
				}
				Eq_2 a0_125;
				Eq_2 s10_135;
				Eq_2 s2_137;
				word32 s7_447;
				ra = mbedtls_ssl_write(ra, s9_122, s8_117, a5_107, mstatus, dwArg08, s7, dwArg78, dwArgD8, out s0_133, out a0_125, out a2, out a3, out a4, out s2_137, out s3_115, out s5_139, out s7_447, out s9_122, out s10_135, out mstatus);
				s1_108 = a0_125;
				if (a0_125 > 0x00)
					goto l23050A6E;
			} while (a0_125 == s10_135 || a0_125 == s2_137);
			union Eq_2 * s5_175;
			word32 t4_468;
			word32 s11_467;
			word32 s10_466;
			word32 s9_465;
			word32 s8_464;
			word32 s7_463;
			word32 s3_460;
			word32 s6_462;
			word32 s4_461;
			word32 a5_457;
			word32 s2_459;
			word32 a7_458;
			word32 a2_454;
			word32 a4_456;
			word32 a3_455;
			word32 s1_451;
			word32 a1_453;
			word32 a0_452;
			printf(ra, &g_t23088380, a3, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_451, out a0_452, out a1_453, out a2_454, out a3_455, out a4_456, out a5_457, out a7_458, out s2_459, out s3_460, out s4_461, out s5_175, out s6_462, out s7_463, out s8_464, out s9_465, out s10_466, out s11_467, out t4_468);
			*s5_175 = (union Eq_2 *) s0_133;
l23050A90:
			0x00 = dwArg0128;
			0x00 = dwArg1C;
			return;
		}
	}
	*s5_139 = s0_133;
	word32 a0_78;
	Eq_2 s3_88;
	word32 a5_437;
	word32 s8_440;
	word32 a1_433;
	word32 a2_434;
	word32 a3_435;
	word32 a4_436;
	word32 s2_438;
	word32 s4_439;
	has_timer_expired(a2, a3, a4, mstatus, s0, dwLoc18, dwArg08, dwArgF8, dwArg0138, out a0_78, out a1_433, out a2_434, out a3_435, out a4_436, out a5_437, out s2_438, out s3_88, out s4_439, out s8_440);
	goto l23050A90;
}

Eq_2 g_t23050A16 = 
	{
		53322
	};
// 23050AC4: void iot_tls_read(Register Eq_2 ra, Register (ptr32 Eq_269358) a0, Register Eq_2 a2, Register (ptr32 word32) a4, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack word32 dwArg0198)
void iot_tls_read(Eq_2 ra, struct Eq_269358 * a0, Eq_2 a2, word32 * a4, Eq_2 s2, Eq_2 s4, Eq_2 s11, ptr32 mstatus, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0128, word32 dwArg0198)
{
	struct Eq_268011 * s2_162 = a0->ptr04A0;
	Eq_2 s1_161 = a2;
	word32 * s9_131 = a4;
	ptr32 s10_124 = (char *) a0 + 892;
	Eq_2 s8_170 = (char *) a0 + 0x043C;
	word32 s4_169 = 0x00;
	Eq_2 s11_125 = (word32) (s2_162 < (struct Eq_268011 *) 1);
	do
	{
		if (s1_161 == 0x00)
			goto l23050B08;
		Eq_2 a5_101 = s11_125;
		word32 a5_453;
		if (s2_162 >= left_ms(a4, out a5_453))
		{
			word32 a5_454;
			a5_101 = (word32) (left_ms(a4, out a5_454) < (struct Eq_268011 *) 1);
		}
		struct Eq_268011 * a1_65 = (struct Eq_268011 *) 0x01;
		if (a5_101 == 0x00)
		{
			a1_65 = s2_162;
			if (s2_162 >= left_ms(a4, out a5_101))
				a1_65 = left_ms(a4, out a5_101);
		}
		mbedtls_ssl_conf_read_timeout(s8_170, a1_65);
		int32 a0_111;
		Eq_2 a2_112;
		Eq_2 s8_116;
		Eq_2 a3_120;
		Eq_2 a4_121;
		struct Eq_268011 * s2_126;
		ui32 s6_129;
		int32 s7_130;
		word32 s5_455;
		ra = mbedtls_ssl_read(ra, s10_124, s1_161, a5_101, mstatus, dwLoc08, s11, dwArgC8, out a0_111, out a2_112, out a3_120, out a4_121, out s2_126, out s5_455, out s6_129, out s7_130, out s8_116, out s9_131, out s10_124, out s11_125, out mstatus);
		mbedtls_ssl_conf_read_timeout(s8_116, s2_126);
		if (a0_111 <= 0x00 && (a0_111 == 0x00 || (a0_111 & -0x0081) != s6_129 && a0_111 != s7_130))
			goto l23050B0E;
		word32 a0_158;
		word32 a1_456;
		word32 a2_457;
		word32 a3_458;
		word32 s3_460;
		word32 a5_459;
		s1_161 = has_timer_expired(a2_112, a3_120, a4_121, mstatus, s4, s2, dwLoc08, dwArgE8, dwArg0128, out a0_158, out a1_456, out a2_457, out a3_458, out a4, out a5_459, out s2_162, out s3_460, out s4_169, out s8_170);
	} while (a0_158 == 0x00);
	if (s1_161 == 0x00)
	{
l23050B08:
		*s9_131 = s4_169;
	}
l23050B0E:
	0x00 = dwArg0198;
}

