pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
Eq_2 g_t23050AC8 = 
	{
		~0x29B1
	};
// 23050BA4: void iot_tls_disconnect(Register Eq_2 ra, Register word32 a0, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0118)
void iot_tls_disconnect(Eq_2 ra, word32 a0, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0118)
{
	word32 s1_12 = a0 + 892;
	do
	{
		word32 a0_21;
		word32 s0_24;
		ra = mbedtls_ssl_close_notify(ra, s1_12, a5, mstatus, dwArg0118, out s0_24, out s1_12, out a0_21, out a5, out mstatus);
	} while (a0_21 == s0_24);
}

Eq_2 g_t23050BB0 = 
	{
		14277
	};
// 23050BCC: void iot_tls_destroy(Register Eq_2 ra, Register word32 a0, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178)
void iot_tls_destroy(Eq_2 ra, word32 a0, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178)
{
	Eq_2 a5_22;
	Eq_2 a1_39;
	Eq_2 a5_43;
	word32 s0_46;
	Eq_2 a5_60;
	word32 s0_63;
	Eq_2 a5_74;
	Eq_2 a2_79;
	Eq_2 a5_82;
	word32 s1_143;
	word32 a0_144;
	word32 a2_145;
	word32 s3_146;
	word32 s4_147;
	word32 s8_148;
	word32 s1_149;
	word32 a0_150;
	word32 a1_151;
	word32 a2_152;
	word32 s3_153;
	word32 s4_154;
	word32 s8_155;
	word32 a0_156;
	word32 a2_157;
	byte * s1_107 = mbedtls_ssl_config_free(mbedtls_ssl_free(mbedtls_pk_free(mbedtls_x509_crt_free(mbedtls_x509_crt_free(ra, a0 + 1516, mbedtls_net_free(ra, a0 + 0x0728, mstatus, dwArg28, dwArg38, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArg0108, out a5_22), a5_22, mstatus, dwArg0128, dwArg0168, out s0_46, out s1_143, out a0_144, out a1_39, out a2_145, out a5_43, out s3_146, out s4_147, out s8_148), s0_46 + 0x04B8, a1_39, a5_43, mstatus, dwArg0128, dwArg0168, out s0_63, out s1_149, out a0_150, out a1_151, out a2_152, out a5_60, out s3_153, out s4_154, out s8_155), s0_63 + 0x0720, a5_60, out a0_156, out a2_157, out a5_74), s0_63 + 892, a5_74, mstatus, dwArg28, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, dwArg0178, out a2_79, out a5_82), s0_63 + 0x043C, a2_79, a5_82, mstatus, dwArg0138, dwArg0178);
	mbedtls_ctr_drbg_free(s0_63 + 572);
	mbedtls_entropy_free(s1_107);
}

Eq_2 g_t23050BE0 = 
	{
		0x2750
	};
// 23050C24: Register Eq_2 iot_tls_init(Register Eq_2 a0, Register (ptr32 Eq_262957) a1, Register (ptr32 Eq_262958) a2, Register Eq_2 a3, Register Eq_2 a4, Register word32 a5, Register Eq_2 a6, Register word32 a7)
// Called from:
//      aws_iot_mqtt_init
Eq_2 iot_tls_init(Eq_2 a0, struct Eq_262957 * a1, struct Eq_262958 * a2, Eq_2 a3, Eq_2 a4, word32 a5, Eq_2 a6, word32 a7)
{
	*((word32) a0 + 40) = (word16) a5;
	g_t2305044E = a0;
	g_t23050AC8 = a0;
	g_t23050A16 = a0;
	g_t23050BB0 = a0;
	g_t2305045A = a0;
	*((word32) a4 + 36) = a0;
	a2->t001C = a0;
	*((word32) a3 + 32) = a0;
	a1->t0018 = a0;
	*((word32) a0 + 44) = a6;
	((word32) a0 + 48)->u1 = (byte) a7;
	g_t23050BE0 = a0;
	*((word32) a0 + 0x04B4) = 0x00;
	return 0x00;
}

// 23050C7C: Register word32 aws_iot_thread_mutex_init(Register Eq_2 ra, Register ptr32 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out Eq_262903 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      aws_iot_mqtt_init
word32 aws_iot_thread_mutex_init(Eq_2 ra, ptr32 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, union Eq_262903 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	Eq_262903 a0_38;
	ptr32 a1_15;
	ptr32 a3_17;
	ptr32 a4_18;
	ptr32 a5_19;
	ptr32 s3_23;
	ptr32 s4_24;
	ptr32 * a0_28;
	ptr32 s5_30;
	ptr32 s6_31;
	word32 s2_87;
	word32 s1_21 = xQueueCreateMutex(ra, a3, a4, a5, mstatus, dwArg00, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out a0_28, out a1_15, out a3_17, out a4_18, out a5_19, out s2_87, out s3_23, out s4_24, out s5_30, out s6_31);
	*a0_28 = a0;
	if (a0_28 == null)
		a0_38.u0 = -46;
	else
		a0_38.u0 = 0x00;
	a0Out = a0_38;
	a1Out = a1_15;
	a2Out = dwArg10;
	a3Out = a3_17;
	a4Out = a4_18;
	a5Out = a5_19;
	s3Out = s3_23;
	s4Out = s4_24;
	s5Out = s5_30;
	s6Out = s6_31;
	return s1_21;
}

// 23050C9E: Register Eq_2 aws_iot_thread_mutex_lock(Register Eq_2 s1, Register (ptr32 word32) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      aws_iot_mqtt_client_lock_mutex
Eq_2 aws_iot_thread_mutex_lock(Eq_2 s1, word32 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	ptr32 s2_17;
	ptr32 a1_19;
	ptr32 a3_20;
	ptr32 a4_21;
	ptr32 s3_24;
	ptr32 s4_25;
	xQueueTakeMutexRecursive(s1, *a0, ~0x00, a2, a3, a4, mstatus, dwArg04, dwArg28, dwArg84, dwArgF8, dwArg0138, out a1_19, out a3_20, out a4_21, out s2_17, out s3_24, out s4_25);
	a0Out = 0x00;
	a1Out = a1_19;
	a2Out = dwArg10;
	a3Out = a3_20;
	a4Out = a4_21;
	s2Out = s2_17;
	s3Out = s3_24;
	s4Out = s4_25;
	return s1_23;
}

// 23050CB2: Register Eq_2 aws_iot_thread_mutex_trylock(Register Eq_2 s1, Register (ptr32 word32) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out Eq_262309 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      aws_iot_mqtt_client_lock_mutex
Eq_2 aws_iot_thread_mutex_trylock(Eq_2 s1, word32 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, union Eq_262309 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	Eq_262309 a0_28;
	ptr32 s2_17;
	ptr32 a1_19;
	ptr32 a3_20;
	ptr32 a4_21;
	ptr32 s3_24;
	ptr32 s4_25;
	if (xQueueTakeMutexRecursive(s1, *a0, 0x00, a2, a3, a4, mstatus, dwArg04, dwArg28, dwArg84, dwArgF8, dwArg0138, out a1_19, out a3_20, out a4_21, out s2_17, out s3_24, out s4_25) == 0x00)
		a0_28.u0 = -47;
	else
		a0_28.u0 = 0x00;
	a0Out = a0_28;
	a1Out = a1_19;
	a2Out = dwArg10;
	a3Out = a3_20;
	a4Out = a4_21;
	s2Out = s2_17;
	s3Out = s3_24;
	s4Out = s4_25;
	return s1_23;
}

// 23050CCE: Register word32 aws_iot_thread_mutex_unlock(Register (ptr32 (ptr32 Eq_151879)) a0, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out Eq_262421 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      aws_iot_mqtt_client_unlock_mutex
word32 aws_iot_thread_mutex_unlock(struct Eq_151879 ** a0, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & s1Out, union Eq_262421 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s6Out)
{
	Eq_262421 a0_32;
	word32 a0_10;
	ptr32 a3_13;
	ptr32 s1_18;
	ptr32 s5_22;
	word32 t1_26 = xQueueGiveMutexRecursive(*a0, a4, mstatus, dwArg04, dwArg28, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_18, out a0_10, out a3_13, out s5_22);
	if (a0_10 == 0x00)
		a0_32.u0 = -48;
	else
		a0_32.u0 = 0x00;
	s1Out = s1_18;
	a0Out = a0_32;
	a1Out = a1_11;
	a2Out = dwArg10;
	a3Out = a3_13;
	a4Out = a4_14;
	s2Out = s2_19;
	s3Out = s3_20;
	s5Out = s5_22;
	s6Out = s6_23;
	return t1_26;
}

// 23050CE8: Register (ptr32 Eq_184845) aws_iot_thread_mutex_destroy(Register (ptr32 Eq_2) a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      aws_iot_mqtt_init
struct Eq_184845 * aws_iot_thread_mutex_destroy(union Eq_2 * a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & a3Out, ptr32 & a4Out)
{
	ptr32 a3_14;
	ptr32 a4_15;
	word32 s1_32;
	word32 a0_33;
	word32 a1_34;
	word32 a2_35;
	word32 a5_36;
	word32 s4_37;
	struct Eq_184845 * s0_18 = vQueueDelete(*a0, a3, a4, mstatus, dwArg0148, dwArg0188, out s1_32, out a0_33, out a1_34, out a2_35, out a3_14, out a4_15, out a5_36, out s4_37);
	a3Out = a3_14;
	a4Out = a4_15;
	return s0_18;
}

