pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 23050CFA: Register Eq_2 _aws_iot_mqtt_internal_readWrapper(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_269866) a2, Register Eq_269866 a4, Register out (ptr32 Eq_269867) s0Out, Register out ptr32 a0Out, Register out (ptr32 Eq_269866) a2Out, Register out Eq_269866 a4Out, Register out (ptr32 word32) a5Out, Register out Eq_269872 s2Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      aws_iot_mqtt_internal_cycle_read
Eq_2 _aws_iot_mqtt_internal_readWrapper(Eq_2 ra, Eq_2 a0, Eq_2 a1, union Eq_269866 * a2, Eq_269866 a4, struct Eq_269867 & s0Out, ptr32 & a0Out, union Eq_269866 & a2Out, union Eq_269866 & a4Out, word32 & a5Out, union Eq_269872 & s2Out, ptr32 & s4Out, ptr32 & s8Out)
{
	ptr32 a0_21;
	int32 a6_13 = *((word32) a0 + 60);
	word32 * a5_18 = (char *) a2 + (a1 - a6_13);
	if (a5_18 > null)
	{
		struct Eq_269889 * sp_31;
		word32 s1_34;
		word32 a5_38;
		word32 a7_41;
		struct Eq_269893 * a3_43;
		(*((word32) a0 + 0x04E4))();
		s0 = a3_43->ptr003C;
		a2 = sp_31->ptr00E4;
		struct Eq_269904 * a5_49 = a3_43 + a5_38 / 64;
		a5_49->ptr003C = s0;
		a5_18 = a5_49 - s2;
		*a5_18 = s1_34;
	}
	else
	{
		*a2 = (union Eq_269866 *) a4;
		a0_21 = 0x00;
	}
	s0Out = s0;
	a0Out = a0_21;
	a2Out = a2;
	a4Out = a4;
	a5Out = a5_18;
	s2Out = s2;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return ra;
}

// 23050D4E: Register Eq_263420 aws_iot_mqtt_internal_write_len_to_buffer(Register Eq_263420 a0, Register Eq_2 a1, Register out Eq_2 a1Out, Register out Eq_263423 a3Out, Register out Eq_263424 a4Out, Register out Eq_263420 a5Out)
// Called from:
//      aws_iot_mqtt_connect
//      aws_iot_mqtt_internal_serialize_ack
//      aws_iot_mqtt_publish
//      _aws_iot_mqtt_serialize_subscribe.constprop.1
//      aws_iot_mqtt_unsubscribe
//      aws_iot_mqtt_internal_serialize_zero
Eq_263420 aws_iot_mqtt_internal_write_len_to_buffer(Eq_263420 a0, Eq_2 a1, union Eq_2 & a1Out, union Eq_263423 & a3Out, union Eq_263424 & a4Out, union Eq_263420 & a5Out)
{
	Eq_263420 a5_11 = 0x00;
	while (true)
	{
		Eq_263424 a4_16 = a1 & 0x007F;
		Eq_2 a6_7 = a1 >> 0x07;
		if (a1 > 0x007F)
			a4_16 |= 0x0080;
		a5_11 = (word32) a5_11.u0 + 1;
		Mem17[a0 + a5_11 + 0x0FFF:byte] = SLICE(a4_16, byte, 0);
		if (a1 <= 0x007F)
			break;
		a1 = a6_7;
	}
	a1Out = a1;
	a3Out.u0 = 0x007F;
	a4Out = a4_16;
	a5Out = a5_11;
	return a5_11;
}

// 23050D7A: Register Eq_263863 aws_iot_mqtt_internal_decode_remaining_length_from_buffer(Register Eq_263863 a0, Register (ptr32 byte) a1, Register Eq_47572 a2, Register out (ptr32 Eq_263866) a3Out, Register out Eq_263867 a4Out, Register out Eq_2 a5Out)
// Called from:
//      aws_iot_mqtt_connect
//      aws_iot_mqtt_internal_deserialize_publish
//      aws_iot_mqtt_internal_deserialize_ack
//      _aws_iot_mqtt_deserialize_suback.constprop.0
Eq_263863 aws_iot_mqtt_internal_decode_remaining_length_from_buffer(Eq_263863 a0, byte * a1, Eq_47572 a2, struct Eq_263866 & a3Out, union Eq_263867 & a4Out, union Eq_2 & a5Out)
{
	*a1 = (byte) 0x00;
	struct Eq_269942 * a5_5 = null;
	struct Eq_263866 * a3_17 = (struct Eq_263866 *) 0x01;
	do
	{
		++a5_5;
		if (a5_5 == (struct Eq_269942 *) 0x05)
		{
			a3Out = a3_17;
			a4Out = a4;
			a5Out.u0 = <invalid>;
			return -35;
		}
		word32 a4_15 = CONVERT(Mem14[a0 + a5_5 + -1:byte], byte, word32);
		*a1 = (byte) (a3_17 + (a4_15 & 0x007F) / 60 + *a1 / 60);
		a4.u0 = (int32) (byte) a4_15;
		a3_17 <<= 7;
	} while (a4 < 0x00);
	a5_5->dw0000 = (word32) a2;
	a3Out = a3_17;
	a4Out = a4;
	a5Out.u0 = <invalid>;
	return 0x00;
}

// 23050DBA: Register Eq_2 aws_iot_mqtt_internal_get_final_packet_length_from_remaining_length(Register Eq_2 a0, Register out (ptr32 Eq_263373) a3Out, Register out Eq_2 a4Out)
// Called from:
//      aws_iot_mqtt_connect
//      aws_iot_mqtt_publish
//      _aws_iot_mqtt_serialize_subscribe.constprop.1
//      aws_iot_mqtt_unsubscribe
Eq_2 aws_iot_mqtt_internal_get_final_packet_length_from_remaining_length(Eq_2 a0, struct Eq_263373 & a3Out, union Eq_2 & a4Out)
{
	if (a0 > -0x007E)
	{
		if (a0 >= 0xFC000001)
		{
			Eq_2 a0_10 = (word32) a0 + 5;
			if (a0 < 0xFFE00001)
				a0_10 = (word32) a0 + 4;
			a3Out = (struct Eq_263373 *) 0x00200000;
			a4Out.u0 = <invalid>;
			return a0_10;
		}
		else
		{
			a3Out = (struct Eq_263373 *) 0x04000000;
			a4Out.u0 = <invalid>;
			return (word32) a0 + 3;
		}
	}
	else
	{
		a3Out = (struct Eq_263373 *) 0x007F;
		a4Out.u0 = <invalid>;
		return (word32) a0 + 2;
	}
}

// 23050DE6: Register word32 aws_iot_mqtt_internal_read_uint16_t(Register Eq_2 a4, Register out ptr32 a3Out, Register out Eq_264444 a4Out, Register out Eq_264445 a5Out)
// Called from:
//      aws_iot_mqtt_internal_deserialize_publish
//      aws_iot_mqtt_internal_deserialize_ack
//      _aws_iot_mqtt_deserialize_suback.constprop.0
word32 aws_iot_mqtt_internal_read_uint16_t(Eq_2 a4, ptr32 & a3Out, union Eq_264444 & a4Out, union Eq_264445 & a5Out)
{
	ptr32 a3_7 = (word32) *((word32) a4 + 1);
	Eq_264445 a5_10 = ((word32) *a4 << 8) + a3_7;
	*((word32) a4 + 2) = *a4;
	a3Out = a3_7;
	a4Out = (word32) a4 + 2;
	a5Out = a5_10;
	return (word32) (word16) a5_10;
}

// 23050E00: Register Eq_270019 aws_iot_mqtt_internal_write_uint_16(Register Eq_2 a1, Register (ptr32 Eq_263413) a5, Register out (ptr32 word32) a4Out, Register out (ptr32 word32) a5Out)
// Called from:
//      aws_iot_mqtt_connect
//      aws_iot_mqtt_internal_serialize_ack
//      aws_iot_mqtt_publish
//      _aws_iot_mqtt_serialize_subscribe.constprop.1
//      aws_iot_mqtt_unsubscribe
//      aws_iot_mqtt_internal_write_utf8_string
Eq_270019 aws_iot_mqtt_internal_write_uint_16(Eq_2 a1, struct Eq_263413 * a5, word32 & a4Out, word32 & a5Out)
{
	a5->t0000 = (byte) (a1 >> 0x08);
	a5->t0001 = a5->t0000;
	a5->t0001 = (byte) a1;
	Eq_270019 a0_13 = a5->t0000;
	a5->t0001 = a0_13;
	a4Out = (word32 *) &a5->t0001;
	a5Out = (word32 *) &a5->t0001;
	return a0_13;
}

// 23050E1E: Register word32 aws_iot_mqtt_internal_read_char(Register Eq_2 a5, Register out Eq_263842 a4Out, Register out (ptr32 Eq_263843) a5Out)
// Called from:
//      aws_iot_mqtt_connect
//      aws_iot_mqtt_internal_deserialize_publish
//      aws_iot_mqtt_internal_deserialize_ack
//      _aws_iot_mqtt_deserialize_suback.constprop.0
word32 aws_iot_mqtt_internal_read_char(Eq_2 a5, union Eq_263842 & a4Out, struct Eq_263843 & a5Out)
{
	Eq_263842 a0_5 = *a5;
	word32 a0_8 = (word32) *a5;
	*((word32) a5 + 1) = a0_5;
	a4Out = a0_5;
	a5Out = (word32) a5 + 1;
	return a0_8;
}

