pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 23050E2C: Register Eq_270059 aws_iot_mqtt_internal_write_char(Register Eq_2 a1, Register Eq_2 a5, Register out (ptr32 word32) a5Out)
// Called from:
//      aws_iot_mqtt_connect
//      aws_iot_mqtt_internal_serialize_ack
//      aws_iot_mqtt_publish
//      _aws_iot_mqtt_serialize_subscribe.constprop.1
//      aws_iot_mqtt_unsubscribe
//      aws_iot_mqtt_internal_serialize_zero
Eq_270059 aws_iot_mqtt_internal_write_char(Eq_2 a1, Eq_2 a5, word32 & a5Out)
{
	*a5 = (byte) a1;
	Eq_270059 a0_8 = *a5;
	*((word32) a5 + 1) = a0_8;
	a5Out = (word32) a5 + 1;
	return a0_8;
}

// 23050E3A: Register word32 aws_iot_mqtt_internal_write_utf8_string(Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 Eq_263413) a5, Stack word32 dwArg38, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 word32) a5Out, Register out Eq_2 s2Out)
// Called from:
//      aws_iot_mqtt_connect
//      aws_iot_mqtt_publish
//      _aws_iot_mqtt_serialize_subscribe.constprop.1
//      aws_iot_mqtt_unsubscribe
word32 aws_iot_mqtt_internal_write_utf8_string(Eq_2 a1, Eq_2 a2, struct Eq_263413 * a5, word32 dwArg38, union Eq_2 & a0Out, union Eq_2 & a1Out, ptr32 & a3Out, ptr32 & a4Out, word32 & a5Out, union Eq_2 & s2Out)
{
	Eq_2 a1_12 = a2;
	word32 s1_18 = a0;
	ptr32 a4_21;
	word32 * a5_22;
	Eq_2 a0_20 = aws_iot_mqtt_internal_write_uint_16(a2, a5, out a4_21, out a5_22);
	if (a2 != 0x00)
	{
		word32 a2_89;
		word32 a6_90;
		word32 a7_91;
		memcpy(a0_20, a1, a2, out a1_12, out a2_89, out a3, out a4_21, out a5_22, out a6_90, out a7_91);
		s1_18 = *a5_22;
		Mem41[a2 + a5_22:word32] = s1_18;
	}
	0x00 = dwArg38;
	a0Out = a0_20;
	a1Out = a1_12;
	a3Out = a3;
	a4Out = a4_21;
	a5Out = a5_22;
	s2Out = a1;
	return s1_18;
}

// 23050E6E: Register (ptr32 byte) aws_iot_mqtt_internal_init_header(Register (ptr32 byte) a0, Register (ptr32 Eq_263391) a1, Register word32 a2, Register (ptr32 Eq_263393) a3, Register Eq_2 a4, Register out (ptr32 Eq_263391) a1Out, Register out (ptr32 Eq_263393) a3Out, Register out Eq_2 a4Out, Register out Eq_263398 a5Out)
// Called from:
//      aws_iot_mqtt_connect
//      aws_iot_mqtt_internal_serialize_ack
//      aws_iot_mqtt_publish
//      _aws_iot_mqtt_serialize_subscribe.constprop.1
//      aws_iot_mqtt_unsubscribe
//      aws_iot_mqtt_internal_serialize_zero
byte * aws_iot_mqtt_internal_init_header(byte * a0, struct Eq_263391 * a1, word32 a2, struct Eq_263393 * a3, Eq_2 a4, struct Eq_263391 & a1Out, struct Eq_263393 & a3Out, union Eq_2 & a4Out, union Eq_263398 & a5Out)
{
	byte * a6_10 = (byte *) ~0x01;
	if (a0 != null)
	{
		*a0 = 0x00;
		a1 = (char *) a1 - 1 & 0x00FF;
		a5.u0 = 0x0D;
		a6_10 = (byte *) ~0x00;
		if (a1 <= (struct Eq_263391 *) 0x0D)
		{
			ui32 a3_18 = a3 << 3 | (word32) a1->b230883B4 << 4;
			a1 = (struct Eq_263391 *) &a1->b230883B4;
			a3 = a3_18 & 0x00FF;
			if (a2 == 0x01)
				a3 = a3_18 & 0x00FF | 2;
			*a0 = (byte) a3;
			a5 = (word32) *a0;
			a4 = (word32) (a4 < ~0x01) | a5;
			*a0 = (byte) a4;
			a6_10 = null;
		}
	}
	a1Out = a1;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	return a6_10;
}

// 23050EC2: Register Eq_2 aws_iot_mqtt_internal_send_packet(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg54, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_263706) s0Out, Register out Eq_2 s1Out, Register out Eq_263708 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      aws_iot_mqtt_connect
//      _aws_iot_mqtt_internal_disconnect
//      aws_iot_mqtt_publish
//      aws_iot_mqtt_subscribe
//      aws_iot_mqtt_resubscribe
//      aws_iot_mqtt_unsubscribe
//      aws_iot_mqtt_yield
//      aws_iot_mqtt_internal_cycle_read
Eq_2 aws_iot_mqtt_internal_send_packet(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg54, Eq_2 dwArgC8, Eq_2 dwArg0108, Eq_2 dwArg0128, struct Eq_263706 & s0Out, union Eq_2 & s1Out, union Eq_263708 & a0Out, union Eq_2 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00 || a2 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out.u0 = ~0x01;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 a0_24 = *((word32) a4 + 52);
		struct Eq_270172 * sp_114 = fp + -48;
		Eq_2 s0_110 = a0_24;
		Eq_263708 a5_138 = -33;
		if (a1 < a4)
		{
			Eq_263708 a0_34;
			Eq_2 a2_105;
			struct Eq_151879 ** s4_107;
			s1 = aws_iot_mqtt_client_lock_mutex(a2, a0_24, (word32) a0_24 + 0x044C, a2, a3, a4, mstatus, dwLoc2C, dwLoc08, dwArg54, dwArgC8, dwArg0108, out a0_34, out a1, out a2_105, out a3, out a4, out s2, out s3, out s4_107);
			a5_138 = a0_34;
			if (a0_34 == 0x00)
			{
				ptr32 s2_106 = 0x00;
				word32 s5_51 = (word32) a0_24 + 0x04E0;
				while (s2_106 < s3)
				{
					word32 a0_62;
					word32 s2_66;
					word32 s3_72;
					word32 a1_295;
					word32 a5_298;
					word32 a3_297;
					word32 a2_296;
					word32 s8_299;
					Eq_2 s1_65 = has_timer_expired(a2_105, a3, a4, mstatus, sp_114->t0014, sp_114->t0018, sp_114->t0038, sp_114->t0128, sp_114->t0168, out a0_62, out a1_295, out a2_296, out a3_297, out a4, out a5_298, out s2_66, out s3_72, out s4_107, out s8_299);
					if (a0_62 != 0x00)
						break;
					word32 a5_87;
					word32 a0_88;
					word32 s2_93;
					word32 tp_100;
					word32 t3_101;
					word32 s8_102;
					word32 a6_104;
					word32 a7_168;
					word32 s6_169;
					word32 t0_170;
					word32 t1_171;
					word32 t4_172;
					word32 t5_173;
					word32 t6_174;
					(*((word32) s0_110 + 0x04E8))();
					if (a0_88 != 0x00)
						break;
					a2_105 = sp_114->t00E4;
					s2_106 = s2_93 + a5_87;
				}
				Eq_263708 a0_116;
				word32 a2_294;
				aws_iot_mqtt_client_unlock_mutex(s0_110, s4_107, a4, mstatus, sp_114->t0004, sp_114->t0028, sp_114->t0084, sp_114->t00F8, sp_114->t0138, sp_114->t0178, out s1, out a0_116, out a1, out a2_294, out a3, out a4, out s2, out s3, out s5, out s6);
				a5_138 = a0_116;
			}
		}
		0x00 = (uint16) dwArg0128;
		s0Out = dwArgE4;
		s1Out = s1;
		a0Out = a5_138;
		a1Out = a1;
		a2Out = dwArg0100;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = dwArg78;
		s5Out = s5;
		s6Out = s6;
		mstatusOut = mstatus;
		return ra;
	}
}

// 23050F4A: Register Eq_2 aws_iot_mqtt_internal_cycle_read(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg84, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out Eq_266005 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out (ptr32 (ptr32 Eq_151879)) s6Out, Register out Eq_2 s7Out, Register out Eq_2 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      aws_iot_mqtt_yield
//      aws_iot_mqtt_internal_wait_for_read
Eq_2 aws_iot_mqtt_internal_cycle_read(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg84, Eq_2 dwArg98, Eq_2 dwArgD8, union Eq_2 & s0Out, ptr32 & s1Out, union Eq_266005 & a0Out, union Eq_2 & a1Out, union Eq_2 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, struct Eq_151879 & s6Out, union Eq_2 & s7Out, union Eq_2 & s10Out, ptr32 & mstatusOut)
{
	struct Eq_270302 * sp_169 = fp + -96;
	Eq_266005 s1_266 = ~0x01;
	if (a0 != 0x00 && a1 != 0x00)
	{
		Eq_266005 a0_40;
		word32 s4_1012;
		word32 a3_1011;
		aws_iot_mqtt_client_lock_mutex(~0x01, a0, (word32) a0 + 0x0448, a2, a3, a4, mstatus, dwLoc5C, s2, dwArg24, dwArg98, dwArgD8, out a0_40, out a1, out a2, out a3_1011, out a4, out s2, out s3, out s4_1012);
		s6 = (word32) a0 + 0x0448;
		s0 = a0;
		Eq_2 s5_181 = a2;
		s1_266 = a0_40;
		if (a0_40 != 0x00)
			goto l23051040;
		init_timer(fp + -64);
		word32 a0_70;
		word32 a2_1013;
		word32 a2_1014;
		word32 a5_1015;
		word32 s2_1016;
		word32 s4_1017;
		word32 s8_1018;
		Eq_2 a4_114;
		Eq_2 ra_104 = _aws_iot_mqtt_internal_readWrapper(ra, countdown_ms(fp + -64, a1, out a2_1013), 0x00, (union Eq_269866 *) 0x01, fp + -72, out s0, out a0_70, out a2_1014, out a4_114, out a5_1015, out s2_1016, out s4_1017, out s8_1018);
		if (a0_70 != ~0x18 && a0_70 == 0x00)
		{
			Eq_2 s4_130 = 0x00;
			word32 s9_183 = 0x05;
			while (true)
			{
				s7 = (word32) s4_130 + 1;
				if (s7 == 0x05)
					break;
				word32 a0_105;
				up32 s4_108;
				word32 s8_109;
				word32 s2_119;
				word32 a5_1019;
				struct Eq_270424 * a2_112;
				ra_104 = _aws_iot_mqtt_internal_readWrapper(ra_104, s0, s7, (union Eq_269866 *) 0x01, fp + -0x0044, out s0, out a0_105, out a2_112, out a4_114, out a5_1019, out s2_119, out s4_108, out s8_109);
				word32 s1_120 = a0_105;
				if (a0_105 != 0x00)
					break;
				word32 a5_123 = CONVERT(Mem69[s0 + s7 + 576:byte], byte, word32);
				a4_114 = (a5_123 & 0x007F) + s8_109;
				union Eq_269866 * s2_129 = (word32) a4_114 + s2_119;
				if ((int32) (byte) a5_123 >= 0x00)
				{
					s0 = a2_112->t0038;
					if ((char *) s2_129 + (s4_108 + 2) >= a2_112)
					{
						union Eq_269866 * s4_163 = null;
						s7 = (word32) s0 + 576;
						ptr32 s8_165 = (word32) s0 + 0x04E0;
						do
						{
							word32 a0_200;
							struct Eq_270424 * a5_205;
							word32 tp_212;
							word32 t5_701;
							word32 t1_700;
							word32 t6_702;
							(*((word32) s0 + 0x04E4))();
							s1_120 = a0_200;
							if (a0_200 != 0x00)
							{
								if (s4_163 < s2_129)
									goto l2305102E;
								break;
							}
							s4_163 += a5_205;
							s8_165 = sp_169->ptr00E4;
							s0 = a5_205->t0038;
							a2_112 = s2_129 - s4_163;
							if (a5_205 < a2_112)
								a2_112 = a5_205;
						} while (s4_163 < s2_129);
						if (s2_129 == s4_163)
							*((word32) s0 + 60) = 0x00;
						break;
					}
					if (s2_129 != null)
					{
						word32 a0_138;
						word32 a5_139;
						word32 s2_152;
						word32 s4_1021;
						word32 s8_1022;
						word32 a2_1020;
						ra_104 = _aws_iot_mqtt_internal_readWrapper(ra_104, s0, s4_108 + 2, s2_129, fp + -72, out s0, out a0_138, out a2_1020, out a4_114, out a5_139, out s2_152, out s4_1021, out s8_1022);
						if (a0_138 != 0x00 || a5_139 != s2_152)
							break;
					}
					uint32 a5_157 = (word32) *((word32) s0 + 576);
					*((word32) s0 + 60) = 0x00;
					a2->u1 = (byte) (a5_157 >> 4);
					break;
				}
				s4_130 = s7;
			}
		}
l2305102E:
		Eq_2 a3_261;
		byte * s5_270;
		Eq_266005 a0_258;
		up32 t1_274 = aws_iot_mqtt_client_unlock_mutex(s0, s6, a4_114, mstatus, sp_169->t0004, sp_169->t0028, sp_169->t0084, sp_169->t00F8, sp_169->t0138, sp_169->t0178, out s1_266, out a0_258, out a1, out a2, out a3_261, out a4, out s2, out s3, out s5_270, out s6);
		if (a0_258 != 0x00)
		{
			if ((s1_266 & 0x00FD) != 0x00)
				goto l23051040;
			goto l2305103E;
		}
		if (s1_266 != 0x02)
		{
			if (s1_266 == 0x00)
			{
				a4 = (word32) *s5_270 + ~0x01 & 0x00FF;
				if (a4 <= 11)
				{
					ui32 a5_288 = 0x01 << a4;
					a4 = a5_288 & 685;
					if ((a5_288 & 685) == 0x00)
					{
						a4 = a5_288 << 0x14;
						if (a5_288 << 0x14 >= 0x00)
						{
							s1_266.u0 = ~0x1E;
							if ((a5_288 & 0x02) != 0x00)
							{
								word32 s0_310 = (a5_288 & 0x02)->dw0038;
								sp_169->dw0080 = a5_288 & 0x02;
								sp_169->dw0000 = s0_310 + 576;
								sp_169->dw000C = 0x00;
								sp_169->w0016 = 0x00;
								sp_169->dw008C = 0x00;
								Eq_266005 a0_325;
								Eq_2 a3_336;
								Eq_2 ra_328 = aws_iot_mqtt_internal_deserialize_publish(t1_274, &sp_169->b0020 + 2, &sp_169->b0020, &sp_169->b0020 + 1, &sp_169->w0024, &sp_169->t0018, &sp_169->w0016, &sp_169->t0028, (char *) &sp_169->t0028 + 4, sp_169->t00A4, sp_169->dw0198, out s0, out a0_325, out a1, out a2, out a3_336, out a4, out s2, out s3, out s6, out s7);
								s1_266 = a0_325;
								if (a0_325 == 0x00)
								{
									Eq_2 s4_348 = (word32) sp_169->w0016;
									s1_266.u0 = ~0x01;
									if (s2 != 0x00)
									{
										aws_iot_mqtt_get_client_state(s0);
										word32 a2_1025;
										word32 s5_1026;
										word32 a0_1024;
										word32 s1_1023;
										Eq_2 s6_373;
										Eq_2 s4_367;
										Eq_2 s3_366;
										Eq_2 a4_360;
										Eq_2 a3_359;
										Eq_2 a1_357;
										Eq_2 s2_365;
										Eq_2 s0_363 = aws_iot_mqtt_set_client_state(~0x01, s0, 0x09, a3_336, a4, s3, s4_348, mstatus, sp_169->t0008, sp_169->t00D8, sp_169->t0118, sp_169->t0158, out s1_1023, out a0_1024, out a1_357, out a2_1025, out a3_359, out a4_360, out s2_365, out s3_366, out s4_367, out s5_1026, out s6_373);
										s7 = (word32) s0_363 + 0x04D8;
										word32 s5_381 = s2_365 + s4_367;
										s10.u0 = 47;
										Eq_2 s8_383 = 43;
										Eq_2 s9_384 = 35;
										do
										{
											struct Eq_270732 * s1_387 = *a1_357;
											if (a1_357 != 0x00)
											{
												Eq_2 a5_397;
												if ((word32) s1_387->w0004 != s4_367)
												{
l2305113A:
													s1_387 = (struct Eq_270732 *) *a3_359;
													a5_397 = s2_365;
													if (a3_359 == 0x00)
														goto l23051140;
													while (true)
													{
														a4_360 = (word32) *a3_359;
														if (a4_360 == 0x00)
															break;
														if (a5_397 >= s5_381)
															goto l23051140;
														Eq_2 a2_488 = (word32) *a5_397;
														if (a2_488 == s10)
														{
															if (a4_360 != s10)
																goto l23051140;
														}
														else if (a4_360 != s8_383)
														{
															if (a4_360 != s9_384)
															{
																if (a2_488 != a4_360)
																	goto l23051140;
															}
															else
																a5_397 = (word32) s5_381 - 1;
														}
														else
														{
															while (true)
															{
																Eq_2 a4_490 = (word32) a5_397 + 1;
																if (s5_381 == a4_490 || (word32) (*((word32) a5_397 + 1)) == s10)
																	break;
																a5_397 = a4_490;
															}
														}
														a3_359 = (word32) a3_359 + 1;
														a5_397 = (word32) a5_397 + 1;
													}
													if (s5_381 == a5_397)
														goto l2305118E;
													goto l23051140;
												}
												word32 a2_1027;
												if (strncmp(s2_365, a1_357, s4_367, out a1_357, out a2_1027, out a3_359, out a4_360, out a5_397) != 0x00)
													goto l2305113A;
l2305118E:
												s1_387 = (struct Eq_270732 *) *((word32) a5_397 + 8);
												if (a5_397 != 0x00)
												{
													word32 a5_477;
													word32 tp_484;
													word32 t1_485;
													word32 t5_486;
													word32 t6_487;
													a5_397();
												}
											}
l23051140:
											Eq_2 s1_506 = &s1_387->w0004 + 6;
										} while (s7 != s1_506);
										Eq_266005 a0_530;
										word32 s1_1028;
										word32 a3_1029;
										word32 s4_1030;
										word32 s5_1031;
										s0 = aws_iot_mqtt_set_client_state(s1_506, s0_363, s6_373, a3_359, a4_360, s3_366, s4_367, mstatus, sp_169->t0008, sp_169->t00D8, sp_169->t0118, sp_169->t0158, out s1_1028, out a0_530, out a1, out a2, out a3_1029, out a4, out s2, out s3, out s4_1030, out s5_1031, out s6);
										s1_266 = a0_530;
										if (a0_530 == 0x00 && (word32) sp_169->b0020 != 0x00)
										{
											Eq_266005 a0_561;
											Eq_2 a3_568;
											s0 = aws_iot_mqtt_internal_serialize_ack((word32) *((word32) a1 + 52) + 64, a1, (struct Eq_263391 *) 0x04, null, (word32) sp_169->w0024, (char *) &sp_169->t0018 + 4, sp_169->t0128, out a0_561, out a1, out a2, out a3_568, out a4, out s2, out s3);
											s1_266 = a0_561;
											if (a0_561 == 0x00)
											{
												word32 s1_1032;
												word32 a3_1033;
												word32 s4_1034;
												word32 s5_1035;
												aws_iot_mqtt_internal_send_packet(ra_328, s0, a1, s3, a3_568, a4, mstatus, sp_169->t0054, sp_169->t00C8, sp_169->t0108, sp_169->t0128, out s0, out s1_1032, out a0_258, out a1, out a2, out a3_1033, out a4, out s2, out s3, out s4_1034, out s5_1035, out s6, out mstatus);
l2305103E:
												s1_266 = a0_258;
												goto l23051040;
											}
										}
									}
								}
							}
						}
						else
						{
							up32 a1_291 = (word32) *((word32) s0 + 40);
							*((word32) s0 + 25) = 0x00;
							s0 = countdown_sec(ra_104, s0, a1_291, a3_261, sp_169->t0018, sp_169->t0060, sp_169->t0064, sp_169->t0088, sp_169->t00AC, out s1_266, out a1, out a2);
						}
					}
				}
				else
					s1_266.u0 = ~0x1E;
			}
		}
		else
			s1_266.u0 = 0x00;
	}
l23051040:
	s0Out = s0;
	s1Out = dwArg28;
	a0Out = s1_266;
	a1Out = a1;
	a2Out = a2;
	a3Out = dwArg08;
	a4Out = a4;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArgDC;
	s5Out = s4;
	s6Out = s6;
	s7Out = s7;
	s10Out = s10;
	mstatusOut = mstatus;
	return dwArg68;
}

// 2305120E: void aws_iot_mqtt_internal_flushBuffers(Register Eq_2 a0)
// Called from:
//      aws_iot_mqtt_connect
void aws_iot_mqtt_internal_flushBuffers(Eq_2 a0)
{
	*((word32) a0 + 60) = 0x00;
}

// 23051216: Register Eq_2 aws_iot_mqtt_internal_wait_for_read(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_263770 a0Out, Register out (ptr32 Eq_263771) a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s7Out, Register out Eq_2 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      aws_iot_mqtt_connect
//      aws_iot_mqtt_publish
//      aws_iot_mqtt_subscribe
//      aws_iot_mqtt_resubscribe
//      aws_iot_mqtt_unsubscribe
Eq_2 aws_iot_mqtt_internal_wait_for_read(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArg0108, Eq_2 dwArg0148, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_263770 & a0Out, struct Eq_263771 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s7Out, union Eq_2 & s10Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out.u0 = ~0x01;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s7Out = s7;
		s10Out = s10;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 s1_14 = a0;
		Eq_263770 a0_125 = ~0x01;
		if (a2 != 0x00)
		{
			s0 = a2;
			do
			{
				word32 a0_29;
				word32 a2_219;
				word32 a5_220;
				word32 s4_221;
				word32 s8_222;
				s1_14 = has_timer_expired(a2, a3, a4, mstatus, dwLoc0C, dwLoc08, dwArg18, dwArg0108, dwArg0148, out a0_29, out a1, out a2_219, out a3, out a4, out a5_220, out s2, out s3, out s4_221, out s8_222);
				if (a0_29 != 0x00)
				{
					a0_125.u0 = ~0x1B;
					break;
				}
				word32 s4_216;
				word32 s5_217;
				word32 s6_218;
				ra = aws_iot_mqtt_internal_cycle_read(ra, s1_14, s0, fp + ~0x10, a3, a4, s2, s10, mstatus, dwArg04, dwArg64, dwArg78, dwArgB8, out s0, out s1_14, out a0_125, out a1, out a2, out a3, out a4, out s2, out s3, out s4_216, out s5_217, out s6_218, out s7, out s10, out mstatus);
			} while ((a0_125 & 0x00FD) == 0x00 && s2 != 0x00);
		}
		s0Out = s0;
		s1Out = s1_14;
		a0Out = a0_125;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = dwArg04;
		s7Out = s7;
		s10Out = s10;
		mstatusOut = mstatus;
		return ra;
	}
}

