pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 23051266: Register Eq_2 aws_iot_mqtt_internal_serialize_zero(Register (ptr32 Eq_263957) a0, Register Eq_2 a1, Register (ptr32 Eq_263391) a2, Register (ptr32 word32) a3, Register out (ptr32 Eq_263957) s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out (ptr32 Eq_263391) a2Out, Register out (ptr32 word32) a3Out, Register out ptr32 a4Out, Register out (ptr32 word32) s2Out, Register out ptr32 s4Out)
// Called from:
//      _aws_iot_mqtt_internal_disconnect
//      aws_iot_mqtt_yield
Eq_2 aws_iot_mqtt_internal_serialize_zero(struct Eq_263957 * a0, Eq_2 a1, struct Eq_263391 * a2, word32 * a3, struct Eq_263957 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, struct Eq_263391 & a2Out, word32 & a3Out, ptr32 & a4Out, word32 & s2Out, ptr32 & s4Out)
{
	Eq_2 s0_13 = ~0x01;
	if (a0 != null && a3 != null)
	{
		s0_13.u0 = -33;
		if (a1 > 0x03)
		{
			Eq_2 a5_31;
			Eq_2 a0_28 = aws_iot_mqtt_internal_init_header(fp + ~0x17, a2, 0x00, null, 0x00, out a1, out a3, out a4, out a5_31);
			s2 = a3;
			s1 = a0;
			a2 = null;
			s0_13 = a0_28;
			if (a0_28 == 0x00)
			{
				word32 a5_46;
				word32 a5_94;
				*a3 = aws_iot_mqtt_internal_write_len_to_buffer(aws_iot_mqtt_internal_write_char(0x00, a5_31, out a5_94), 0x00, out a1, out a3, out a4, out a5_46) + a5_46 - a0;
				a2 = dwArgC4;
			}
		}
	}
	s1Out = s1;
	a0Out = s0_13;
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	s2Out = s2;
	s4Out = dwArg04;
	return s0_13;
}

// 230512C6: void format_int(Register (ptr32 byte) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register ui32 a4, Register Eq_2 a5, Register int32 a6, Register int32 a7, Register Eq_2 s3, Stack ui32 dwArg08)
void format_int(byte * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, ui32 a4, Eq_2 a5, int32 a6, int32 a7, Eq_2 s3, ui32 dwArg08)
{
	byte * s0_160 = a0;
	Eq_2 s6_37 = a2;
	Eq_2 s7_387 = a3;
	ui32 s8_40 = a4;
	int32 s11_169 = a6;
	int32 s1_101 = a7;
	ui32 s3_131 = 0x00;
	if ((a4 & 64) != 0x00 && a3 < 0x00)
	{
		s6_37 = 0x00 - a2;
		s7_387 = 0x00 - a3 - (word32) (s6_37 != 0x00);
		s3_131 = 0x01;
	}
	Eq_2 a0_62 = s6_37;
	Eq_2 a1_64 = s7_387;
	int32 s2_65 = 0x00;
	a5_379 = a5;
	while (true)
	{
		Eq_2 a5_379;
		if ((a0_62 | a1_64) == 0x00)
			break;
		word32 a3_1067;
		word32 a4_1068;
		a0_62 = __udivdi3(a0_62, a1_64, a5_379, a5 >> 0x1F, out a1_64, out a3_1067, out a4_1068, out a5_379);
		++s2_65;
	}
	Eq_2 a0_422 = a4 & 32;
	if ((a4 & 32) != 0x00 && a5_379 == 0x08)
	{
		if (s2_65 < a7)
		{
l23051354:
			int32 s10_115 = s1_101;
			if ((a4 & 8) != 0x00)
			{
				s10_115 = 0x04;
				if (a5_379 != 0x10)
					s10_115 = 0x03;
			}
			int32 s2_125 = (s1_101 + -1 ^ s10_115) + s1_101;
			int32 s1_135 = (word32) ((a4 & 20 | s3_131) != 0x00) + s2_125;
			if ((a4 & 32) != 0x00 && a5_379 == 0x10)
				s1_135 += 0x02;
			Eq_2 a3_144 = 0x00;
			if ((a4 & 3) == 0x00)
			{
				a3_144 = a4 & 3;
				if (s1_135 < a6)
				{
					a3_144 = a6 - s1_135;
					Eq_2 a2_155 = 0x00;
					do
					{
						if (a2_155 < a1)
						{
							*s0_160 = 0x20;
							++s0_160;
						}
						a2_155 = (word32) a2_155 + 1;
					} while (a2_155 != a3_144);
					s11_169 = s1_135;
				}
			}
			if (s3_131 != 0x00)
			{
				if (a3_144 < a1)
				{
					*s0_160 = 0x2D;
					++s0_160;
				}
			}
			else if ((a4 & 4) != 0x00)
			{
				if (a3_144 < a1)
				{
					*s0_160 = 0x2B;
					++s0_160;
				}
			}
			else
			{
				if ((a4 & 16) == 0x00)
				{
l230513C8:
					if ((a4 & 32) != 0x00 && a5_379 == 0x10)
					{
						if (a3_144 < a1)
						{
							*s0_160 = 0x30;
							++s0_160;
						}
						if ((word32) a3_144 + 1 < a1)
						{
							int32 a2_233 = 88;
							if ((a4 & 0x0080) == 0x00)
								a2_233 = 0x0078;
							*s0_160 = (byte) a2_233;
							++s0_160;
						}
						a3_144 = (word32) a3_144 + 2;
					}
					if ((a4 & 3) == 0x01 && s2_125 < s11_169)
					{
						for (; s1_135 < s11_169; s11_169 += ~0x00)
						{
							if (a3_144 < a1)
							{
								*s0_160 = 0x30;
								++s0_160;
							}
							a3_144 = (word32) a3_144 + 1;
						}
					}
					struct Eq_271188 * s0_305 = s0_160 + s2_125;
					Eq_2 s4_323 = (word32) a3_144 + s2_125;
					int32 s5_345 = s10_115;
					struct Eq_271188 * s3_346 = s0_305;
					while (s2_125 > 0x00)
					{
						if (s5_345 != 0x00)
							s5_345 += ~0x00;
						else
						{
							s4_323 = (word32) s4_323 - 1;
							if (s4_323 < a1)
								s3_346[0x0FFF] = (struct Eq_271188) 0x5F;
							s3_346 = (struct Eq_271188 *) ((char *) s3_346 - 1);
							s2_125 += ~0x00;
							s5_345 = s10_115 + -1;
						}
						Eq_2 a5_395;
						s2_125 += ~0x00;
						if ((word32) s4_323 - 1 < a1)
						{
							a3_144 = (word32) *((word32) a5_395 + __umoddi3(s6_37, s7_387, a5_379, a3_144, out a5_395));
							s3_346[0x0FFF] = (struct Eq_271188) (byte) a3_144;
							a5_379 = a5_395;
						}
						Eq_2 a1_423;
						word32 a4_1069;
						a0_422 = __udivdi3(s6_37, s7_387, a5_379, a3_144, out a1_423, out a3_144, out a4_1069, out a5_379);
						s4_323 = s3;
						s6_37 = a0_422;
						s7_387 = a1_423;
						s8_40 = dwArg08;
					}
					ui32 a4_450 = s8_40 & 2;
					int32 a6_465 = (word32) a0_422 + s11_169;
					while (a4_450 != 0x00 && s1_135 < a6_465 - a0_422)
					{
						if (a0_422 < a1)
						{
							s0_305->b0000 = 0x20;
							++s0_305;
						}
						a0_422 = (word32) a0_422 + 1;
					}
					return;
				}
				if (a3_144 < a1)
				{
					*s0_160 = 0x20;
					++s0_160;
				}
			}
			a3_144 = (word32) a3_144 + 1;
			goto l230513C8;
		}
		s1_101 = s2_65 + 1;
	}
	if (s2_65 >= s1_101)
	{
		s1_101 = s2_65;
		if ((s6_37 | s7_387) == 0x00)
			s1_101 = 0x01;
	}
	goto l23051354;
}

// 23051520: Register Eq_2 cvt(Register Eq_2 ra, Register Eq_2 a0, Register Eq_64250 a1, Register Eq_2 a2, Register (ptr32 ptr32) a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg54, Stack Eq_2 dwArgE4, Stack word32 dwArg0164, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_64250 s4Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s8Out, Register out Eq_271320 s9Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      ecvtbuf
//      fcvtbuf
Eq_2 cvt(Eq_2 ra, Eq_2 a0, Eq_64250 a1, Eq_2 a2, ptr32 * a3, Eq_2 a4, Eq_2 a5, ptr32 fflags, ptr32 frm, Eq_2 dwArg54, Eq_2 dwArgE4, word32 dwArg0164, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_64250 & s4Out, ptr32 & s6Out, union Eq_2 & s7Out, union Eq_2 & s8Out, union Eq_271320 & s9Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	Eq_2 s1_15 = a5;
	Eq_64252 a5_189 = 78;
	Eq_64250 s2_38 = a1;
	ptr32 * s5_179 = a3;
	Eq_2 s0_174 = 78;
	if (a2 <= 78)
	{
		s0_174 = a2;
		if (a2 < 0x00)
			s0_174.u0 = 0x00;
	}
	__ledf2(a0, a1, a2, a3, fflags, frm);
	if (a0 >= 0x00)
		*a4 = 0x00;
	else
	{
		*(union Eq_2 *) 0x01 = a4;
		a5_189.u0 = 0x80000000;
		s2_38 = a1 ^ 0x80000000;
	}
	ptr32 frm_109;
	ptr32 s6_100;
	Eq_2 s7_195;
	ptr32 fflags_110;
	Eq_2 ra_108;
	modf(ra, a0, a1, a2, fflags, frm);
	0x00 = (uint16) dwArgE4;
	__eqdf2(a0, a1, a2, a3, fflags, frm);
	Eq_2 s3_177 = a0;
	Eq_64250 s4_178 = s2_38;
	Eq_2 s2_176 = (word32) a5 + 80;
	if (a0 == 0x00)
	{
		__gedf2(a0, a1, a2, a3, fflags, frm);
		s6_100 = 0x00;
		ra_108 = ra;
		frm_109 = frm;
		fflags_110 = fflags;
		if (a0 > 0x00)
		{
			s10 = g_t230885B8;
			s11 = g_t230885BC;
			ra_108 = ra;
			frm_109 = frm;
			fflags_110 = fflags;
			while (true)
			{
				int32 a0_226;
				Eq_64250 a1_227;
				Eq_2 a7_233;
				word32 s7_898;
				word32 s9_899;
				ra_108 = __muldf3(ra_108, s3_177, s4_178, s10, s11, fflags_110, frm_109, out s0_174, out s1_15, out a0_226, out a1_227, out a4, out a5_189, out a7_233, out s2_176, out s3_177, out s4_178, out s5_179, out s6_100, out s7_898, out s8, out s9_899, out fflags_110, out frm_109);
				__ledf2(a0, a1, a2, a3, fflags, frm);
				if (a0_226 >= 0x00)
					break;
				s3_177 = a7_233;
				s4_178 = a1_227;
			}
		}
		s7_195 = s1_15;
	}
	else
	{
		Eq_2 s8_78 = g_t230885BC;
		Eq_2 s7_106 = g_t230885B8;
		a5_189 = g_t230885C0;
		s11 = (word32) a5 + 80;
		dwArg18 = g_t230885C4;
		s10 = s8_78;
		ra_108 = ra;
		frm_109 = frm;
		fflags_110 = fflags;
		while (true)
		{
			0x00 = dwArg0164;
			__eqdf2(a0, a1, a2, a3, fflags, frm);
			dwLoc64 = a4;
			s6_100 = s2_176 - s11;
			s8 = dwArg54;
			if (a4 == 0x00)
				break;
			Eq_2 a0_111;
			uint32 a1_112;
			Eq_64620 a3_114;
			ptr32 fflags_126;
			ptr32 frm_127;
			Eq_2 s9_138;
			word32 s0_909;
			word32 s1_910;
			word32 s2_911;
			word32 s3_912;
			Eq_2 ra_128 = __divdf3(ra_108, a4, a5_189, s7_106, dwArg54, fflags_110, frm_109, out s0_909, out s1_910, out a0_111, out a1_112, out a3_114, out s2_911, out s3_912, out s9_138, out fflags_126, out frm_127);
			modf(ra, a0, a1, a2, fflags, frm);
			Eq_64250 a1_145;
			Eq_2 a0_156;
			Eq_64250 a1_157;
			word32 a5_914;
			word32 s6_916;
			word32 a4_913;
			word32 s8_917;
			word32 s9_918;
			word32 a7_915;
			ra_108 = __muldf3(ra_128, __adddf3(ra_128, a0_111, a1_112, fp + -80, a3_114, fflags_126, frm_127, out a1_145), a1_145, s9_138, s8_78, fflags_126, frm_127, out s0_174, out s1_15, out a0_156, out a1_157, out a4_913, out a5_914, out a7_915, out s2_176, out s3_177, out s4_178, out s5_179, out s6_916, out s7_106, out s8_917, out s9_918, out fflags_110, out frm_109);
			s11 += ~0x00;
			word32 a1_919;
			word32 a3_920;
			s11->u1 = (byte) ((word32) __fixdfsi(ra_108, a0_156, a1_157, fflags_110, frm_109, out a1_919, out a3_920, out a4, out a5_189) + 48);
		}
		s7_195 = s1_15;
		while (s11 < s2_176)
		{
			++s11;
			a5_189 = (word32) *((word32) s11 - 1);
			s7_195 = (word32) s7_195 + 1;
			((word32) s7_195 + 0x0FFF)->u1 = (byte) a5_189;
		}
	}
	word32 s0_281 = s0_174 + s1_15;
	if (a5_189 == 0x00)
		s0_281 = (word32) s0_281 + s6_100;
	*s5_179 = s6_100;
	if (s0_281 >= s1_15)
	{
		s8 = g_t230885B8;
		Eq_2 s9_305 = g_t230885BC;
		while (s0_281 >= s7_195 && s7_195 < s2_176)
		{
			Eq_2 a0_320;
			Eq_64250 a1_321;
			struct Eq_271518 * s7_345;
			word32 s0_900;
			word32 a5_902;
			word32 a7_903;
			word32 s3_904;
			word32 s4_905;
			word32 a4_901;
			ra_108 = __muldf3(ra_108, s3_177, s4_178, s8, s9_305, fflags_110, frm_109, out s0_900, out s1_15, out a0_320, out a1_321, out a4_901, out a5_902, out a7_903, out s2_176, out s3_904, out s4_905, out s5_179, out s6_100, out s7_345, out s8, out s9_305, out fflags_110, out frm_109);
			modf(ra, a0, a1, a2, fflags, frm);
			word32 a3_907;
			word32 a1_906;
			word32 a5_908;
			s7_345->b1000 = (byte) ((word32) __fixdfsi(ra_108, a0_320, a1_321, fflags_110, frm_109, out a1_906, out a3_907, out a4, out a5_908) + 48);
			s3_177 = a0_320;
			s4_178 = a1_321;
			s0_281 = dwArgE4;
			s7_195 = (char *) s7_345 + 1;
		}
		if (s0_281 >= s2_176)
			((word32) s1_15 + 79)->u1 = 0x00;
		else
		{
			s0_281->u1 = (byte) ((word32) *s0_281 + 0x05);
			Eq_2 a2_369 = 57;
			Eq_2 a5_374 = s0_281;
			while (true)
			{
				a4 = (word32) *a5_374;
				if (a2_369 >= a4)
					break;
				a5_374->u1 = 0x30;
				if (s1_15 < a5_374)
				{
					a5_374 += ~0x00;
					a5_374->u1 = (byte) ((word32) *((word32) a5_374 - 1) + 0x01);
				}
				else
				{
					a5_374->u1 = 0x31;
					ptr32 a4_385 = *s5_179;
					*s5_179 = a4_385 + 0x01;
					a2_369 = dwArg54;
					if (a4_385 == 0x01)
					{
						if (s1_15 < s0_281)
							s0_281->u1 = 0x30;
						++s0_281;
					}
				}
			}
			s0_281->u1 = 0x00;
		}
	}
	else
		s1_15->u1 = 0x00;
	s0Out = s0_281;
	s1Out = dwLoc64;
	a0Out = dwArgA4;
	a4Out = a4;
	s2Out = s2_176;
	s3Out = s3_177;
	s4Out = s4_178;
	s6Out = s6_100;
	s7Out = s7_195;
	s8Out = s8;
	s9Out = dwArg18;
	s10Out = s10;
	s11Out = s11;
	fflagsOut = fflags_110;
	frmOut = frm_109;
	return dwLoc24;
}

// 2305175A: Register Eq_2 ecvtbuf(Register Eq_2 ra, Register Eq_2 a0, Register Eq_64250 a1, Register Eq_2 a2, Register (ptr32 ptr32) a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg54, Stack Eq_2 dwArgE4, Stack word32 dwArg0164, Register out ptr32 s0Out, Register out (ptr32 (arr byte)) s1Out, Register out (ptr32 byte) a0Out, Register out ptr32 a4Out, Register out Eq_271693 s2Out, Register out Eq_271694 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out Eq_271699 s10Out, Register out Eq_271700 s11Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      flt
Eq_2 ecvtbuf(Eq_2 ra, Eq_2 a0, Eq_64250 a1, Eq_2 a2, ptr32 * a3, Eq_2 a4, Eq_2 a5, ptr32 fflags, ptr32 frm, Eq_2 dwArg54, Eq_2 dwArgE4, word32 dwArg0164, ptr32 & s0Out, byte (& s1Out, byte & a0Out, ptr32 & a4Out, union Eq_271693 & s2Out, union Eq_271694 & s3Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, union Eq_271699 & s10Out, union Eq_271700 & s11Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	byte * a0_14;
	ptr32 a4_18;
	ptr32 fflags_22;
	ptr32 frm_23;
	ptr32 s0_25;
	byte (* s1_26)[];
	Eq_271699 s10_27;
	Eq_271700 s11_28;
	Eq_271693 s2_29;
	Eq_271694 s3_30;
	ptr32 s4_31;
	ptr32 s6_32;
	ptr32 s7_33;
	ptr32 s9_35;
	word32 s8_61;
	Eq_2 ra_24 = cvt(ra, a0, a1, a2, a3, a4, a5, fflags, frm, dwArg54, dwArgE4, dwArg0164, out s0_25, out s1_26, out a0_14, out a4_18, out s2_29, out s3_30, out s4_31, out s6_32, out s7_33, out s8_61, out s9_35, out s10_27, out s11_28, out fflags_22, out frm_23);
	s0Out = s0_25;
	s1Out = s1_26;
	a0Out = a0_14;
	a4Out = a4_18;
	s2Out = s2_29;
	s3Out = s3_30;
	s4Out = s4_31;
	s6Out = s6_32;
	s7Out = s7_33;
	s9Out = s9_35;
	s10Out = s10_27;
	s11Out = s11_28;
	fflagsOut = fflags_22;
	frmOut = frm_23;
	return ra_24;
}

// 23051760: Register word32 fcvtbuf(Register Eq_2 ra, Register Eq_2 a0, Register Eq_64250 a1, Register Eq_2 a2, Register (ptr32 ptr32) a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg54, Stack Eq_2 dwArgE4, Stack word32 dwArg0164, Register out (ptr32 (arr byte)) s1Out, Register out (ptr32 byte) a0Out, Register out ptr32 a4Out, Register out Eq_271753 s2Out, Register out Eq_271754 s3Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out Eq_271757 s8Out)
// Called from:
//      flt
word32 fcvtbuf(Eq_2 ra, Eq_2 a0, Eq_64250 a1, Eq_2 a2, ptr32 * a3, Eq_2 a4, Eq_2 a5, ptr32 fflags, ptr32 frm, Eq_2 dwArg54, Eq_2 dwArgE4, word32 dwArg0164, byte (& s1Out, byte & a0Out, ptr32 & a4Out, union Eq_271753 & s2Out, union Eq_271754 & s3Out, ptr32 & s6Out, ptr32 & s7Out, union Eq_271757 & s8Out)
{
	byte * a0_14;
	ptr32 a4_18;
	word32 s0_25;
	byte (* s1_26)[];
	Eq_271753 s2_29;
	Eq_271754 s3_30;
	ptr32 s6_32;
	ptr32 s7_33;
	Eq_271757 s8_34;
	word32 s4_55;
	word32 s9_56;
	word32 s10_57;
	word32 s11_58;
	word32 fflags_59;
	word32 frm_60;
	cvt(ra, a0, a1, a2, a3, a4, a5, fflags, frm, dwArg54, dwArgE4, dwArg0164, out s0_25, out s1_26, out a0_14, out a4_18, out s2_29, out s3_30, out s4_55, out s6_32, out s7_33, out s8_34, out s9_56, out s10_57, out s11_58, out fflags_59, out frm_60);
	s1Out = s1_26;
	a0Out = a0_14;
	a4Out = a4_18;
	s2Out = s2_29;
	s3Out = s3_30;
	s6Out = s6_32;
	s7Out = s7_33;
	s8Out = s8_34;
	return s0_25;
}

