pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 23051766: void flt(Register Eq_2 ra, Register (ptr32 Eq_271791) a0, Register Eq_2 a1, Register Eq_64250 a2, Register word32 a3, Register Eq_2 a4, Register int32 a5, Register ui32 a6, Register Eq_2 s11, Register ptr32 fflags, Register ptr32 frm, Stack word32 dwArg64)
void flt(Eq_2 ra, struct Eq_271791 * a0, Eq_2 a1, Eq_64250 a2, word32 a3, Eq_2 a4, int32 a5, ui32 a6, Eq_2 s11, ptr32 fflags, ptr32 frm, word32 dwArg64)
{
	int32 s3_202;
	int32 s7_205 = a5;
	struct Eq_271791 * s1_198 = a0;
	Eq_2 s4_155 = a1;
	Eq_64250 s11_122 = a2;
	word32 s0_197 = a3;
	Eq_2 s6_109 = a4;
	ui32 s5_45 = a6;
	if ((a6 & 16) != 0x00)
	{
		s5_45 = a6 & -2;
		s3_202 = 32;
	}
	else
	{
		s3_202 = 48;
		if ((a6 & 1) == 0x00)
			s3_202 = 32;
	}
	int32 s2_201 = 0x00;
	if ((s5_45 & 2) != 0x00)
	{
		if (__ledf2(a1, a2, 0x00, null, fflags, frm) < 0x00)
		{
			s11_122 = a2 ^ 0x80000000;
			s0_197 = a3 + ~0x00;
			s2_201 = 45;
		}
		else if ((s5_45 & 4) != 0x00)
		{
			s0_197 = a3 + ~0x00;
			s2_201 = 43;
		}
		else if ((s5_45 & 8) != 0x00)
		{
			s0_197 = a3 + ~0x00;
			s2_201 = 32;
		}
	}
	if (a4 < 0x00)
		s6_109.u0 = 0x06;
	int32 a4_100;
	if ((a5 & 0x00FD) == 69)
		a4_100 = a5 + 32 & 0x00FF;
	else
		a4_100 = a5;
	struct Eq_271932 * a5_107;
	Eq_2 s10_111;
	Eq_2 s8_110;
	if (a4_100 == 0x0067)
	{
		int32 s6_156;
		word32 s9_2003;
		word32 a4_1999;
		word32 s0_1996;
		word32 s2_2000;
		word32 s1_1997;
		word32 a0_1998;
		word32 s10_2004;
		word32 s7_2002;
		word32 s3_2001;
		ra = ecvtbuf(ra, a1, s11_122, s6_109, fp + -232, fp + -228, fp + -144, fflags, frm, dwLocAC, s11, dwArg64, out s0_1996, out s1_1997, out a0_1998, out a4_1999, out s2_2000, out s3_2001, out s4_155, out s6_156, out s7_2002, out s9_2003, out s10_2004, out s11_122, out fflags, out frm);
		if (dwLocF4 >= 0x03 && dwLocF4 + -1 < s6_156)
		{
			s8_110 = s6_156 - dwLocF4;
			goto l23051924;
		}
		s10_111 = s6_156 + -1;
	}
	else
	{
		if (a4_100 != 101)
		{
			a5_107 = fp + -224;
			if (a4_100 != 0x0066)
				goto l230518CC;
			s8_110 = s6_109;
l23051924:
			word32 a4_190;
			int32 s8_206;
			struct Eq_271949 * a0_186;
			s0_197 = fcvtbuf(ra, s4_155, s11_122, s8_110, fp + -232, fp + -228, fp + -144, fflags, frm, dwLocAC, s11, dwArg64, out s1_198, out a0_186, out a4_190, out s2_201, out s3_202, out s6_109, out s7_205, out s8_206);
			a5_107 = fp + -224;
			if (a4_190 != 0x00)
				a5_107 = fp + -223;
			int32 a4_223 = (word32) a0_186->b0000;
			if (a4_223 != 0x00)
			{
				struct Eq_271949 * a3_244 = a0_186;
				if (a4_223 <= 0x00)
				{
					a5_107->b0000 = 0x30;
					a5_107[1] = (struct Eq_271932) 0x2E;
					ptr32 a3_268 = a5_107 + 2;
					struct Eq_271932 * a2_269 = a5_107 - a4_223;
					int32 a4_271 = 0x00 - a4_223;
					for (; a2_269 != a5_107; ++a5_107)
						a5_107[2] = (struct Eq_271932) 0x30;
					a5_107 = a3_268 + a4_271;
					while (true)
					{
						word32 a4_282 = (word32) a0_186->b0000;
						if (a4_282 == 0x00)
							break;
						++a5_107;
						a5_107[0x0FFF] = (struct Eq_271932) (byte) a4_282;
						++a0_186;
					}
				}
				else
				{
					do
					{
						struct Eq_271932 * a2_250 = a5_107;
						if (a4_223 == a3_244 - a0_186)
						{
							a5_107->b0000 = 0x2E;
							a2_250 = a5_107 + 1;
						}
						++a3_244;
						a2_250->b0000 = (byte) (word32) a3_244->bFFFFFFFF;
						a5_107 = a2_250 + 1;
					} while ((word32) a3_244->b0000 != 0x00);
				}
			}
			else
			{
				a5_107->b0000 = 0x30;
				if (s8_206 <= 0x00)
					++a5_107;
				else
				{
					a5_107[1] = (struct Eq_271932) 0x2E;
					byte * a4_230 = a5_107 + 2;
					struct Eq_271932 * a3_231 = a5_107 + s8_206;
					do
					{
						a5_107[2] = (struct Eq_271932) 0x30;
						++a5_107;
					} while (a3_231 != a5_107);
					a5_107 = (struct Eq_271932 *) (a4_230 + s8_206);
				}
			}
l230518CC:
			a5_107->b0000 = 0x00;
			if ((s5_45 & 32) != 0x00)
			{
				if (s6_109 == 0x00)
				{
					Eq_2 s6_538 = fp + -224;
					while (true)
					{
						int32 a5_543 = (word32) *s6_538;
						if (a5_543 == 0x00)
							break;
						if (a5_543 == 46)
							goto l23051A64;
						if ((a5_543 & 223) == 69)
						{
							word32 a1_2008;
							word32 a3_2009;
							word32 a5_2011;
							word32 a4_2010;
							word32 a0_554 = strnlen(s6_538, 0x0100, out a1_2008, out a3_2009, out a4_2010, out a5_2011) + s6_538;
							while (a0_554 - s6_538 > 0x00)
							{
								a0_554 = (struct Eq_272162 *) ((char *) a0_554 - 1);
								a0_554[2] = (struct Eq_272162) (byte) (word32) a0_554->b0000;
							}
							s6_538->u1 = 0x2E;
							goto l23051A64;
						}
						s6_538 = (word32) s6_538 + 1;
					}
					s6_538->u1 = 0x2E;
					((word32) s6_538 + 1)->u1 = 0x00;
				}
			}
			else if (s7_205 == 0x0067)
			{
				byte * a4_496 = fp + -224;
				do
				{
					int32 a5_500 = (word32) *a4_496;
					++a4_496;
					if (a5_500 == 0x00)
						goto l23051A64;
				} while (a5_500 != 46);
				while (true)
				{
					ui32 a5_506 = (word32) *a4_496;
					if (a5_506 == 0x00 || (a5_506 & 223) == 69)
						break;
					++a4_496;
				}
				byte * a5_511 = a4_496 + -1;
				while (true)
				{
					int32 a3_515 = (word32) *a5_511;
					if (a3_515 != 48)
						break;
					a5_511 += -1;
				}
				if (a3_515 == 46)
					a5_511 += -1;
				while (a4_496 != a5_511)
				{
					++a5_511;
					*a5_511 = 0x00;
				}
			}
l23051A64:
			word32 a4_2007;
			word32 a1_2005;
			word32 a3_2006;
			int32 a5_580;
			Eq_2 a0_578 = strnlen(fp + -224, 0x0100, out a1_2005, out a3_2006, out a4_2007, out a5_580);
			int32 a3_617 = s0_197 - a0_578;
			if ((s5_45 & 0x0011) == 0x00)
			{
				struct Eq_271791 * a5_644 = s1_198;
				int32 a2_645 = s1_198 + a3_617;
				while (a2_645 - a5_644 > 0x00)
				{
					++a5_644;
					a5_644[0x0FFF] = (struct Eq_271791) 0x20;
				}
				a5_580 = a3_617;
				if (a3_617 < 0x00)
					a5_580 = 0x00;
				s1_198 += a5_580;
				a3_617 = a3_617 + ~0x00 - a5_580;
			}
			if (s2_201 != 0x00)
			{
				s1_198->a0000[0] = (byte) s2_201;
				++s1_198;
			}
			if (a5_580 == 0x00)
			{
				struct Eq_271791 * a5_708 = s1_198;
				Eq_272174 a2_711 = s1_198 + a3_617;
				while (a2_711 - a5_708 > 0x00)
				{
					++a5_708;
					a5_708[0x0FFF] = (struct Eq_271791) (byte) s3_202;
				}
				int32 a5_719 = a3_617;
				if (a3_617 < 0x00)
					a5_719 = 0x00;
				s1_198 += a5_719;
				a3_617 = a3_617 + ~0x00 - a5_719;
			}
			Eq_2 a5_728 = 0x00;
			while (a5_728 < a0_578)
			{
				Mem739[s1_198 + a5_728:byte] = SLICE(CONVERT(Mem734[fp + -224 + a5_728:byte], byte, word32), byte, 0);
				a5_728 = (word32) a5_728 + 1;
			}
			if (a0_578 < 0x00)
				a0_578.u0 = 0x00;
			word32 a0_743 = a0_578 + s1_198;
			struct Eq_272190 * a5_744 = a0_743;
			int32 a2_748 = a0_743 + a3_617;
			while (a2_748 - a5_744 > 0x00)
			{
				++a5_744;
				a5_744[0x0FFF] = (struct Eq_272190) 0x20;
			}
			return;
		}
		s10_111 = s6_109;
	}
	byte * a0_310;
	word32 a4_314;
	ptr32 fflags_318;
	ptr32 frm_319;
	Eq_64250 s11_324;
	Eq_2 s4_327;
	word32 s9_331;
	int32 s10_323;
	ecvtbuf(ra, s4_155, s11_122, (word32) s10_111 + 1, fp + -232, fp + -228, fp + -144, fflags, frm, dwLocAC, s11, dwArg64, out s0_197, out s1_198, out a0_310, out a4_314, out s2_201, out s3_202, out s4_327, out s6_109, out s7_205, out s9_331, out s10_323, out s11_324, out fflags_318, out frm_319);
	struct Eq_271920 * a5_341 = fp + -224;
	if (a4_314 != 0x00)
		a5_341 = fp + -223;
	a5_341->b0000 = (byte) (word32) *a0_310;
	struct Eq_271924 * s8_349 = &a5_341->b0001;
	if (s10_323 > 0x00)
	{
		a5_341->b0001 = 0x2E;
		s8_349 = (struct Eq_271924 *) (&a5_341->b0001 + 1);
	}
	struct Eq_271935 * a0_356 = a0_310 + 1;
	struct Eq_271935 * a4_358 = a0_310 + 1 + s10_323;
	struct Eq_271924 * a5_360 = s8_349;
	while (a4_358 != a0_356)
	{
		++a0_356;
		++a5_360;
		a5_360[0x0FFF] = (struct Eq_271924) (byte) (word32) a0_356->bFFFFFFFF;
	}
	int32 a5_372 = 69;
	if (s9_331 == 0x00)
		a5_372 = 101;
	int32 a5_419;
	dwLocB4->b0000 = (byte) a5_372;
	if (s10_323 == 0x00)
	{
		if (__eqdf2(s4_327, s11_324, 0x00, null, fflags_318, frm_319) != 0x00)
		{
			s10_323 = ~0x00;
l2305188A:
			s10_323 = 0x00 - s10_323;
			a5_419 = 45;
l23051892:
			dwLocB4->b0001 = (byte) a5_419;
			dwLocB4->b0004 = (byte) ((s10_323 | 0x0A) + 48);
			dwLocB4->b0002 = (byte) ((s10_323 ^ 100 | 0x0A) + 48);
			dwLocB4->b0003 = (byte) ((s10_323 ^ 0x0A | 0x0A) + 48);
			a5_107 = (struct Eq_271932 *) (&dwLocB4->b0004 + 1);
			goto l230518CC;
		}
	}
	else
	{
		s10_323 += ~0x00;
		if (s10_323 < ~0x00)
			goto l2305188A;
	}
	a5_419 = 43;
	goto l23051892;
}

// 23051BA2: Register Eq_2 vsnprintf(Register Eq_2 ra, Register Eq_2 a0, Register Eq_7997 a1, Register (ptr32 Eq_274) a2, Register Eq_393 a3, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg010C, Register out ptr32 t0Out, Register out (ptr32 Eq_274) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_7997 a1Out, Register out (ptr32 Eq_274) a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_2 a7Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out Eq_393 s10Out, Register out Eq_2 s11Out, Register out ptr32 t4Out)
// Called from:
//      aos_cli_printf
//      vsprintf
//      sprintf
//      snprintf
//      Default_Handler
//      mbedtls_debug_print_msg
Eq_2 vsnprintf(Eq_2 ra, Eq_2 a0, Eq_7997 a1, struct Eq_274 * a2, Eq_393 a3, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgE8, Eq_2 dwArg010C, ptr32 & t0Out, struct Eq_274 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_7997 & a1Out, struct Eq_274 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & a7Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, ptr32 & s9Out, union Eq_393 & s10Out, union Eq_2 & s11Out, ptr32 & t4Out)
{
	while (true)
	{
		struct Eq_274 * s0_56 = a2 + 1;
		ptr32 a5_58 = (word32) a2->b0000;
		if (a5_58 == 0x00)
			break;
		a4 = 0x04;
		if (true)
		{
			<anonymous> * a4_91 = g_ptr230883C4;
			Eq_2 ra_102;
			struct Eq_274 * s0_103;
			ptr32 s1_104;
			ptr32 s2_105;
			ptr32 s3_106;
			ptr32 s4_107;
			ptr32 s5_108;
			ptr32 s6_109;
			Eq_2 s7_110;
			ptr32 s8_111;
			ptr32 s9_112;
			Eq_393 s10_113;
			Eq_2 s11_114;
			ptr32 a0_115;
			Eq_7997 a1_116;
			Eq_2 a3_117;
			ptr32 a5_118;
			struct Eq_274 * a2_119;
			ptr32 a4_120;
			ptr32 t0_121;
			ptr32 t4_122;
			Eq_2 a7_123;
			a4_91();
			t0Out = t0_121;
			s0Out = s0_103;
			s1Out = s1_104;
			a0Out = a0_115;
			a1Out = a1_116;
			a2Out = a2_119;
			a3Out = a3_117;
			a4Out = a4_120;
			a5Out = a5_118;
			a7Out = a7_123;
			s2Out = s2_105;
			s3Out = s3_106;
			s4Out = s4_107;
			s5Out = s5_108;
			s6Out = s6_109;
			s7Out = s7_110;
			s8Out = s8_111;
			s9Out = s9_112;
			s10Out = s10_113;
			s11Out = s11_114;
			t4Out = t4_122;
			return ra_102;
		}
		a2 = s0_56;
	}
	if (a1 > 0x00)
		a0->u1 = 0x00;
	else if (a1 != 0x00)
		Mem63[a1 + a0 + 0x0FFF:byte] = 0x00;
	t0Out = s4;
	s0Out = s0_56;
	s1Out = dwLoc64;
	a0Out = 0x00;
	a1Out = a1;
	a2Out = a2;
	a3Out = dwArg78;
	a4Out = a4;
	a5Out = a5_58;
	a7Out = dwArg58;
	s2Out = 0x00;
	s3Out = 0x00;
	s4Out = 0x00;
	s5Out = s5;
	s6Out = ~0x00;
	s7Out = a0;
	s8Out = 0x00;
	s9Out = 0x230885F8;
	s10Out = a3;
	s11Out = a0;
	t4Out = dwLoc08;
	return dwLoc24;
}

