pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
<anonymous> g_t23051C16 = <code>;
// 23052074: Register Eq_2 vsprintf(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_274) a1, Register Eq_393 a2, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg010C, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 a7Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 t4Out)
// Called from:
//      vprint
Eq_2 vsprintf(Eq_2 ra, Eq_2 a0, struct Eq_274 * a1, Eq_393 a2, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArgA4, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgE8, Eq_2 dwArg010C, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & a7Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & t4Out)
{
	ptr32 a0_11;
	ptr32 a3_12;
	ptr32 a5_13;
	ptr32 a7_14;
	ptr32 s0_16;
	ptr32 s1_17;
	ptr32 s10_18;
	ptr32 s11_19;
	ptr32 s2_20;
	ptr32 s3_21;
	ptr32 s4_22;
	ptr32 s6_23;
	ptr32 s7_24;
	ptr32 s8_25;
	ptr32 s9_26;
	ptr32 t4_29;
	ptr32 a1_30;
	ptr32 a4_32;
	ptr32 s5_33;
	word32 t0_60;
	word32 a2_61;
	Eq_2 ra_15 = vsnprintf(ra, a0, 480, a1, a2, dwArg58, dwArg78, dwArgA4, dwArgC0, dwArgC4, dwArgE8, dwArg010C, out t0_60, out s0_16, out s1_17, out a0_11, out a1_30, out a2_61, out a3_12, out a4_32, out a5_13, out a7_14, out s2_20, out s3_21, out s4_22, out s5_33, out s6_23, out s7_24, out s8_25, out s9_26, out s10_18, out s11_19, out t4_29);
	s0Out = s0_16;
	s1Out = s1_17;
	a0Out = a0_11;
	a1Out = a1_30;
	a3Out = a3_12;
	a4Out = a4_32;
	a5Out = a5_13;
	a7Out = a7_14;
	s2Out = s2_20;
	s3Out = s3_21;
	s4Out = s4_22;
	s5Out = s5_33;
	s6Out = s6_23;
	s7Out = s7_24;
	s8Out = s8_25;
	s9Out = s9_26;
	s10Out = s10_18;
	s11Out = s11_19;
	t4Out = t4_29;
	return ra_15;
}

// 23052080: Register Eq_2 vprint(Register Eq_2 ra, Register (ptr32 Eq_274) a0, Register Eq_393 a1, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgFC, Register out Eq_2 s1Out, Register out (ptr32 Eq_274) a0Out, Register out Eq_393 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_148989 a5Out, Register out ptr32 a7Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 t4Out)
// Called from:
//      ef_log_debug
//      ef_log_info
//      ef_print
//      bl_printk
//      printf
Eq_2 vprint(Eq_2 ra, struct Eq_274 * a0, Eq_393 a1, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg94, Eq_2 dwArgB0, Eq_2 dwArgB4, Eq_2 dwArgD8, Eq_2 dwArgFC, union Eq_2 & s1Out, struct Eq_274 & a0Out, union Eq_393 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_148989 & a5Out, ptr32 & a7Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & t4Out)
{
	ui32 a5_5 = (word32) g_b4200D94A;
	if ((a5_5 & 0x00FF) == 0x00)
	{
		s1Out = s1;
		a0Out = a0;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_5 & 0x00FF;
		a7Out = a7;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		t4Out = t4;
		return ra;
	}
	else
	{
		ptr32 a3_21;
		ptr32 a7_24;
		word32 s0_26;
		Eq_2 s1_27;
		ptr32 s10_28;
		ptr32 s11_29;
		ptr32 s2_30;
		ptr32 s3_31;
		ptr32 s5_33;
		ptr32 s6_34;
		ptr32 s7_35;
		ptr32 s9_37;
		ptr32 t4_40;
		struct Eq_274 * a0_18;
		Eq_393 a1_19;
		ptr32 a4_22;
		Eq_148989 a5_23;
		ptr32 s4_122;
		ptr32 s8_138;
		Eq_2 ra_25 = vsprintf(ra, 1107388800, a0, a1, dwArg48, dwArg68, dwArg94, dwArgB0, dwArgB4, dwArgD8, dwArgFC, out s0_26, out s1_27, out a0_18, out a1_19, out a3_21, out a4_22, out a5_23, out a7_24, out s2_30, out s3_31, out s4_122, out s5_33, out s6_34, out s7_35, out s8_138, out s9_37, out s10_28, out s11_29, out t4_40);
		Eq_2 s0_41 = s0_26 + -1664;
		if (a0_18 > null)
		{
			while (true)
			{
				a1_19 = (word32) *s0_41;
				if (a1_19 == 0x00)
					break;
				s0_41 = bl_uart_data_send(s1_27, 0x00, a1_19, out a0_18, out a4_22, out a5_23, out s4_122, out s8_138);
			}
		}
		s1Out = s1_27;
		a0Out = a0_18;
		a1Out = a1_19;
		a2Out = dwArg10;
		a3Out = a3_21;
		a4Out = a4_22;
		a5Out = a5_23;
		a7Out = a7_24;
		s2Out = s2_30;
		s3Out = s3_31;
		s4Out = s4_122;
		s5Out = s5_33;
		s6Out = s6_34;
		s7Out = s7_35;
		s8Out = s8_138;
		s9Out = s9_37;
		s10Out = s10_28;
		s11Out = s11_29;
		t4Out = t4_40;
		return ra_25;
	}
}

// 230520C6: Register Eq_2 bl_putchar(Register Eq_2 s1, Register Eq_250258 a0, Register out ptr32 s4Out)
// Called from:
//      utils_hexdump
Eq_2 bl_putchar(Eq_2 s1, Eq_250258 a0, ptr32 & s4Out)
{
	ptr32 s4_15;
	word32 a0_24;
	word32 a4_25;
	word32 a5_26;
	word32 s8_27;
	Eq_2 s0_14 = bl_uart_data_send(s1, 0x00, a0 & 0x00FF, out a0_24, out a4_25, out a5_26, out s4_15, out s8_27);
	s4Out = s4_15;
	return s0_14;
}

// 230520DC: Register Eq_2 puts(Register Eq_2 a0, Register out ptr32 a0Out, Register out Eq_393 a1Out, Register out ptr32 a2Out, Register out Eq_395 a4Out, Register out (ptr32 byte) a5Out, Register out Eq_397 s4Out, Register out Eq_398 s8Out)
// Called from:
//      cb_altcp_recv_fn
//      cmd_stack_wifi
//      cmd_wifi
//      aos_loop_proc
//      vApplicationStackOverflowHook
//      event_cb_wifi_event
//      bfl_main
//      rxl_hwdesc_dump
//      scanu_start
//      mac_vsie_find
//      chan_upd_ctxt_status
//      hal_mib_dump
//      dump_cfg_entries
//      helper_record_dump
//      bl_txdatacfm
//      bl_utils_dump
//      wifi_edca_dump_cmd
//      wifi_sta_ip_info
//      cmd_wifi_raw_send
//      cmd_wifi_dump
//      wifi_sta_ip_set_cmd
//      cb_event_ind
//      ota_tcp_cmd
//      cmd_sys_time_now
//      ef_port_init
//      exception_entry
//      bl_irq_init
//      sec_trng_IRQHandler
//      bl_sec_pka_IRQHandler
//      bl_rand
//      _dump_rsa_data
//      cmd_gpio_get
//      Sec_Eng_AES_Link_Case_CBC_128
//      Sec_Eng_AES_Link_Case_CTR_128
//      Sec_Eng_AES_Link_Case_ECB_128
//      bl_sec_sha_IRQHandler
//      bl_sec_sha_test
//      bl_wifi_enable_irq
//      proc_entry_looprt
//      cmd_looprt_test
//      cmd_looprt_test_status
//      cmd_looprt_test_evt
//      cmd_looprt_test_evt_dump
//      cmd_looprt_test_schedule_evt1
//      cmd_looprt_test_schedule_evt2
//      dhcp_server_recv
//      ips_test_cmd
//      _startup_sntp
//      cmd_sntp_date
//      utils_hexdump
//      countdown_sec
//      bl_mtd_open
//      bloop_status_dump
Eq_2 puts(Eq_2 a0, ptr32 & a0Out, union Eq_393 & a1Out, ptr32 & a2Out, union Eq_395 & a4Out, byte & a5Out, union Eq_397 & s4Out, union Eq_398 & s8Out)
{
	ui32 a5_5 = (word32) g_b4200D94A;
	byte * a5_13 = a5_5 & 0x00FF;
	ptr32 s0_14 = 0x00;
	if ((a5_5 & 0x00FF) != 0x00)
	{
		s1 = a0;
		s0_14 = 0x00;
		while (true)
		{
			a5_13 = (word32) a0 + s0_14;
			a1 = (word32) *a5_13;
			if (a1 == 0x00)
				break;
			word32 a0_76;
			word32 a5_77;
			s0_14 = (word32) bl_uart_data_send(a0, 0x00, a1, out a0_76, out a4, out a5_77, out s4, out s8) + 1;
		}
	}
	a0Out = s0_14;
	a1Out = a1;
	a2Out = dwArg10;
	a4Out = a4;
	a5Out = a5_13;
	s4Out = s4;
	s8Out = s8;
	return s1;
}

// 23052118: Register Eq_2 printf(Register Eq_2 ra, Register (ptr32 Eq_274) a0, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out (ptr32 Eq_282) s1Out, Register out (ptr32 Eq_283) a0Out, Register out (ptr32 Eq_284) a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_287) a4Out, Register out (ptr32 Eq_288) a5Out, Register out ptr32 a7Out, Register out (ptr32 Eq_290) s2Out, Register out (ptr32 byte) s3Out, Register out Eq_292 s4Out, Register out (ptr32 Eq_293) s5Out, Register out (ptr32 Eq_294) s6Out, Register out (ptr32 (arr byte)) s7Out, Register out ptr32 s8Out, Register out (ptr32 Eq_297) s9Out, Register out (ptr32 Eq_2) s10Out, Register out Eq_299 s11Out, Register out Eq_300 t4Out)
// Called from:
//      cb_httpc_headers_done_fn
//      cb_httpc_result
//      cmd_stack_wifi
//      cmd_exception_store
//      cmd_wifi
//      proc_hellow_entry
//      cmd_httpc_test
//      http_test_cmd
//      aos_loop_proc
//      vApplicationStackOverflowHook
//      vApplicationMallocFailedHook
//      event_cb_wifi_event
//      bfl_main
//      ShadowUpdateStatusCallback
//      windowActuate_Callback
//      aws_main_entry
//      mm_sta_add
//      rxl_hwdesc_dump
//      rxl_hwdesc_init
//      sta_mgmt_init
//      sta_mgmt_register
//      td_timer_end
//      td_reset
//      td_init
//      td_start
//      sm_get_bss_params
//      sm_connect_ind
//      sm_supplicant_deauth_cfm
//      sm_auth_handler
//      sm_assoc_rsp_handler
//      sm_handle_supplicant_result
//      apm_tx_cfm_handler
//      cfg_api_element_general_set
//      cfg_api_element_set
//      add_key_to_mac
//      add_mfp_key_to_mac
//      InitGroupKey
//      rf_pri_config_channel.constprop.9
//      rf_pri_txcal
//      rf_pri_roscal
//      rf_pri_rccal
//      rf_pri_lo_acal
//      rf_pri_fcal
//      hal_machw_init
//      hal_mib_dump
//      txl_buffer_update_thd
//      rxu_mgt_ind_handler
//      me_build_beacon
//      cfm_raw_send
//      scanu_raw_send_req_handler
//      rxu_mgt_ind_handler
//      sm_connect_req_handler
//      rxu_mgt_ind_handler
//      apm_start_req_handler
//      dump_cfg_entries
//      cfg_start_req_handler
//      helper_record_dump
//      ipc_host_init
//      bl_main_if_remove
//      bl_main_if_add
//      bl_main_apm_start
//      bl_main_apm_stop
//      bl_main_apm_sta_delete
//      bl_main_rtthread_start
//      bl_handle_dynparams
//      bl_send_msg
//      bl_msg_zalloc.constprop.3
//      bl_msg_update_channel_cfg
//      bl_send_me_config_req
//      bl_send_sm_connect_req
//      bl_rx_apm_sta_del_ind
//      bl_rx_apm_sta_add_ind
//      bl_rx_sm_connect_ind
//      bl_rx_sm_disconnect_ind
//      bl_rx_scanu_result_ind
//      bl_tx_push
//      bl_output
//      tcpip_stack_input
//      bl_utils_dump
//      printErrMsg
//      stateSnifferExit
//      stateSnifferAction
//      stateConnectedIPNoAction_ipgot
//      stateGlobalEnter
//      stateGlobalAction
//      stateConnectingEnter
//      stateConnectedIPNoExit
//      stateDisconnect_action_idle
//      stateDisconnect_action_reconnect
//      ip_obtaining_timeout
//      stateConnectedIPNoEnter
//      stateConnectedIPYesGuard_rcconfig
//      stateIdleAction_connect
//      stateGlobalGuard_fw_powersaving
//      stateGlobalGuard_conf_max_sta
//      stateGlobalGuard_AP
//      stateDisconnect_exit
//      disconnect_retry
//      stateGlobalGuard_fw_disconnect
//      stateConnectedIPYes_exit
//      stateIdleGuard_connect
//      stateIfaceDownGuard_phyup
//      stateGlobalGuard_stop
//      stateGlobalGuard_enable_autoreconnect
//      stateGlobalGuard_disable_autoreconnect
//      stateDisconnect_enter
//      stateGlobalGuard_fw_scan
//      stateGlobalExit
//      stateSnifferEnter
//      stateConnectingAction_connected
//      stateConnectingAction_disconnect
//      stateConnectingExit
//      stateIdleAction_sniffer
//      stateIdleEnter
//      stateIdleExit
//      stateIfaceDownAction_phyup
//      stateIfaceDownEnter
//      stateIfaceDownExit
//      stateConnectedIPNoAction_disconnect
//      stateConnectedIPYes_action
//      stateConnectedIPYes_enter
//      wifi_mgmr_event_notify
//      wifi_mgmr_start
//      cmd_wifi_state_get
//      wifi_sta_get_state_cmd
//      wifi_edca_dump_cmd
//      wifi_ap_sta_list_get_cmd
//      wifi_ap_sta_delete_cmd
//      cmd_wifi_cfg
//      cmd_wifi_ap_stop
//      wifi_sta_ip_info
//      cmd_wifi_ap_conf_max_sta
//      wifi_rc_fixed_enable
//      wifi_connect_cmd
//      wifi_capcode_cmd
//      wifi_mgmr_cli_scanlist
//      wifi_mgmr_sta_enable
//      wifi_mgmr_sta_connect
//      wifi_mgmr_scan_complete_callback
//      wifi_mgmr_profile_add
//      wifi_mgmr_profile_get
//      cb_probe_resp_ind
//      cb_disconnect_ind
//      cb_event_ind
//      cmd_mgr_llind
//      netif_status_callback
//      wifi_tx
//      bl606a0_wifi_init
//      utilfdt_print_data
//      tc_blfdtdump
//      tc_fdt_wifi
//      ota_tcp_cmd
//      cb_idnoe
//      cat_cmd
//      hexdump_cmd
//      proc_onecmd
//      ls_cmd
//      cli_main_input
//      console_cb_read
//      ef_port_init
//      psm_unset_cmd
//      psm_set_cmd
//      interrupt_entry
//      exception_entry
//      bl_tsen_adc_get
//      cmd_looprt_test
//      _led_bloop_evt
//      tcpip_input
//      stats_netstat
//      tcp_init
//      dhcp_server_stop
//      dhcpd_start
//      tcpc_entry
//      tcpclient_cmd
//      TCP_Server
//      cmd_tcp_server
//      iperf_server_udp
//      iperf_server_udp_recv_fn
//      iperf_client_udp
//      iperf_server
//      iperf_client_tcp
//      ipus_test_cmd
//      ipu_test_cmd
//      ipc_test_cmd
//      ips_test_cmd
//      ping_usage
//      ping_free
//      ping_timeout
//      ping_recv
//      ping_api_init
//      ping_cmd
//      romfs_lseek
//      cmd_sntp_date
//      cmd_sntp_time
//      sntp_recv
//      sntp_init
//      utils_hexdump
//      utils_getopt
//      aos_loop_init
//      aos_poll_read_fd
//      aos_loop_run
//      countdown_sec
//      iot_tls_connect
//      _iot_tls_verify_cert
//      iot_tls_write
//      mfg_media_read_xtal_capcode
//      mfg_media_read_poweroffset
//      mfg_media_read_macaddr
//      mfg_flash_read
//      bl_mtd_open
//      bloop_init
//      bloop_evt_set_async
//      bloop_evt_set_sync
//      bloop_evt_unset_sync
//      bloop_run
//      bloop_status_dump
//      loop_evt_entity_sys_handler
//      loop_evt_entity_sys_evt
//      mbedtls_pk_load_file
//      mbedtls_net_connect
//      mbedtls_net_recv
//      mbedtls_net_send
Eq_2 printf(Eq_2 ra, struct Eq_274 * a0, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC, struct Eq_282 & s1Out, struct Eq_283 & a0Out, struct Eq_284 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, struct Eq_287 & a4Out, struct Eq_288 & a5Out, ptr32 & a7Out, struct Eq_290 & s2Out, byte & s3Out, union Eq_292 & s4Out, struct Eq_293 & s5Out, struct Eq_294 & s6Out, byte (& s7Out, ptr32 & s8Out, struct Eq_297 & s9Out, union Eq_2 & s10Out, union Eq_299 & s11Out, union Eq_300 & t4Out)
{
	ui32 a5_7 = (word32) g_b4200D94A;
	struct Eq_288 * a5_22 = a5_7 & 0x00FF;
	if ((a5_7 & 0x00FF) != 0x00)
	{
		word32 a0_122;
		ra = vprint(ra, a0, fp + -28, dwArg08, dwArg28, a3, dwArg70, dwArg74, dwArg98, dwArgBC, out s1, out a0_122, out a1, out a2, out a3, out a4, out a5_22, out a7, out s2, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11, out t4);
	}
	s1Out = s1;
	a0Out = null;
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_22;
	a7Out = a7;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	t4Out = t4;
	return ra;
}

