pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 23052148: Register Eq_2 sprintf(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_274) a1, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg64, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgCC, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out Eq_157854 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      vTaskList
//      dhcpd_start
//      log_buf_out
Eq_2 sprintf(Eq_2 ra, Eq_2 a0, struct Eq_274 * a1, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg64, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgCC, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a5Out, ptr32 & s2Out, union Eq_157854 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	ptr32 a0_24;
	ptr32 a5_26;
	ptr32 s0_29;
	ptr32 s1_30;
	ptr32 s10_31;
	ptr32 s11_32;
	ptr32 s2_33;
	Eq_157854 s3_34;
	ptr32 s4_35;
	ptr32 s6_36;
	ptr32 s7_37;
	ptr32 s9_39;
	ptr32 s5_46;
	word32 t0_78;
	word32 a1_79;
	word32 a2_80;
	word32 a3_81;
	word32 a4_82;
	word32 a7_83;
	word32 s8_84;
	word32 t4_85;
	Eq_2 ra_28 = vsnprintf(ra, a0, ~0x00, a1, fp + -24, dwArg18, dwArg38, dwArg64, dwArg80, dwArg84, dwArgA8, dwArgCC, out t0_78, out s0_29, out s1_30, out a0_24, out a1_79, out a2_80, out a3_81, out a4_82, out a5_26, out a7_83, out s2_33, out s3_34, out s4_35, out s5_46, out s6_36, out s7_37, out s8_84, out s9_39, out s10_31, out s11_32, out t4_85);
	s0Out = s0_29;
	s1Out = s1_30;
	a0Out = a0_24;
	a5Out = a5_26;
	s2Out = s2_33;
	s3Out = s3_34;
	s4Out = s4_35;
	s5Out = s5_46;
	s6Out = s6_36;
	s7Out = s7_37;
	s9Out = s9_39;
	s10Out = s10_31;
	s11Out = s11_32;
	return ra_28;
}

// 2305216A: Register Eq_2 snprintf(Register Eq_2 ra, Register Eq_2 a0, Register Eq_7997 a1, Register (ptr32 Eq_274) a2, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg64, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgCC, Register out (ptr32 Eq_121035) s0Out, Register out Eq_121036 s1Out, Register out Eq_121037 a0Out, Register out Eq_121038 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_121042) a5Out, Register out ptr32 a7Out, Register out (ptr32 Eq_121044) s2Out, Register out Eq_121045 s3Out, Register out ptr32 s4Out, Register out (ptr32 Eq_121047) s5Out, Register out Eq_121048 s6Out, Register out ptr32 s7Out, Register out Eq_121050 s8Out, Register out ptr32 s9Out, Register out Eq_121052 s10Out, Register out ptr32 s11Out)
// Called from:
//      cmd_wifi_ap_start
//      ls_cmd
//      hal_gpio_init_from_dts
//      httpc_create_request_string.constprop.6
//      tcpc_entry
//      tcpclient_cmd
//      iperf_server_udp_recv_fn
//      iperf_client_udp
//      iperf_server
//      iperf_client_tcp
//      aws_iot_shadow_connect
//      convertDataToString
//      aws_iot_shadow_init_json_document
//      aws_iot_shadow_add_reported
//      FillWithClientTokenSize
//      aws_iot_finalize_json_document
//      topicNameFromThingAndAction
//      registerJsonTokenOnDelta
//      aws_iot_mqtt_set_connect_params
//      iot_tls_connect
//      mbedtls_x509_crt_info
//      mbedtls_x509_crt_verify_info
//      mbedtls_debug_print_ret
//      mbedtls_debug_print_buf
//      mbedtls_debug_print_mpi
//      mbedtls_debug_print_ecp
//      mbedtls_debug_print_crt
//      mbedtls_x509_dn_gets
//      mbedtls_x509_serial_gets
//      mbedtls_x509_sig_alg_gets
//      mbedtls_x509_key_size_helper
Eq_2 snprintf(Eq_2 ra, Eq_2 a0, Eq_7997 a1, struct Eq_274 * a2, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg64, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgCC, struct Eq_121035 & s0Out, union Eq_121036 & s1Out, union Eq_121037 & a0Out, union Eq_121038 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_121042 & a5Out, ptr32 & a7Out, struct Eq_121044 & s2Out, union Eq_121045 & s3Out, ptr32 & s4Out, struct Eq_121047 & s5Out, union Eq_121048 & s6Out, ptr32 & s7Out, union Eq_121050 & s8Out, ptr32 & s9Out, union Eq_121052 & s10Out, ptr32 & s11Out)
{
	Eq_121037 a0_21;
	ptr32 a3_22;
	struct Eq_121042 * a5_23;
	ptr32 a7_24;
	struct Eq_121035 * s0_26;
	Eq_121036 s1_27;
	Eq_121052 s10_28;
	ptr32 s11_29;
	struct Eq_121044 * s2_30;
	Eq_121045 s3_31;
	ptr32 s4_32;
	Eq_121048 s6_33;
	ptr32 s7_34;
	Eq_121050 s8_35;
	ptr32 s9_36;
	Eq_121038 a1_40;
	ptr32 a2_41;
	ptr32 a4_42;
	struct Eq_121047 * s5_43;
	word32 t0_80;
	word32 t4_81;
	Eq_2 ra_25 = vsnprintf(ra, a0, a1, a2, fp + -20, dwArg18, dwArg38, dwArg64, dwArg80, dwArg84, dwArgA8, dwArgCC, out t0_80, out s0_26, out s1_27, out a0_21, out a1_40, out a2_41, out a3_22, out a4_42, out a5_23, out a7_24, out s2_30, out s3_31, out s4_32, out s5_43, out s6_33, out s7_34, out s8_35, out s9_36, out s10_28, out s11_29, out t4_81);
	s0Out = s0_26;
	s1Out = s1_27;
	a0Out = a0_21;
	a1Out = a1_40;
	a2Out = a2_41;
	a3Out = a3_22;
	a4Out = a4_42;
	a5Out = a5_23;
	a7Out = a7_24;
	s2Out = s2_30;
	s3Out = s3_31;
	s4Out = s4_32;
	s5Out = s5_43;
	s6Out = s6_33;
	s7Out = s7_34;
	s8Out = s8_35;
	s9Out = s9_36;
	s10Out = s10_28;
	s11Out = s11_29;
	return ra_25;
}

// 23052186: Register Eq_2 sscanf(Register Eq_2 ra, Register (ptr32 byte) a0, Register (ptr32 byte) a1, Stack Eq_258450 dwArg14, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      parseUnsignedInteger32Value
//      parseUnsignedInteger16Value
//      parseUnsignedInteger8Value
//      parseInteger32Value
//      parseInteger16Value
//      parseInteger8Value
//      parseFloatValue
//      parseDoubleValue
Eq_2 sscanf(Eq_2 ra, byte * a0, byte * a1, Eq_258450 dwArg14, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	ptr32 a0_22;
	ptr32 a3_23;
	ptr32 a4_24;
	ptr32 s0_28;
	ptr32 s1_29;
	ptr32 s2_32;
	ptr32 s3_33;
	ptr32 s4_34;
	ptr32 s5_35;
	ptr32 s6_36;
	Eq_2 ra_27 = vsscanf(ra, a0, a1, fp + -24, dwArg14, out s0_28, out s1_29, out a0_22, out a3_23, out a4_24, out s2_32, out s3_33, out s4_34, out s5_35, out s6_36);
	s0Out = s0_28;
	s1Out = s1_29;
	a0Out = a0_22;
	a3Out = a3_23;
	a4Out = a4_24;
	s2Out = s2_32;
	s3Out = s3_33;
	s4Out = s4_34;
	s5Out = s5_35;
	s6Out = s6_36;
	return ra_27;
}

// 230521A2: void set_bit(Register (ptr32 word32) a1)
void set_bit(word32 * a1)
{
	*(a1 | 0x01 << a1) = *a1;
}

// 230521B8: Register Eq_2 vsscanf(Register Eq_2 ra, Register (ptr32 byte) a0, Register (ptr32 byte) a1, Register ptr32 a2, Stack Eq_258450 dwArg54, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out (ptr32 byte) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      sscanf
Eq_2 vsscanf(Eq_2 ra, byte * a0, byte * a1, ptr32 a2, Eq_258450 dwArg54, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, byte & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	ptr32 s10_100 = 0x00;
	while (true)
	{
		word32 s1_51 = (word32) *a1;
		byte * s7_52 = a1 + 1;
		if (s1_51 == 0x00 || false)
			break;
		if (true)
		{
			<anonymous> * a3_62 = g_ptr23088600;
			ptr32 s6_75;
			ptr32 s0_76;
			ptr32 s2_77;
			byte * s3_78;
			ptr32 s4_79;
			ptr32 s5_80;
			Eq_2 ra_85;
			ptr32 s1_86;
			ptr32 a0_88;
			word32 a1_90;
			ptr32 a4_91;
			ptr32 a3_95;
			a3_62();
			s0Out = s0_76;
			s1Out = s1_86;
			a0Out = a0_88;
			a3Out = a3_95;
			a4Out = a4_91;
			s2Out = s2_77;
			s3Out = s3_78;
			s4Out = s4_79;
			s5Out = s5_80;
			s6Out = s6_75;
			return ra_85;
		}
		a1 = s7_52;
	}
	if (false && true)
		s10_100 = ~0x00;
	ptr32 s5_113 = dwLoc48->ptr01B8;
	ptr32 a3_115 = dwLoc48->ptr01F8;
	ptr32 s1_116 = dwLoc48->ptr011C;
	Eq_2 ra_118 = dwLoc48->t015C;
	s0Out = 0x00;
	s1Out = s1_116;
	a0Out = s10_100;
	a3Out = a3_115;
	a4Out = dwLoc70;
	s2Out = 0x00;
	s3Out = a0;
	s4Out = ~0x00;
	s5Out = s5_113;
	s6Out = 587783277;
	return ra_118;
}

<anonymous> g_t2305224A = <code>;
// 23052618: void strntoumax(Register (ptr32 Eq_272944) a0, Register Eq_272945 a1, Register Eq_272946 a2, Register up32 a3)
void strntoumax(struct Eq_272944 * a0, Eq_272945 a1, Eq_272946 a2, up32 a3)
{
	struct Eq_272944 * a5_115 = a0;
	while (true)
	{
		up32 t3_11;
		if (a3 == 0x00)
			break;
		struct Eq_272953 * a4_18 = (word32) a5_115->b0000;
		if (((word32) a4_18->b2308DC6D & 0x08) == 0x00)
		{
			t3_11 = 0x00;
			if ((a4_18 + -43 & 0x00FD) == 0x00)
			{
				t3_11 = (word32) (a4_18 < (struct Eq_272953 *) -46);
				++a5_115;
				a3 += ~0x00;
			}
			if (a2 != 0x00)
			{
				if (a2 == 0x10 && (a3 > 0x01 && ((word32) a5_115->b0000 == 48 && ((word32) a5_115[1] & 223) == 88)))
				{
					a3 += ~0x01;
					a5_115 += 2;
				}
				goto l2305267A;
			}
			if (a3 > 0x01)
			{
				a2.u0 = 0x0A;
				if ((word32) a5_115->b0000 != 48)
					goto l2305267A;
				if (((word32) a5_115[1] & 223) == 88)
				{
					a3 += ~0x01;
					a5_115 += 2;
					a2.u0 = 0x10;
					goto l2305267A;
				}
			}
			else
			{
				if (a3 == 0x00)
					goto l23052722;
				if ((word32) a5_115->b0000 != 48)
				{
					a3 = 0x01;
					a2.u0 = 0x0A;
					goto l2305267A;
				}
			}
			a3 += ~0x00;
			++a5_115;
			a2.u0 = 0x08;
			goto l2305267A;
		}
		++a5_115;
		a3 += ~0x00;
	}
	t3_11 = 0x00;
	if (a2 == 0x00)
	{
		if (a1 == 0x00)
			return;
		t3_11 = a3;
	}
	else
	{
l2305267A:
		struct Eq_272944 * a3_68 = a5_115 + a3;
		for (; a5_115 != a3_68; ++a5_115)
		{
			up32 a7_78 = (word32) a5_115->b0000;
			Eq_272946 a6_79 = a7_78 + -48;
			if (a7_78 > ~0x38)
			{
				if (a7_78 <= ~0x59)
					a6_79 = a7_78 + -55;
				else
				{
					if (a7_78 > ~0x79)
						break;
					a6_79 = a7_78 + -87;
				}
			}
			if (a6_79 < 0x00 || a6_79 >= a2)
				break;
		}
l23052722:
		if (a1 == 0x00)
			return;
	}
	a5_115->b0000 = (byte) a1;
}

// 23052764: Register (ptr32 Eq_160297) UART_Init(Register ui32 a0, Register word32 a2, Register (ptr32 Eq_160297) a4)
// Called from:
//      bl_uart_init
//      hal_uart_setconfig
struct Eq_160297 * UART_Init(ui32 a0, word32 a2, struct Eq_160297 * a4)
{
	struct Eq_273082 * a1_10 = ((struct Eq_273082 *[]) 4)[a0];
	uint32 a5_14 = a4 >> (a0 << 2);
	if (((char *) &a4->dw0004 + 6 >> (a0 << 2) & 0x0A) > 0x04)
		++a5_14;
	uint32 a5_21 = a5_14 + ~0x00;
	struct Eq_273102 * a5_25 = (word32) (word16) a5_21 | a5_21 << 0x10;
	a5_25->dw0008 = a2;
	ui32 a4_22 = a5_21 << 0x10;
	word32 a3_29 = (word32) a1_10->b000A;
	word32 a2_31 = a5_25->dw0004;
	if (a3_29 != 0x01)
	{
		if (a3_29 != 0x00)
		{
			if (a3_29 == 0x02)
			{
				a4_22 = a5_21 << 0x10 & -33 | 16;
				a5_25 = a5_25 & -33 | 16;
			}
		}
		else
		{
			a4_22 = a5_21 << 0x10 & ~0x10;
			a5_25 &= ~0x10;
		}
	}
	else
	{
		a4_22 = a5_21 << 0x10 | 48;
		a5_25 |= 48;
	}
	ui32 a3_50 = (word32) a1_10->b0008 + 0x04 << 8;
	ui32 a4_61 = (a4_22 & -0x0701 | a3_50) & ~0x03000000 | (word32) a1_10->b0009 + 0x01 << 0x0C;
	ui32 a5_52 = a5_25 & -0x0701 | a3_50;
	word32 * a3_62 = a4_61 & -3;
	if ((word32) a1_10->b000B == 0x01)
		a3_62 = a4_61 | 2;
	ui32 a5_71;
	if ((word32) a1_10->b000C == 0x01)
		a5_71 = a5_52 | 0x00FFF800;
	else
		a5_71 = a5_52 & ~0x00FFF800;
	struct Eq_160297 * a4_80 = a5_71 & -3;
	if ((word32) a1_10->b000D == 0x01)
		a4_80 = a5_71 | 2;
	*a3_62 = a2_31;
	a4_80->dw0004 = a2_31;
	word32 a2_92 = a4_80->dw000C;
	struct Eq_273210 * a5_96 = a4_80 & -2;
	if ((word32) a1_10->b000E == 0x01)
		a5_96 = a4_80 | 1;
	a5_96->dw000C = a2_92;
	return a4_80;
}

// 23052858: void UART_FifoConfig(Register (ptr32 Eq_160284) a1, Register (ptr32 Eq_160285) a3)
// Called from:
//      bl_uart_init
void UART_FifoConfig(struct Eq_160284 * a1, struct Eq_160285 * a3)
{
	a3->dw0084 = ((word32) a1->b0000 + ~0x00 << 16 | a3->dw0084 & ~0x001F0000) & ~0x1F000000 | (word32) a1->b0001 + ~0x00 << 24;
	int32 a4_28 = a3->dw0080;
	ui32 a5_30 = a4_28 & -2;
	if ((word32) a1->b0002 == 0x01)
		a5_30 = a4_28 | 1;
	int32 a4_37 = a5_30 & -3;
	if ((word32) a1->b0003 == 0x01)
		a4_37 = a5_30 | 2;
	a3->dw0080 = a4_37;
}

// 230528C2: Register uint32 UART_Enable(Register uint32 a1)
// Called from:
//      bl_uart_init
//      hal_uart_setconfig
uint32 UART_Enable(uint32 a1)
{
	if ((a1 & 0x00FD) == 0x00)
		*(a1 & 0x00FD | 1) = *(a1 & 0x00FD);
	uint32 a1_17 = a1 + ~0x00 & 0x00FF;
	if (a1_17 <= 0x01)
		*(union Eq_2 *) 0x05 = *(union Eq_2 *) 0x05;
	return a1_17;
}

// 230528F6: Register word32 UART_Disable(Register ui32 a1)
// Called from:
//      bl_uart_init
//      hal_uart_setconfig
word32 UART_Disable(ui32 a1)
{
	if ((a1 & 0x00FD) == 0x00)
		*(a1 & 0x00FD & ~0x01) = *(a1 & 0x00FD);
	word32 a4_18 = 0x01;
	if ((a1 + ~0x00 & 0x00FF) <= 0x01)
	{
		*(union Eq_2 *) 4 = *(union Eq_2 *) 0x05;
		a4_18 = 0x00;
	}
	return a4_18;
}

// 23052926: Register Eq_2 UART_SetRxTimeoutValue(Register word32 a1, Register Eq_2 a4)
// Called from:
//      bl_uart_int_rx_enable
Eq_2 UART_SetRxTimeoutValue(word32 a1, Eq_2 a4)
{
	struct Eq_273344 * a5_9 = *a4;
	Eq_2 a4_13 = a5_9->t0018;
	(a1 + ~0x00 | a5_9 & -0x0100)->t0018 = a4_13;
	return a4_13;
}

// 23052944: Register word32 UART_TxFreeRun(Register word32 a1, Register (ptr32 (ptr32 word32)) a4)
// Called from:
//      bl_uart_init
//      hal_uart_setconfig
word32 UART_TxFreeRun(word32 a1, word32 ** a4)
{
	word32 * a5_13;
	word32 * a5_9 = *a4;
	word32 a4_11 = *a5_9;
	if (a1 == 0x01)
		a5_13 = a5_9 | 4;
	else
		a5_13 = a5_9 & ~0x04;
	*a5_13 = a4_11;
	return 0x01;
}

// 23052968: Register Eq_2 UART_IntMask(Register word32 a1, Register word32 a2, Register Eq_2 a4)
// Called from:
//      bl_uart_init
//      bl_uart_int_rx_enable
//      bl_uart_int_rx_disable
//      bl_uart_int_tx_enable
//      bl_uart_int_tx_disable
Eq_2 UART_IntMask(word32 a1, word32 a2, Eq_2 a4)
{
	struct Eq_273380 * a1_17;
	struct Eq_273381 * a5_9 = *a4;
	Eq_2 a4_11 = a5_9->t0024;
	if (a1 == 0x08)
	{
		a1_17 = null;
		if (a2 == 0x01)
			a1_17 = a5_9 | 0x00FF;
	}
	else
	{
		ui32 a1_14 = 0x01 << a1;
		if (a2 == 0x01)
			a1_17 = a1_14 | a5_9;
		else
			a1_17 = ~a1_14 & a5_9;
	}
	a1_17->t0024 = a4_11;
	return a4_11;
}

// 230529A6: Register Eq_2 UART_GetTxFifoCount(Register Eq_2 a0, Register out (ptr32 Eq_160327) a5Out)
// Called from:
//      bl_uart_data_send
//      bl_uart_flush
//      bflb_platform_usart_dbg_send
Eq_2 UART_GetTxFifoCount(Eq_2 a0, struct Eq_160327 & a5Out)
{
	struct Eq_160327 * a5_9 = *((char *) g_a2308DEB0 + a0 * 0x04);
	Eq_2 a0_11 = a5_9->dw0084 & 63;
	a5Out = a5_9;
	return a0_11;
}

// 230529BE: void UART_SendData(Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a2, Stack word32 dwArg34, Stack word32 dwArg0128)
// Called from:
//      bflb_platform_usart_dbg_send
void UART_SendData(Eq_2 a0, ptr32 a1, Eq_2 a2, word32 dwArg34, word32 dwArg0128)
{
	struct Eq_273423 * s3_11 = *((char *) g_a2308DEB0 + a0 * 0x04);
	Eq_2 s1_25 = 0x00;
	while (s1_25 < a2)
	{
		word32 a5_97;
		if (UART_GetTxFifoCount(a0, out a5_97) == 0x00)
		{
			if (dwArg34 == ~0x00)
				break;
			continue;
		}
		s3_11->b0088 = (byte) (word32) *((word32) s1_25 + a1);
		s1_25 = (word32) s1_25 + 1;
	}
	0x00 = dwArg0128;
}

// 23052A30: Register ui32 UART_GetRxFifoCount(Register ui32 a0, Register out (ptr32 Eq_160350) a5Out)
// Called from:
//      bl_uart_data_recv
ui32 UART_GetRxFifoCount(ui32 a0, struct Eq_160350 & a5Out)
{
	struct Eq_160350 * a5_9 = *((char *) g_a2308DEB0 + a0 * 0x04);
	ui32 a0_12 = a5_9->t0084 >> 8 & 63;
	a5Out = a5_9;
	return a0_12;
}

// 23052A4A: void ADC_Reset()
// Called from:
//      bl_tsen_adc_get
void ADC_Reset()
{
	int32 a5_5 = *(int32 *) 0x4000F90C;
	*(ui32 *) 0x4001090C = a5_5 | 4;
	*(ui32 *) 0x4001090C = a5_5 & ~0x04;
}

// 23052A72: void ADC_Enable()
// Called from:
//      bl_tsen_adc_get
void ADC_Enable()
{
	*(ui32 *) 0x4001090C = *(int32 *) 0x4000F90C | 1;
}

// 23052A84: void ADC_Disable()
// Called from:
//      bl_tsen_adc_get
void ADC_Disable()
{
	*(ui32 *) 0x4001090C = *(int32 *) 0x4000F90C & ~0x01;
}

