pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 23052A94: Register ui32 ADC_Channel_Config(Register ui32 a0, Register ui32 a1, Register ui32 a2)
// Called from:
//      bl_tsen_adc_get
ui32 ADC_Channel_Config(ui32 a0, ui32 a1, ui32 a2)
{
	*(ui32 *) 0x4001090C = (a0 << 8 | *((int32 *) 0x4000F90C) & 0xFE0000FF) & -0x00F9 | a1 << 3;
	*(ui32 *) 0x40010910 = (a2 << 1 | *((int32 *) 0x4000F910) & ~0x02) & ~0x02000000;
	return a1 << 3;
}

// 23052ACC: Register Eq_2 ADC_Start(Register Eq_2 ra, Register word32 s0, Register out ptr32 a0Out)
// Called from:
//      TSEN_Get_V_Error
//      TSEN_Get_Temp
Eq_2 ADC_Start(Eq_2 ra, word32 s0, ptr32 & a0Out)
{
	int32 a5_9 = *(int32 *) 0x4000F90C;
	*(ui32 *) 0x4001090C = a5_9 & ~0x02;
	struct Eq_273521 * s0_15;
	Eq_2 ra_16;
	ptr32 a0_18;
	g_t4200C506();
	s0_15->dw090C = s0_15->dwFFFFF90C | 2;
	a0Out = a0_18;
	return ra_16;
}

// 23052B00: void ADC_FIFO_Cfg(Register (ptr32 Eq_180576) a0, Register (ptr32 word32) a5)
// Called from:
//      bl_tsen_adc_get
void ADC_FIFO_Cfg(struct Eq_180576 * a0, word32 * a5)
{
	word32 * a5_15 = ((word32) a0->b0000 << 22 | a5 & ~0x00C00000) & ~0x01 | (word32) a0->b0001;
	*a5_15 = *a5;
	*(a5_15 | 2) = *a5_15;
}

// 23052B2A: Register uint32 ADC_Get_FIFO_Count(Register uint32 a0)
// Called from:
//      TSEN_Get_V_Error
//      TSEN_Get_Temp
uint32 ADC_Get_FIFO_Count(uint32 a0)
{
	return a0 >> 16 & 63;
}

// 23052B38: Register Eq_2 ADC_Parse_Result(Register Eq_2 ra, Register (ptr32 Eq_273570) a0, Register Eq_2 a2, Register Eq_116475 fs1, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg74, Register out Eq_273576 s0Out, Register out (ptr32 Eq_273570) s1Out, Register out (ptr32 Eq_273570) a5Out, Register out (ptr32 Eq_273570) s2Out, Register out Eq_273580 s3Out, Register out (ptr32 Eq_273570) s4Out, Register out Eq_116475 fs1Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      TSEN_Get_V_Error
//      TSEN_Get_Temp
Eq_2 ADC_Parse_Result(Eq_2 ra, struct Eq_273570 * a0, Eq_2 a2, Eq_116475 fs1, ptr32 fflags, ptr32 frm, Eq_2 dwArg74, union Eq_273576 & s0Out, struct Eq_273570 & s1Out, struct Eq_273570 & a5Out, struct Eq_273570 & s2Out, union Eq_273580 & s3Out, struct Eq_273570 & s4Out, union Eq_116475 & fs1Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	if ((word32) g_b4200D96C == 0x00)
		fs1 = g_t2308861C;
	Eq_5614 fs0_48;
	Eq_273675 a3_41 = *(union Eq_273675 *) 0x4000F914;
	struct Eq_273570 * s2_121 = a3_41 >> 0x02 & 1;
	if ((a3_41 & 0x08) == 0x00)
		fs0_48 = g_t23088620;
	else
		fs0_48 = g_t2307676C;
	struct Eq_273570 * a5_100;
	Eq_273580 s3_136;
	if (s2_121 != null)
	{
		a5_100 = g_ptr23088640;
		Eq_2 s10_254 = g_t23088648;
		Eq_2 s11_255 = g_t2308864C;
		Eq_2 s7_264 = a2;
		struct Eq_273570 * s6_265;
		ui32 s1_266 = 0x0FFFFFFF;
		ui32 s5_267 = 0x03FFFFFF;
		s3_136.u0 = 0x00FFFFFF;
		dwLoc64 = a5_100;
		for (s6_265 = a0; s6_265 != a5_100; ++s6_265)
		{
			s7_264->u1 = (byte) (s6_265->t0000 >> 21);
			((word32) s7_264 + 1)->u1 = (byte) ((word32) s6_265->w0002 & 0x1F);
			s4 = null;
			Eq_2 a3_302 = s6_265->t0000;
			if (a3_302 << 0x10 < 0x00)
			{
				a3_302 = 0x00 - a3_302;
				s6_265->t0000.u2 = a3_302;
				s4 = s2_121;
			}
			Eq_64250 a1_327;
			Eq_2 a0_326;
			if (dwArg74 == 0x00)
			{
				uint32 a0_359 = (uint32) ((real32) (s6_265->t0000 >> 4 & s3_136) / fs1);
				*((word32) s7_264 + 2) = (word16) a0_359;
				a0_326 = __floatsidf(a0_359 & s1_266, out a1_327);
				goto l23052C3C;
			}
			a5_100 = (struct Eq_273570 *) 0x01;
			if (dwArg74 == 0x01)
			{
				uint32 a0_339 = (uint32) ((real32) (s6_265->t0000 >> 2 & s5_267) / fs1);
				*((word32) s7_264 + 2) = (word16) a0_339;
				a0_326 = __floatsidf(a0_339 & s1_266, out a1_327);
				a2 = s10_254;
				a3_302 = s11_255;
				goto l23052C3C;
			}
			a2 = dwArg74;
			if (false)
			{
				uint32 a0_322 = (uint32) ((real32) (s6_265->t0000 & s1_266) / fs1);
				*((word32) s7_264 + 2) = (word16) a0_322;
				a0_326 = __floatsidf(a0_322 & s1_266, out a1_327);
l23052C3C:
				word32 s7_921;
				Eq_2 a0_384;
				Eq_64250 a1_385;
				ptr32 fflags_399;
				ptr32 frm_400;
				word32 s8_922;
				word32 s4_918;
				word32 s0_911;
				word32 a4_913;
				word32 s1_912;
				word32 a7_915;
				word32 s2_916;
				word32 s3_917;
				word32 a5_914;
				word32 s5_919;
				word32 s6_920;
				word32 s9_923;
				Eq_2 ra_401 = __muldf3(ra, a0_326, a1_327, a2, a3_302, fflags, frm, out s0_911, out s1_912, out a0_384, out a1_385, out a4_913, out a5_914, out a7_915, out s2_916, out s3_917, out s4_918, out s5_919, out s6_920, out s7_921, out s8_922, out s9_923, out fflags_399, out frm_400);
				word32 s8_928;
				Eq_2 a1_419;
				Eq_2 a0_426;
				uint32 a1_427;
				word32 s0_924;
				word32 a5_926;
				word32 a4_925;
				word32 a7_927;
				word32 s9_929;
				ra = __muldf3(ra_401, a0_384, a1_385, __extendsfdf2(ra_401, fs0_48, fflags_399, frm_400, out a1_419), a1_419, fflags_399, frm_400, out s0_924, out s1_266, out a0_426, out a1_427, out a4_925, out a5_926, out a7_927, out s2_121, out s3_136, out s4, out s5_267, out s6_265, out s7_264, out s8_928, out s9_929, out fflags, out frm);
				real32 fa0_461;
				word32 a4_931;
				word32 a3_930;
				__truncdfsf2(ra, a0_426, a1_427, fflags, frm, out a2, out a3_930, out a4_931, out a5_100, out fa0_461);
				a5_100[4] = (struct Eq_273570) fa0_461;
			}
			if (s4 != null)
				a5_100[4] = (struct Eq_273570) -*((word32) s7_264 + 4);
			s7_264 = (word32) s7_264 + 8;
		}
	}
	else
	{
		Eq_2 s10_67 = g_t23088638;
		Eq_2 s11_68 = g_t2308863C;
		a5_100 = g_ptr23088630;
		Eq_2 s6_147 = g_t23088628;
		Eq_2 s7_149 = g_t2308862C;
		Eq_2 s5_226 = a2;
		ui32 s1_103 = 0x0FFFFFFF;
		s2_121 = (struct Eq_273570 *) 0x03FFFFFF;
		s3_136.u0 = 0x00FFFFFF;
		for (s4 = a0; a5_100 != s4; ++s4)
		{
			Eq_64250 a1_112;
			Eq_2 a3_118;
			Eq_2 a0_111;
			Eq_273721 a3_94 = s4->t0000;
			((word32) s5_226 + 1)->u1 = ~0x00;
			s5_226->u1 = (byte) (a3_94 >> 21);
			if (dwArg74 == 0x00)
			{
				uint32 a0_140 = (uint32) ((real32) (s4->t0000 >> 4 & s3_136) / fs1);
				*((word32) s5_226 + 2) = (word16) a0_140;
				a0_111 = __floatsidf(a0_140 & s1_103, out a1_112);
				a2 = s6_147;
				a3_118 = s7_149;
				goto l23052D30;
			}
			a5_100 = (struct Eq_273570 *) 0x01;
			if (dwArg74 == 0x01)
			{
				a3_118 = s4->t0000 >> 2 & s2_121;
				uint32 a0_125 = (uint32) ((real32) a3_118 / fs1);
				*((word32) s5_226 + 2) = (word16) a0_125;
				a0_111 = __floatsidf(a0_125 & s1_103, out a1_112);
				goto l23052D30;
			}
			a2 = dwArg74;
			if (false)
			{
				uint32 a0_108 = (uint32) ((real32) (s4->t0000 & s1_103) / fs1);
				*((word32) s5_226 + 2) = (word16) a0_108;
				a0_111 = __floatsidf(a0_108 & s1_103, out a1_112);
				a2 = s10_67;
				a3_118 = s11_68;
l23052D30:
				word32 s3_938;
				word32 s2_937;
				Eq_2 a0_162;
				Eq_64250 a1_163;
				ptr32 fflags_177;
				ptr32 frm_178;
				word32 s4_939;
				word32 a4_934;
				word32 s9_944;
				word32 s0_932;
				word32 s1_933;
				word32 a5_935;
				word32 a7_936;
				word32 s6_941;
				word32 s7_942;
				word32 s8_943;
				word32 s5_940;
				Eq_2 ra_179 = __muldf3(ra, a0_111, a1_112, a2, a3_118, fflags, frm, out s0_932, out s1_933, out a0_162, out a1_163, out a4_934, out a5_935, out a7_936, out s2_937, out s3_938, out s4_939, out s5_940, out s6_941, out s7_942, out s8_943, out s9_944, out fflags_177, out frm_178);
				Eq_2 a1_196;
				Eq_2 a0_203;
				uint32 a1_204;
				word32 a5_947;
				word32 s9_950;
				word32 s0_945;
				word32 a7_948;
				word32 s8_949;
				word32 a4_946;
				ra = __muldf3(ra_179, a0_162, a1_163, __extendsfdf2(ra_179, fs0_48, fflags_177, frm_178, out a1_196), a1_196, fflags_177, frm_178, out s0_945, out s1_103, out a0_203, out a1_204, out a4_946, out a5_947, out a7_948, out s2_121, out s3_136, out s4, out s5_226, out s6_147, out s7_149, out s8_949, out s9_950, out fflags, out frm);
				struct Eq_273947 * a3_233;
				real32 fa0_238;
				word32 a4_951;
				__truncdfsf2(ra, a0_203, a1_204, fflags, frm, out a2, out a3_233, out a4_951, out a5_100, out fa0_238);
				a3_233->r0010 = fa0_238;
			}
			s5_226 = (word32) s5_226 + 8;
		}
	}
	s0Out = qwArg01F8;
	s1Out = dwLoc64;
	a5Out = a5_100;
	s2Out = s2_121;
	s3Out = s3_136;
	s4Out = s4;
	fs1Out = fs1;
	fflagsOut = fflags;
	frmOut = frm;
	return dwLoc24;
}

// 23052E00: Register ui32 ADC_Tsen_Init(Register ui32 a0)
// Called from:
//      bl_tsen_adc_get
ui32 ADC_Tsen_Init(ui32 a0)
{
	*(ui32 *) 0x4001090C = *(int32 *) 0x4000F90C & ~0x78000000 | 0x00040000;
	*(ui32 *) 0x40010914 = (*(union Eq_273675 *) 0x4000F914 & 0x0FC3FFDF | a0 << 5) & 0xFA00007F | 0x20000140;
	*(ui32 *) 0x40010910 = *(int32 *) 0x4000F910 | 0x04000000;
	int32 a5_30 = *(int32 *) 0x4000F90C;
	*(ui32 *) 0x4001090C = a5_30 | 0x00080000;
	return a5_30 | 0x00080000;
}

// 23052E60: void ADC_SET_TSVBE_LOW()
// Called from:
//      TSEN_Get_V_Error
//      TSEN_Get_Temp
void ADC_SET_TSVBE_LOW()
{
	*(ui32 *) 0x40010914 = (word32) *(union Eq_273675 *) 0x4000F914;
}

// 23052E72: void ADC_SET_TSVBE_HIGH()
// Called from:
//      TSEN_Get_V_Error
//      TSEN_Get_Temp
void ADC_SET_TSVBE_HIGH()
{
	*(ui32 *) 0x40010914 = *(union Eq_273675 *) 0x4000F914 | 0x80000000;
}

// 23052E86: void TSEN_Get_V_Error(Register Eq_2 ra, Register word32 s0, Register (ptr32 word32) a5, Register Eq_116475 fs1, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg44, Stack word32 dwArg0128)
void TSEN_Get_V_Error(Eq_2 ra, word32 s0, word32 * a5, Eq_116475 fs1, ptr32 fflags, ptr32 frm, Eq_2 dwArg44, word32 dwArg0128)
{
	*(a5 | 2) = *a5;
	ADC_SET_TSVBE_LOW();
	uint32 a0_21;
	Eq_2 ra_24 = ADC_Start(ra, s0, out a0_21);
	do
		a0_21 = ADC_Get_FIFO_Count(a0_21);
	while (a0_21 == 0x00);
	g_b4200D96C = 0x00;
	word32 * a5_51;
	ptr32 fflags_56;
	ptr32 frm_57;
	Eq_116475 fs1_59;
	struct Eq_274084 * s0_61;
	byte * s2_65;
	word32 s3_66;
	word32 s1_180;
	word32 s4_181;
	Eq_2 ra_60 = ADC_Parse_Result(ra_24, fp + -44, fp + -40, fs1, fflags, frm, dwArg44, out s0_61, out s1_180, out a5_51, out s2_65, out s3_66, out s4_181, out fs1_59, out fflags_56, out frm_57);
	*s2_65 = (byte) s3_66;
	*(a5_51 | 2) = *a5_51;
	ADC_SET_TSVBE_HIGH();
	uint32 a0_88;
	Eq_2 ra_91 = ADC_Start(ra_60, &s0_61->bFFFFF96C, out a0_88);
	do
		a0_88 = ADC_Get_FIFO_Count(a0_88);
	while (a0_88 == 0x00);
	s0_61->bFFFFF96C = 0x00;
	byte * s0_125;
	word32 s1_126;
	word32 frm_188;
	word32 fs1_186;
	word32 fflags_187;
	word32 s3_184;
	word32 s4_185;
	word32 a5_182;
	word32 s2_183;
	ADC_Parse_Result(ra_91, fp + -44, fp + -40, fs1_59, fflags_56, frm_57, dwArg44, out s0_125, out s1_126, out a5_182, out s2_183, out s3_184, out s4_185, out fs1_186, out fflags_187, out frm_188);
	*s0_125 = (byte) s1_126;
	0x00 = dwArg0128;
}

// 23052F26: Register Eq_2 TSEN_Get_Temp(Register Eq_2 ra, Register word32 s0, Register (ptr32 word32) a5, Register Eq_116475 fs1, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg44, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 a1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 fs1Out, Register out ptr32 fa0Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      bl_tsen_adc_get
Eq_2 TSEN_Get_Temp(Eq_2 ra, word32 s0, word32 * a5, Eq_116475 fs1, ptr32 fflags, ptr32 frm, Eq_2 dwArg44, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & a1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & fs1Out, ptr32 & fa0Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	*(a5 | 2) = *a5;
	ADC_SET_TSVBE_LOW();
	uint32 a0_25;
	Eq_2 ra_28 = ADC_Start(ra, s0, out a0_25);
	do
		a0_25 = ADC_Get_FIFO_Count(a0_25);
	while (a0_25 == 0x00);
	g_b4200D96C = 0x00;
	ptr32 fflags_61;
	ptr32 frm_62;
	Eq_116475 fs1_64;
	struct Eq_274190 * s0_66;
	int32 * s2_70;
	byte * s3_71;
	word32 s4_72;
	word32 a5_267;
	word32 s1_266;
	Eq_2 ra_65 = ADC_Parse_Result(ra_28, fp + -44, fp + -40, fs1, fflags, frm, dwArg44, out s0_66, out s1_266, out a5_267, out s2_70, out s3_71, out s4_72, out fs1_64, out fflags_61, out frm_62);
	*s3_71 = (byte) s4_72;
	*s2_70 |= 2;
	ADC_SET_TSVBE_HIGH();
	uint32 a0_93;
	Eq_2 ra_96 = ADC_Start(ra_65, &s0_66->bFFFFF96C, out a0_93);
	do
		a0_93 = ADC_Get_FIFO_Count(a0_93);
	while (a0_93 == 0x00);
	real32 fa0_154;
	s0_66->bFFFFF96C = 0x00;
	ptr32 fflags_125;
	ptr32 frm_126;
	ptr32 fs1_128;
	byte * s0_130;
	word32 s1_131;
	word32 s2_134;
	up32 s3_135;
	word32 a5_268;
	word32 s4_269;
	Eq_2 ra_129 = ADC_Parse_Result(ra_96, fp + -44, fp + -40, fs1_64, fflags_61, frm_62, dwArg44, out s0_130, out s1_131, out a5_268, out s2_134, out s3_135, out s4_269, out fs1_128, out fflags_125, out frm_126);
	*s0_130 = (byte) s2_134;
	up32 a5_148 = (word32) wLoc26;
	real32 fa4_150 = (real32) s3_135;
	real32 fa0_151 = (real32) a5_148;
	real32 fa5_152 = (real32) s1_131;
	if (a5_148 < s3_135)
		fa0_154 = fa4_150 - fa0_151;
	else
		fa0_154 = fa0_151 - fa4_150;
	word32 s0_270;
	word32 s9_273;
	Eq_64252 a1_163;
	Eq_2 a0_170;
	uint32 a1_171;
	ptr32 fflags_185;
	ptr32 frm_186;
	ptr32 s2_190;
	ptr32 s3_191;
	word32 s1_271;
	word32 a3_272;
	Eq_2 ra_187 = __divdf3(ra_129, __extendsfdf2(ra_129, fa0_154 - fa5_152, fflags_125, frm_126, out a1_163), a1_163, g_t23088658, g_t2308865C, fflags_125, frm_126, out s0_270, out s1_271, out a0_170, out a1_171, out a3_272, out s2_190, out s3_191, out s9_273, out fflags_185, out frm_186);
	word32 a3_275;
	word32 a2_274;
	word32 a4_276;
	word32 a5_277;
	ptr32 fa0_205;
	ptr32 a1_198 = __truncdfsf2(ra_187, a0_170, a1_171, fflags_185, frm_186, out a2_274, out a3_275, out a4_276, out a5_277, out fa0_205);
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	a1Out = a1_198;
	s2Out = s2_190;
	s3Out = s3_191;
	fs1Out = fs1_128;
	fa0Out = fa0_205;
	fflagsOut = fflags_185;
	frmOut = frm_186;
	return ra_187;
}

