pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 23053004: void ADC_Init(Register (ptr32 Eq_180560) a0)
// Called from:
//      bl_tsen_adc_get
void ADC_Init(struct Eq_180560 * a0)
{
	ui32 a4_57;
	ui32 a5_56;
	*(ui32 *) 0x40010910 = (word32) a0->b000A << 2 | (((word32) a0->b0002 << 18 | ((word32) a0->b0001 << 27 | ((word32) a0->b0000 << 29 | *((int32 *) 0x4000F910) & ~0x60000000) & ~0x18000000) & ~0x07FC0000) & ~0x20000001 | (word32) a0->b000B) & ~0x1C;
	ui32 a3_36 = (word32) a0->b0003;
	ui32 a1_40 = (word32) a0->b0004;
	ui32 a5_53 = (word32) a0->b0006 << 0x0011 | (a1_40 << 22 | (a3_36 << 0x19 | *((union Eq_273675 *) 0x4000F914) & ~0x7E000000) & ~0x01C00000) & ~0x20000000;
	if ((a3_36 | a1_40) != 0x00)
	{
		a5_56 = a5_53 & ~0x1C000000;
		a4_57 = 0x12000000;
	}
	else
	{
		a5_56 = a5_53 & ~0x1E000000;
		a4_57 = 0x08000000;
	}
	*(ui32 *) 0x40010914 = ((a5_56 | a4_57) & 0xFE00007F | (word32) a0->b0007 << 7) & ~0x0C | (word32) a0->b0008 << 3 | 0x01000000 | (word32) a0->b0009 << 2;
	int32 a5_85 = *(int32 *) 0x4000F938;
	ui32 a5_88 = (int32) a0->w000C | a5_85 & 0xF0000000;
	*(ui32 *) 0x40010938 = a5_88;
	g_t4200CB5C();
}

// 230530FE: void Sec_Eng_PKA_Write_Common_OP_First_Cfg(Register ui32 a0, Register ui32 a1, Register ui32 a2, Register ui32 a3, Register int32 a4, Register ui32 a5)
// Called from:
//      Sec_Eng_PKA_Move_Data
//      Sec_Eng_PKA_MREM
//      Sec_Eng_PKA_MEXP
//      Sec_Eng_PKA_LSUB
//      Sec_Eng_PKA_LMUL
//      Sec_Eng_PKA_LDIV
//      Sec_Eng_PKA_LMUL2N
void Sec_Eng_PKA_Write_Common_OP_First_Cfg(ui32 a0, ui32 a1, ui32 a2, ui32 a3, int32 a4, ui32 a5)
{
	ui32 a0_16 = a0 | (a1 & 0x0F) << 8;
	if (a4 != 0x19)
		a0_16 = a0_16 | a2 << 0x0C | (a3 & 0x0F) << 20;
	*(ui32 **) 0x40004340 = (word32) (word31) (a0_16 & ~0x7F000000 | (a4 & 0x007F) << 24) | a5 << 31;
}

// 23053136: Register word32 Sec_Eng_PKA_Wait_ISR()
// Called from:
//      Sec_Eng_PKA_Read_Data
//      Sec_Eng_PKA_CREG
//      Sec_Eng_PKA_Move_Data
//      Sec_Eng_PKA_MREM
//      Sec_Eng_PKA_MEXP
//      Sec_Eng_PKA_LCMP
//      Sec_Eng_PKA_LSUB
//      Sec_Eng_PKA_LMUL
//      Sec_Eng_PKA_LDIV
//      Sec_Eng_PKA_LMUL2N
word32 Sec_Eng_PKA_Wait_ISR()
{
	word32 a5_10 = 16000000;
	do
	{
		Eq_274503 a4_8 = *(union Eq_274503 *) 0x40004300;
		a5_10 += ~0x00;
		if (a5_10 == 0x00)
			return;
	} while ((a4_8 & 0x0100) == 0x00);
	return;
}

// 23053158: Register word32 Sec_Eng_SHA256_Update.part.0(Register (ptr32 Eq_168956) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s5, Stack word32 dwArgA8, Register out ptr32 s0Out, Register out (ptr32 Eq_168956) s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_274526 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_274530 s6Out, Register out ptr32 s8Out, Register out ptr32 t3Out)
// Called from:
//      Sec_Eng_SHA256_Update
//      Sec_Eng_SHA256_Finish
word32 Sec_Eng_SHA256_Update.part.0(struct Eq_168956 * a0, Eq_2 a1, Eq_2 a2, Eq_2 s5, word32 dwArgA8, ptr32 & s0Out, struct Eq_168956 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_274526 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_274530 & s6Out, ptr32 & s8Out, ptr32 & t3Out)
{
	struct Eq_168956 * s1_115 = a0;
	Eq_2 s3_119 = a1;
	Eq_2 s0_102 = a2;
	Eq_2 a4_112 = 16000000;
	ptr32 a3_105 = 0x40004000;
	do
	{
		ptr32 a0_209;
		Eq_274530 s6_175 = *(union Eq_274530 *) 0x40004000;
		a4_112 = (word32) a4_112 - 1;
		if (a4_112 == 0x00)
		{
l230532A2:
			a0_209 = 0x02;
			goto l2305328E;
		}
	} while ((s6_175 & 1) != 0x00);
	s1_115 = (struct Eq_168956 *) *a4_112;
	s2 = (word32) s1_115->b0010;
	a4_112 += a2;
	*a4_112 = s1_115;
	ui32 s4_100 = a4_112 & 63;
	if (a4_112 < a2)
	{
		s1_115 = (s6_175 & 1)->ptr0004;
		(s6_175 & 1)->ptr0005 = s1_115;
	}
	if ((a4_112 & 63) != 0x00)
	{
		s5 = 64 - (a4_112 & 63);
		if (a2 >= s5)
		{
			word32 s0_64;
			word32 s3_66;
			word32 s4_69;
			ui32 s6_71;
			struct Eq_274587 * a5_76;
			g_t4200C52E();
			s1_115 = a5_76->ptr0008;
			a5_76->dw0004 = 0x40004000;
			ui32 a5_89 = (word32) (word16) (s2 << 0x06 | s6_71 & -65);
			*(a5_89 | 0x10000000) = 0x40004000;
			*(a5_89 | 0x10000002) = 0x40004000;
			s1_115->b0010 = 0x01;
			s6_175 = s6_71 & -65;
			a4_112.u0 = 0x10000002;
			s0_102 = s0_64 + -64 + s4_69;
			s3_119 = (word32) s5 + s3_66;
			s4_100 = 0x00;
		}
	}
	ui32 a2_103 = s0_102 & 63;
	if (s0_102 > 63)
	{
		a3_105 = 16000000;
		do
		{
			a1 = *(union Eq_2 *) 63;
			a3_105 += ~0x00;
			if (a3_105 == 0x00)
				goto l230532A2;
			a4_112.u0 = 0x01;
		} while (true);
		ui32 a5_117 = (word32) s1_115->b0010;
		*((word32) a1 + 4) = s3_119;
		a4_112 = (word32) (word16) (a5_117 << 6 | 0x3F);
		union Eq_2 * a5_128 = s0_102 >> 0x06 << 16 | a4_112;
		*a5_128 = (union Eq_2 *) a1;
		*(a5_128 | 2) = (union Eq_2 *) a1;
		s1_115->b0010 = 0x01;
		s0_102 &= -64;
		s3_119 += s0_102;
	}
	if (a2_103 != 0x00)
	{
		word32 a5_139 = 16000000;
		do
		{
			a3_105 = (ptr32) *a4_112;
			a5_139 += ~0x00;
			if (a5_139 == 0x00)
				goto l230532A2;
			a4_112 &= 0x01;
		} while (a4_112 != 0x00);
		word32 a5_196;
		g_t4200C52E();
	}
	word32 a5_202 = 16000000;
	do
	{
		a3_105 = (ptr32) *a4_112;
		a5_202 += ~0x00;
		if (a5_202 == 0x00)
			goto l230532A2;
		a4_112 &= 0x01;
	} while (a4_112 != 0x00);
	a0_209 = 0x00;
l2305328E:
	0x00 = dwArgA8;
	s0Out = s1;
	s1Out = s1_115;
	a0Out = a0_209;
	a1Out = a1;
	a3Out = a3_105;
	a4Out = a4_112;
	s2Out = s2;
	s3Out = s3_119;
	s4Out = dwArg04;
	s5Out = s5;
	s6Out = s6_175;
	s8Out = s4;
	t3Out = dwArg00;
	return ra;
}

// 230532A6: Register (ptr32 word32) Sec_Eng_SHA256_Init(Register Eq_2 ra, Register Eq_2 a0, Register ui32 a2, Register (ptr32 word32) a5, Stack Eq_2 dwArg84, Stack word32 dwArgA4)
// Called from:
//      bl_sha_init
word32 * Sec_Eng_SHA256_Init(Eq_2 ra, Eq_2 a0, ui32 a2, word32 * a5, Eq_2 dwArg84, word32 dwArgA4)
{
	*(a2 << 2 | a5 & ~0x1C) = *a5;
	struct Eq_274724 * a3_26;
	struct Eq_274725 * a4_27;
	word32 a5_28;
	word32 t1_80;
	word32 a0_81;
	word32 a1_82;
	word32 a2_83;
	memset(ra, a0, 0x00, 0x14, out t1_80, out a0_81, out a1_82, out a2_83, out a3_26, out a4_27, out a5_28);
	a4_27->dw000C = dwArgA4;
	a3_26->dw0008 = dwArgA4;
	word32 sp_40;
	word32 ra_41;
	word32 a3_43;
	word32 a4_44;
	word32 a5_46;
	word32 a0_48;
	g_t4200C538();
	word32 * a5_66;
	g_t4200C538();
	return a5_66;
}

// 230532F6: void Sec_Eng_SHA_Start(Register (ptr32 word32) a5)
// Called from:
//      bl_sha_init
void Sec_Eng_SHA_Start(word32 * a5)
{
	*(a5 & -65 | 32) = *a5;
}

// 23053308: Register word32 Sec_Eng_SHA256_Update(Register (ptr32 Eq_168956) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s5, Stack word32 dwArgA8, Register out (ptr32 Eq_168985) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_168989 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out)
// Called from:
//      bl_sha_update
//      Sec_Eng_SHA256_Finish
word32 Sec_Eng_SHA256_Update(struct Eq_168956 * a0, Eq_2 a2, Eq_2 a3, Eq_2 s5, word32 dwArgA8, struct Eq_168985 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_168989 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out)
{
	if (a3 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = 0x00;
		a1Out = a2;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		return ra;
	}
	else
	{
		ptr32 a0_11;
		Eq_168989 a4_14;
		struct Eq_168985 * s0_16;
		ptr32 s1_17;
		ptr32 s3_18;
		ptr32 s4_19;
		ptr32 s6_20;
		ptr32 s2_25;
		Eq_2 a1_26;
		Eq_2 s5_28;
		word32 a3_72;
		word32 s8_73;
		word32 t3_74;
		word32 ra_27 = Sec_Eng_SHA256_Update.part.0(a0, a2, a3, s5, dwArgA8, out s0_16, out s1_17, out a0_11, out a1_26, out a3_72, out a4_14, out s2_25, out s3_18, out s4_19, out s5_28, out s6_20, out s8_73, out t3_74);
		s0Out = s0_16;
		s1Out = s1_17;
		a0Out = a0_11;
		a1Out = a1_26;
		a4Out = a4_14;
		s2Out = s2_25;
		s3Out = s3_18;
		s4Out = s4_19;
		s5Out = s5_28;
		s6Out = s6_20;
		return ra_27;
	}
}

