pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 23053316: Register word32 Sec_Eng_SHA256_Finish(Register Eq_2 a2, Register (ptr32 ui32) a4, Register Eq_2 s5, Stack word32 dwArg88, Register out (ptr32 Eq_169031) s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out)
// Called from:
//      bl_sha_finish
word32 Sec_Eng_SHA256_Finish(Eq_2 a2, ui32 * a4, Eq_2 s5, word32 dwArg88, struct Eq_169031 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out)
{
	word32 a5_10 = 16000000;
	do
	{
		ui32 a3_8 = *a4;
		a5_10 += ~0x00;
		if (a5_10 == 0x00)
		{
			s0Out = s0;
			s1Out = s1;
			s2Out = s2;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			return ra;
		}
		a4 &= 0x01;
	} while (a4 != null);
	int32 a5_51;
	if ((a3_8 & 63) <= 55)
		a5_51 = 56;
	else
		a5_51 = 0x0078;
	word32 a0_67;
	word32 s3_385;
	word32 s4_386;
	word32 a1_384;
	ui32 a4_71;
	struct Eq_169031 * s0_129;
	ptr32 s1_130;
	ptr32 s2_138;
	Eq_2 s5_141;
	ptr32 s6_133;
	word32 ra_140 = Sec_Eng_SHA256_Update(*((word32) a2 + 0x0C), a2, a5_51 - (a3_8 & 63), s5, dwArg88, out s0_129, out s1_130, out a0_67, out a1_384, out a4_71, out s2_138, out s3_385, out s4_386, out s5_141, out s6_133);
	word32 a5_86 = 16000000;
	do
	{
		a5_86 += ~0x00;
		if (a5_86 == 0x00)
		{
l2305332C:
			goto l2305332E;
		}
		a4_71 &= 0x01;
	} while (a4_71 != 0x00);
	struct Eq_274845 * sp_102;
	Eq_2 a1_112;
	Eq_2 s5_116;
	g_t4200C52E();
	word32 s3_131;
	word32 s4_132;
	word32 s8_134;
	word32 t3_135;
	word32 a0_381;
	word32 a4_383;
	word32 a1_382;
	uint32 a3_126;
	ra_140 = Sec_Eng_SHA256_Update.part.0(*((word32) a1_112 + 0x0C), a1_112, 0x08, s5_116, sp_102->dw00A8, out s0_129, out s1_130, out a0_381, out a1_382, out a3_126, out a4_383, out s2_138, out s3_131, out s4_132, out s5_141, out s6_133, out s8_134, out t3_135);
	uint32 a4_143 = 16000000;
	do
	{
		a4_143 += ~0x00;
		if (a4_143 == 0x00)
			goto l2305332C;
		a3_126 &= 0x01;
	} while (a3_126 != 0x00);
	s0_129->b0000 = (byte) a3_126;
	s0_129->b0001 = (byte) (a3_126 >> 0x08);
	s0_129->b0002 = (byte) (a3_126 >> 0x10);
	s0_129->b0003 = (byte) (a3_126 >> 24);
	s0_129->b0004 = (byte) (a3_126 >> 24);
	s0_129->b0005 = (byte) (a3_126 >> 0x20);
	s0_129->b0006 = (byte) (a3_126 >> 0x28);
	s0_129->b0007 = (byte) (a3_126 >> 48);
	s0_129->b0008 = (byte) (a3_126 >> 48);
	s0_129->b0009 = (byte) (a3_126 >> 0x38);
	s0_129->b000A = (byte) (a3_126 >> 0x40);
	s0_129->b000B = (byte) (a3_126 >> 72);
	s0_129->b000C = (byte) (a3_126 >> 72);
	s0_129->b000D = (byte) (a3_126 >> 0x50);
	s0_129->b000E = (byte) (a3_126 >> 88);
	s0_129->b000F = (byte) (a3_126 >> 96);
	struct Eq_274986 * a5_188 = (a3_126 >> 96)->ptr0020;
	s0_129->b0010 = (byte) (a3_126 >> 96);
	s0_129->b0011 = (byte) (a3_126 >> 0x68);
	s0_129->b0013 = (byte) (a3_126 >> 0x0078);
	s0_129->b0012 = (byte) (a3_126 >> 0x70);
	ui32 a4_164 = a4_143 >> 2 & 0x00FF;
	if ((a4_164 & 6) == 0x00)
	{
		s0_129->b0014 = (byte) (a4_164 & 6);
		s0_129->b0015 = (byte) ((a4_164 & 6) >> 0x08);
		s0_129->b0016 = (byte) ((a4_164 & 6) >> 0x10);
		struct Eq_275050 * a3_203 = (a4_164 & 6) >> 24;
		s0_129->b0017 = (byte) a3_203;
		a5_188 = a3_203->ptr0028;
		s0_129->b0018 = (byte) a3_203;
		s0_129->b0019 = (byte) (a3_203 >> 0x08);
		s0_129->b001A = (byte) (a3_203 >> 0x10);
		s0_129->b001B = (byte) (a3_203 >> 24);
		if ((a4_164 & 0x07) == 0x00)
		{
			uint32 a5_214 = a5_188->dw002C;
			s0_129->b001C = (byte) a5_214;
			s0_129->b001D = (byte) (a5_214 >> 0x08);
			s0_129->b001E = (byte) (a5_214 >> 0x10);
			s0_129->b001F = (byte) (a5_214 >> 24);
			a5_188 = a5_214 >> 24;
		}
	}
	*(a5_188 & -97) = a5_188->dw0000;
l2305332E:
	s0Out = s0_129;
	s1Out = s1_130;
	s2Out = s2_138;
	s4Out = dwArg04;
	s5Out = s5_141;
	s6Out = s6_133;
	return ra_140;
}

// 23053500: void Sec_Eng_SHA_Enable_Link(Register (ptr32 word32) a5)
// Called from:
//      sha256_test_case0
void Sec_Eng_SHA_Enable_Link(word32 * a5)
{
	*(a5 | 0x08000020) = *a5;
}

// 23053512: void Sec_Eng_SHA_Disable_Link(Register (ptr32 word32) a5)
// Called from:
//      sha256_test_case0
void Sec_Eng_SHA_Disable_Link(word32 * a5)
{
	*(a5 & ~0x08000020) = *a5;
}

// 23053524: Register word32 Sec_Eng_SHA256_Link_Init(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 a2, Stack word32 dwArg84, Stack word32 dwArgA4)
// Called from:
//      sha256_test_case0
word32 Sec_Eng_SHA256_Link_Init(Eq_2 ra, Eq_2 a0, ptr32 a2, word32 dwArg84, word32 dwArgA4)
{
	struct Eq_275154 * a3_23;
	struct Eq_275155 * a4_24;
	word32 t1_86;
	word32 a0_87;
	word32 a1_88;
	word32 a2_89;
	word32 a5_90;
	memset(ra, a0, 0x00, 0x14, out t1_86, out a0_87, out a1_88, out a2_89, out a3_23, out a4_24, out a5_90);
	a4_24->dw000C = dwArgA4;
	a3_23->dw0008 = dwArgA4;
	word32 s1_38;
	word32 a3_43;
	word32 a0_44;
	word32 a4_45;
	g_t4200C538();
	struct Eq_275183 * s1_57;
	word32 s0_61;
	word32 a4_64;
	g_t4200C538();
	s1_57->dw0010 = s0_61;
	return a4_64;
}

// 23053570: Register word32 Sec_Eng_SHA256_Link_Update(Register ptr32 a0, Register (ptr32 Eq_169049) a1, Register (ptr32 Eq_169117) a2, Register (ptr32 Eq_169049) a3, Register Eq_47572 a4, Register (ptr32 Eq_169049) s3, Stack word32 dwArg0128, Register out ptr32 s0Out, Register out (ptr32 Eq_169117) s1Out, Register out (ptr32 Eq_169049) a1Out, Register out Eq_47572 a4Out, Register out Eq_169126 s2Out, Register out (ptr32 Eq_169049) s3Out)
// Called from:
//      sha256_test_case0
//      Sec_Eng_SHA256_Link_Finish
word32 Sec_Eng_SHA256_Link_Update(ptr32 a0, struct Eq_169049 * a1, struct Eq_169117 * a2, struct Eq_169049 * a3, Eq_47572 a4, struct Eq_169049 * s3, word32 dwArg0128, ptr32 & s0Out, struct Eq_169117 & s1Out, struct Eq_169049 & a1Out, union Eq_47572 & a4Out, union Eq_169126 & s2Out, struct Eq_169049 & s3Out)
{
	if (a3 == null)
	{
		s0Out = s0;
		s1Out = s1;
		a1Out = a1;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		return ra;
	}
	else
	{
		struct Eq_169117 * s1_105 = a2;
		struct Eq_275197 * a5_21 = (struct Eq_275197 *) 16000000;
		do
		{
			Eq_47572 a2_25 = *a4;
			a5_21 = (struct Eq_275197 *) ((char *) a5_21 - 1);
			if (a5_21 == null)
			{
l23053596:
				goto l23053598;
			}
			a4 &= 0x01;
		} while (a4 != 0x00);
		a5_21[80] = (struct Eq_275197) a2_25;
		word32 a5_34 = a5_21 + a3;
		a5_34->t0000 = a5_21->dw0000;
		s2 = a5_21 & 63;
		if (a5_34 < a3)
			a5_34->dw0005 = a5_34->dw0004;
		if ((a5_21 & 63) != 0x00)
		{
			s3 = 64 - (a5_21 & 63);
			if (a3 >= s3)
			{
				word32 a3_57;
				struct Eq_275244 * a5_58;
				word32 s1_60;
				word32 s2_63;
				struct Eq_275247 * a4_66;
				word32 tp_67;
				word32 t3_68;
				g_t4200C52E();
				a4_66->ptr0004 = a5_58;
				a5_58->w0002 = 0x01;
				*(a5_58 | 2) = a5_58->dw0000;
				a4 = *(a5_58 | 2);
				union Eq_47572 * a5_85 = a5_58 | 2 | 64;
				*a5_85 = (union Eq_47572 *) a4;
				s1_105 = (struct Eq_169117 *) (s3 + s1_60 / 9);
				a3 = a3_57 + s2_63 + -64;
				s2.u0 = 0x00;
			}
		}
		ui32 a2_90 = a3 & 63;
		if (a3 > (struct Eq_169049 *) 63)
		{
			struct Eq_275284 * a5_92 = (struct Eq_275284 *) 16000000;
			do
			{
				a4 = a1->t0000;
				a5_92 = (struct Eq_275284 *) ((char *) a5_92 - 1);
				if (a5_92 == null)
					goto l23053596;
				a1 &= 0x01;
			} while (a1 != null);
			s1_105->ptr0004 = a5_92;
			a1 = a3 >> 0x06;
			a5_92[2] = (struct Eq_275284) (word16) a1;
			*(a5_92 | 2) = a5_92->dw0000;
			a4 = *(a5_92 | 2);
			*(a5_92 | 2 | 64) = (union Eq_47572 *) a4;
			s1_105 += (a3 & -64) / 16;
		}
		if (a2_90 != 0x00)
		{
			word32 a5_120 = 16000000;
			do
			{
				Eq_47572 a3_124 = *a4;
				a5_120 += ~0x00;
				if (a5_120 == 0x00)
					goto l23053596;
				a4 &= 0x01;
			} while (a4 != 0x00);
			word32 a5_155;
			word32 tp_164;
			word32 t3_165;
			g_t4200C52E();
		}
		word32 a5_168 = 16000000;
		do
		{
			a5_168 += ~0x00;
			if (a5_168 == 0x00)
				goto l23053596;
			a4 &= 0x01;
		} while (a4 != 0x00);
l23053598:
		0x00 = dwArg0128;
		s0Out = dwArgE4;
		s1Out = s1_105;
		a1Out = a1;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		return ra;
	}
}

// 230536A0: Register word32 Sec_Eng_SHA256_Link_Finish(Register (ptr32 Eq_169158) a0, Register (ptr32 Eq_169049) a1, Register (ptr32 Eq_169117) a2, Register (ptr32 (ptr32 Eq_275368)) a4, Stack word32 dwArgF8, Stack word32 dwArg0128, Register out (ptr32 Eq_169164) a5Out)
// Called from:
//      sha256_test_case0
word32 Sec_Eng_SHA256_Link_Finish(struct Eq_169158 * a0, struct Eq_169049 * a1, struct Eq_169117 * a2, struct Eq_275368 ** a4, word32 dwArgF8, word32 dwArg0128, struct Eq_169164 & a5Out)
{
	int32 a6_15 = a0->dw0010;
	struct Eq_169164 * a5_118 = (struct Eq_169164 *) 16000000;
	do
	{
		struct Eq_275368 * a3_22 = *a4;
		a5_118 = (struct Eq_169164 *) ((char *) a5_118 - 1);
		if (a5_118 == null)
		{
l230536C6:
			goto l230536C8;
		}
		a4 &= 0x01;
	} while (a4 != null);
	int32 a5_57;
	a3_22->dw0050 = a6_15;
	Eq_47572 a4_53 = a3_22 << 0x13 >> 24 | a3_22 << 11;
	if ((a3_22 & 63) <= 55)
		a5_57 = 56;
	else
		a5_57 = 0x0078;
	ptr32 s0_80;
	struct Eq_169049 * s3_87;
	word32 a1_288;
	word32 s2_289;
	word32 s1_287;
	Eq_47572 a4_78;
	ra = Sec_Eng_SHA256_Link_Update(a2->ptr000C, a1, a2, a5_57 - (a3_22 & 63), a4_53, a1, dwArgF8, out s0_80, out s1_287, out a1_288, out a4_78, out s2_289, out s3_87);
	a5_118 = (struct Eq_169164 *) 16000000;
	do
	{
		a5_118 = (struct Eq_169164 *) ((char *) a5_118 - 1);
		if (a5_118 == null)
			goto l230536C6;
		a4_78 &= 0x01;
	} while (a4_78 != 0x00);
	uint32 s1_110;
	word32 s2_111;
	struct Eq_275405 * a1_114;
	word32 s3_116;
	word32 s0_286;
	ui32 a4_107;
	ra = Sec_Eng_SHA256_Link_Update(s0_80, s3_87, fp + -40, (struct Eq_169049 *) 0x08, a4_78, s3_87, dwArgF8, out s0_286, out s1_110, out a1_114, out a4_107, out s2_111, out s3_116);
	a5_118 = (struct Eq_169164 *) 16000000;
	do
	{
		a5_118 = (struct Eq_169164 *) ((char *) a5_118 - 1);
		if (a5_118 == null)
			goto l230536C6;
		a4_107 &= 0x01;
	} while (a4_107 != 0x00);
	int32 a2_132;
	word32 * a5_128 = s1_110 >> 0x02 & 0x07;
	word32 s0_131 = a1_114->dw0010;
	if (a5_128 != (word32 *) 0x01)
	{
		if (a5_128 != null)
		{
			a2_132 = 0x14;
			if (a5_128 > (word32 *) 0x03)
				goto l230537A0;
		}
		else
			a2_132 = 32;
	}
	else
		a2_132 = 0x1C;
	word32 a4_159;
	g_t4200C52E();
l230537A0:
	a5_118 = a5_128 & -65;
	a5_118->dw0000 = *a5_128;
l230536C8:
	0x00 = dwArg0128;
	a5Out = a5_118;
	return ra;
}

// 230537CA: Register word32 Sec_Eng_AES_Enable_Link()
// Called from:
//      Sec_Eng_AES_Link_Case_CBC_128
//      Sec_Eng_AES_Link_Case_CTR_128
//      Sec_Eng_AES_Link_Case_ECB_128
word32 Sec_Eng_AES_Enable_Link()
{
	*(int32 *) 0x40004100 |= 0x08000000;
	return 0x08000000;
}

// 230537DC: void Sec_Eng_AES_Disable_Link()
// Called from:
//      Sec_Eng_AES_Link_Case_CBC_128
//      Sec_Eng_AES_Link_Case_CTR_128
//      Sec_Eng_AES_Link_Case_ECB_128
void Sec_Eng_AES_Disable_Link()
{
	*(int32 *) 0x40004100 &= ~0x08000000;
}

