pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 230537F0: Register (ptr32 Eq_167587) Sec_Eng_AES_Link_Work(Register (ptr32 Eq_167587) a1, Register (ptr32 Eq_167588) a2, Register Eq_167589 a3, Register (ptr32 Eq_167590) a4)
// Called from:
//      Sec_Eng_AES_Link_Case_CBC_128
//      Sec_Eng_AES_Link_Case_CTR_128
//      Sec_Eng_AES_Link_Case_ECB_128
struct Eq_167587 * Sec_Eng_AES_Link_Work(struct Eq_167587 * a1, struct Eq_167588 * a2, Eq_167589 a3, struct Eq_167590 * a4)
{
	if ((a1 & 3 | a3 & 0x0F) == 0x00)
	{
		struct Eq_275500 * a5_10 = (struct Eq_275500 *) 16000000;
		do
		{
			int32 a7_14 = *(int32 *) 0x40004100;
			a5_10 = (struct Eq_275500 *) ((char *) a5_10 - 1);
			if (a5_10 == null)
				return a1;
		} while ((a7_14 & 1) != 0x00);
		*(struct Eq_167587 **) 0x40004150 = a1;
		a2->ptr0004 = a1;
		a4->ptr0008 = a1;
		a1->w0002 = (word16) (a3 >> 4);
		*(a5_10 | 4) = a5_10->dw0000;
		*(a5_10 | 4 | 2) = *(a5_10 | 4);
		word32 a5_37 = 16000000;
		do
		{
			int32 a4_41 = *(int32 *) 0x40004100;
			a5_37 += ~0x00;
			if (a5_37 == 0x00)
				return a1;
			a1 = a4_41 & 1;
		} while ((a4_41 & 1) != 0x00);
		*(int32 *) 0x40004100 = a4_41 & ~0x04;
	}
	return a1;
}

// 23053868: void Sec_Eng_PKA_Reset()
// Called from:
//      _pka_test_case_xgcd
//      _pka_test_case2
void Sec_Eng_PKA_Reset()
{
	((union Eq_274503 *) 0x40004300)->u0 = 0x00;
	((union Eq_274503 *) 0x40004300)->u0 = 0x08;
}

// 23053878: void Sec_Eng_PKA_BigEndian_Enable()
// Called from:
//      _pka_test_case_xgcd
//      _pka_test_case2
void Sec_Eng_PKA_BigEndian_Enable()
{
	*(union Eq_274503 *) 0x40004300 |= 0x01000000;
}

// 2305388A: void Sec_Eng_PKA_Clear_Int()
// Called from:
//      Sec_Eng_PKA_Read_Data
//      Sec_Eng_PKA_CREG
//      Sec_Eng_PKA_Move_Data
//      Sec_Eng_PKA_MREM
//      Sec_Eng_PKA_MEXP
//      Sec_Eng_PKA_LCMP
//      Sec_Eng_PKA_LSUB
//      Sec_Eng_PKA_LMUL
//      Sec_Eng_PKA_LDIV
//      Sec_Eng_PKA_LMUL2N
void Sec_Eng_PKA_Clear_Int()
{
	*(union Eq_274503 *) 0x40004300 |= 0x0200;
	*(union Eq_274503 *) 0x40004300 &= -513;
}

// 230538A8: void Sec_Eng_PKA_Read_Block(Register ptr32 a0, Register Eq_165539 a2, Register (ptr32 ui32) a3)
// Called from:
//      Sec_Eng_PKA_Read_Data
void Sec_Eng_PKA_Read_Block(ptr32 a0, Eq_165539 a2, ui32 * a3)
{
	ui32 a5_15;
	for (a5_15 = 0x00; a5_15 != (a2 & ~0x03); ++a5_15)
		*a3 = (a5_15 << 0x02) + a0;
}

// 230538C0: void Sec_Eng_PKA_Write_Block(Register ui32 a0, Register (arr (ptr32 ui32)) a1, Register uint32 a2)
// Called from:
//      Sec_Eng_PKA_Write_Data
void Sec_Eng_PKA_Write_Block(ui32 a0, ui32 * a1[], uint32 a2)
{
	ui32 a5_13;
	for (a5_13 = 0x00; a5_13 != (a2 & ~0x03); ++a5_13)
		*a1[a5_13] = a0;
}

// 230538D8: Register (ptr32 (arr (ptr32 ui32))) Sec_Eng_PKA_Write_Data(Register ui32 a0, Register ui32 a1, Register (arr (ptr32 ui32)) a2, Register Eq_165190 a3, Register ui32 a4)
// Called from:
//      _pka_test_case_xgcd
//      _pka_test_case2
ui32 * (* Sec_Eng_PKA_Write_Data)[](ui32 a0, ui32 a1, ui32 * a2[], Eq_165190 a3, ui32 a4)
{
	uint32 a2_14 = a0 + -1 & 0x00FF;
	uint32 a6_16 = 0x00;
	if (a2_14 <= 0x09)
		a6_16 = (word32) g_a2308867C[a2_14 * 0x02];
	*(ui32 **) 0x40004340 = (word32) (word12) a3 | a1 << 0x0C | (a0 & 0x0F) << 20 | 0x39000000 | a4 << 31;
	Eq_165190 a6_42 = a6_16 >> 0x02;
	Eq_165190 s0_44 = a6_42;
	if (a3 < a6_42)
		s0_44 = a3;
	uint32 s0_47 = s0_44 << 16;
	Sec_Eng_PKA_Write_Block(0x40004340, a2, s0_47 >> 16);
	Eq_275665 a5_58 = s0_47 >> 16 & -4;
	while (a5_58 < s0_47 >> 16)
	{
		*(ui32 **) 0x40004340 = a2[a5_58];
		a5_58 = (word32) a5_58.u0 + 1;
	}
	return a2;
}

// 2305396A: Register Eq_165539 Sec_Eng_PKA_Read_Data(Register ui32 a0, Register ui32 a1, Register ptr32 a2, Register Eq_165539 a3)
// Called from:
//      _pka_test_case_xgcd
//      _pka_test_case2
Eq_165539 Sec_Eng_PKA_Read_Data(ui32 a0, ui32 a1, ptr32 a2, Eq_165539 a3)
{
	uint32 a5_5 = a0 + -1 & 0x00FF;
	uint32 a4_13 = 0x00;
	if (a5_5 <= 0x09)
		a4_13 = (word32) g_a2308867C[a5_5 * 0x02];
	if (a4_13 >> 2 < a3)
		return a3;
	*(ui32 **) 0x40004340 = a3 | a1 << 0x0C | (a0 & 0x0F) << 0x14 | 0xB8000000;
	*(ui32 **) 0x40004340 = null;
	ui32 * a3_47 = Sec_Eng_PKA_Wait_ISR();
	Sec_Eng_PKA_Clear_Int();
	Sec_Eng_PKA_Read_Block(a2, a3, a3_47);
	Eq_165539 a5_60 = a3 & -4;
	while (a5_60 < a3)
	{
		**(ui32 **) 0x40004340 = (a5_60 << 0x02) + a2;
		a5_60 = (word32) a5_60.u0 + 1;
	}
	return 0x40004000;
}

// 230539FE: void Sec_Eng_PKA_CREG(Register ui32 a0, Register ui32 a1, Register ui32 a2, Register ui32 a3)
// Called from:
//      _pka_test_case_xgcd
//      _pka_test_case2
void Sec_Eng_PKA_CREG(ui32 a0, ui32 a1, ui32 a2, ui32 a3)
{
	*(ui32 **) 0x40004340 = a2 | a1 << 0x0C | (a0 & 0x0F) << 20 | 0x35000000 | a3 << 0x1F;
	*(ui32 **) 0x40004340 = null;
	if (a3 == 0x00)
		return;
	Sec_Eng_PKA_Wait_ISR();
	Sec_Eng_PKA_Clear_Int();
}

// 23053A34: void Sec_Eng_PKA_Move_Data(Register ui32 a0, Register ui32 a1, Register ui32 a2, Register ui32 a3, Register ui32 a4)
// Called from:
//      _pka_test_case_xgcd
//      _pka_test_case2
void Sec_Eng_PKA_Move_Data(ui32 a0, ui32 a1, ui32 a2, ui32 a3, ui32 a4)
{
	Sec_Eng_PKA_Write_Common_OP_First_Cfg(a3, a2, a1, a0, 50, a4);
	*(ui32 **) 0x40004340 = null;
	if (a4 == 0x00)
		return;
	Sec_Eng_PKA_Wait_ISR();
	Sec_Eng_PKA_Clear_Int();
}

// 23053A72: Register word32 Sec_Eng_PKA_MREM(Register ui32 a0, Register ui32 a1, Register ui32 a2, Register ui32 a3, Register ui32 a4, Register ui32 a5, Register ui32 a6)
// Called from:
//      _pka_test_case_xgcd
//      _pka_test_case2
word32 Sec_Eng_PKA_MREM(ui32 a0, ui32 a1, ui32 a2, ui32 a3, ui32 a4, ui32 a5, ui32 a6)
{
	Sec_Eng_PKA_Write_Common_OP_First_Cfg(a3, a2, a1, a0, 38, a6);
	*(ui32 **) 0x40004340 = (a4 & 0x0F) << 8 | a5;
	if (a6 == 0x00)
		return;
	Sec_Eng_PKA_Wait_ISR();
	Sec_Eng_PKA_Clear_Int();
	return;
}

// 23053AC4: void Sec_Eng_PKA_MEXP(Register ui32 a0, Register ui32 a1, Register ui32 a2, Register ui32 a3, Register ui32 a4, Register ui32 a6, Register ui32 a7, Stack Eq_165633 bArg00, Stack Eq_2 dwArg08)
// Called from:
//      _pka_test_case2
void Sec_Eng_PKA_MEXP(ui32 a0, ui32 a1, ui32 a2, ui32 a3, ui32 a4, ui32 a6, ui32 a7, Eq_165633 bArg00, Eq_2 dwArg08)
{
	Eq_165633 bArg00 = (byte) dwArg00;
	ui32 s2_6 = (word32) bArg00;
	Sec_Eng_PKA_Write_Common_OP_First_Cfg(a3, a2, a1, a0, 35, s2_6);
	*(ui32 **) 0x40004340 = dwArg08 << 0x0C | (a4 & 0x0F) << 20 | a7 | (a6 & 0x0F) << 8;
	if (s2_6 == 0x00)
		return;
	Sec_Eng_PKA_Wait_ISR();
	Sec_Eng_PKA_Clear_Int();
}

// 23053B34: void Sec_Eng_PKA_LCMP(Register (ptr32 byte) a0, Register ui32 a1, Register ui32 a2, Register ui32 a3, Register ui32 a4)
// Called from:
//      _pka_test_case_xgcd
void Sec_Eng_PKA_LCMP(byte * a0, ui32 a1, ui32 a2, ui32 a3, ui32 a4)
{
	*(ui32 **) 0x40004340 = (a1 & 0x0F) << 8 | a2 | 0x99000000;
	*(ui32 **) 0x40004340 = a4 << 0x0C | (a3 & 0x0F) << 20;
	Sec_Eng_PKA_Wait_ISR();
	Sec_Eng_PKA_Clear_Int();
	*a0 = (byte) (*(union Eq_274503 *) 0x40004300 >> 24 & 0x01);
}

