pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 23053B7C: Register word32 Sec_Eng_PKA_LSUB(Register ui32 a0, Register ui32 a1, Register ui32 a2, Register ui32 a3, Register ui32 a4, Register ui32 a5, Register ui32 a6)
// Called from:
//      _pka_test_case_xgcd
word32 Sec_Eng_PKA_LSUB(ui32 a0, ui32 a1, ui32 a2, ui32 a3, ui32 a4, ui32 a5, ui32 a6)
{
	Sec_Eng_PKA_Write_Common_OP_First_Cfg(a3, a2, a1, a0, 0x17, a6);
	*(ui32 **) 0x40004340 = a5 << 0x0C | (a4 & 0x0F) << 20;
	if (a6 == 0x00)
		return;
	Sec_Eng_PKA_Wait_ISR();
	Sec_Eng_PKA_Clear_Int();
	return;
}

// 23053BCE: void Sec_Eng_PKA_LMUL(Register ui32 a0, Register ui32 a1, Register ui32 a2, Register ui32 a3, Register ui32 a4, Register ui32 a5, Register ui32 a6)
// Called from:
//      _pka_test_case_xgcd
//      _pka_test_case2
void Sec_Eng_PKA_LMUL(ui32 a0, ui32 a1, ui32 a2, ui32 a3, ui32 a4, ui32 a5, ui32 a6)
{
	Sec_Eng_PKA_Write_Common_OP_First_Cfg(a3, a2, a1, a0, 22, a6);
	*(ui32 **) 0x40004340 = a5 << 0x0C | (a4 & 0x0F) << 20;
	if (a6 == 0x00)
		return;
	Sec_Eng_PKA_Wait_ISR();
	Sec_Eng_PKA_Clear_Int();
}

// 23053C20: void Sec_Eng_PKA_LDIV(Register ui32 a0, Register ui32 a1, Register ui32 a2, Register ui32 a3, Register ui32 a4, Register ui32 a5, Register ui32 a6)
// Called from:
//      _pka_test_case_xgcd
void Sec_Eng_PKA_LDIV(ui32 a0, ui32 a1, ui32 a2, ui32 a3, ui32 a4, ui32 a5, ui32 a6)
{
	Sec_Eng_PKA_Write_Common_OP_First_Cfg(a3, a2, a1, a0, 0x14, a6);
	*(ui32 **) 0x40004340 = (a4 & 0x0F) << 8 | a5;
	if (a6 == 0x00)
		return;
	Sec_Eng_PKA_Wait_ISR();
	Sec_Eng_PKA_Clear_Int();
}

// 23053C70: void Sec_Eng_PKA_LMUL2N(Register ui32 a0, Register ui32 a1, Register ui32 a2, Register ui32 a3, Register word32 a4, Register word32 a5)
// Called from:
//      _pka_test_case_xgcd
//      _pka_test_case2
void Sec_Eng_PKA_LMUL2N(ui32 a0, ui32 a1, ui32 a2, ui32 a3, word32 a4, word32 a5)
{
	Sec_Eng_PKA_Write_Common_OP_First_Cfg(a3, a2, a1, a0, 0x13, 0x00);
	*(ui32 **) 0x40004340 = (word32) (word15) a4;
	if (a5 == 0x00)
		return;
	Sec_Eng_PKA_Wait_ISR();
	Sec_Eng_PKA_Clear_Int();
}

// 23053CB8: void SEC_Eng_IntMask(Register up32 a0)
// Called from:
//      bl_sec_pka_IRQHandler
void SEC_Eng_IntMask(up32 a0)
{
	if (a0 > 0x06)
		return;
	g_t23088660();
}

// 23053DDE: void DMA_Enable(Register (ptr32 Eq_162941) a5)
// Called from:
//      bl_dma_init
void DMA_Enable(struct Eq_162941 * a5)
{
	(a5 | 1)->dw0030 = a5->dw0030;
}

// 23053DEC: Register word32 DMA_Channel_Enable()
// Called from:
//      bl_dma_IRQHandler
//      bl_dma_copy
word32 DMA_Channel_Enable()
{
	*(word32 *) 0x4000C111 = *(word32 *) 0x4000C110;
	return 0x4000C111;
}

// 23053E02: void DMA_LLI_Init(Register (ptr32 Eq_163022) a1)
// Called from:
//      bl_dma_init
void DMA_LLI_Init(struct Eq_163022 * a1)
{
	*(((word32) a1->b0000 << 11 | 0x40000110) & -0x07FF | (word32) a1->b0002 << 6 | (word32) a1->b0001 << 1) = *(word32 *) 0x4000C110;
}

// 23053E38: void DMA_LLI_Update(Register word32 a0)
// Called from:
//      bl_dma_IRQHandler
//      bl_dma_copy
void DMA_LLI_Update(word32 a0)
{
	g_t4200C524();
}

// 23053E4E: void DMA_IntMask(Register word32 a1, Register word32 a2)
// Called from:
//      bl_dma_init
void DMA_IntMask(word32 a1, word32 a2)
{
	word32 * a5_15;
	word32 a0_10;
	ui32 a4_12;
	word32 * a5_20;
	if (a1 == 0x01)
	{
		a5_20 = (word32 *) 0x4000C110;
		a0_10 = *(word32 *) 0x4000C110;
		if (a2 == 0x00)
		{
			a5_15 = (word32 *) 0x4000C110;
			goto l23053E98;
		}
		a4_12 = 0x04000000;
l23053E9E:
		a5_15 = a5_20 | a4_12;
		goto l23053E98;
	}
	word32 a3_21;
	ui32 a3_22;
	if (a1 != 0x00)
	{
		if (a1 != 0x02)
			return;
		a5_20 = *(word32 **) 0x4000C10C;
		if (a2 == 0x00)
		{
			a3_21 = 0xF4000000;
l23053EB8:
			*(a3_21 + ~0x00 & 0x4000C10C) = a5_20;
			a0_10 = *a5_20;
			a4_12 = 0x80000000;
			goto l23053E9E;
		}
		a3_22 = 0x0C000000;
	}
	else
	{
		a5_20 = *(word32 **) 0x4000C10C;
		a3_21 = 0xF8000000;
		if (a2 == 0x00)
			goto l23053EB8;
		a3_22 = 0x08000000;
	}
	*(a3_22 | 0x4000C10C) = a5_20;
	a0_10 = *a5_20;
	a5_15 = (word32) (word31) a5_20;
l23053E98:
	*a5_15 = a0_10;
}

// 23053ECA: void Default_Handler(Register Eq_2 ra, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg64, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgCC, Stack word32 dwArgE8)
// Called from:
//      SPI_IRQHandler
void Default_Handler(Eq_2 ra, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg64, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgCC, word32 dwArgE8)
{
	bflb_platform_printf(ra, &g_t23088690, dwArg18, dwArg38, dwArg64, dwArg80, dwArg84, dwArgA8, dwArgCC, dwArgE8);
}

// 23053ED6: Register word32 GLB_Set_UART_CLK(Register word32 a0, Register ui32 a1, Register ui32 a2, Register (ptr32 Eq_160209) a5, Register out ptr32 a2Out)
// Called from:
//      bl_uart_init
word32 GLB_Set_UART_CLK(word32 a0, ui32 a1, ui32 a2, struct Eq_160209 * a5, ptr32 & a2Out)
{
	(a5 & ~0x10)->dw0008 = a5->dw0008;
	struct Eq_276051 * a5_19 = a5 & ~0x10 & ~0x07;
	(a2 | a5_19)->dw0008 = (a5 & ~0x10)->dw0008;
	ui32 a4_24 = HBN_Set_UART_CLK_Sel(a1, a5_19);
	struct Eq_276069 * a5_27 = a4_24 | 16;
	if (a0 == 0x00)
		a5_27 = a4_24 & -0x0011;
	a5_27->dw0008 = 0x40000000;
	a2Out = dwArg10;
	return a0;
}

// 23053F14: void GLB_Set_ADC_CLK(Register word32 a0, Register ui32 a1, Register ui32 a2)
// Called from:
//      bl_tsen_adc_get
void GLB_Set_ADC_CLK(word32 a0, ui32 a1, ui32 a2)
{
	*(int32 *) 0x400000A4 &= -0x0101;
	*(int32 *) 0x400000A4 = (a2 | *((int32 *) 0x400000A4) & -64) & -0x0081 | a1 << 7;
	int32 a4_17 = *(int32 *) 0x400000A4;
	int32 a5_18 = a4_17 & -0x0101;
	if (a0 != 0x00)
		a5_18 = a4_17 | 0x0100;
	*(int32 *) 0x400000A4 = a5_18;
}

// 23053F54: Register word32 GLB_UART_Fun_Sel(Register ui32 a0, Register Eq_4589 a1)
// Called from:
//      bl_uart_init
word32 GLB_UART_Fun_Sel(ui32 a0, Eq_4589 a1)
{
	*(int32 *) 0x400000C0 = ~(0x0F << (a0 << 2)) & *((int32 *) 0x400000C0) | a1 << (a0 << 2);
	return 0x40000000;
}

// 23053F78: void GLB_GPIO_Write(Register ui32 a0, Register word32 a1, Register (ptr32 word32) a3)
// Called from:
//      bl_gpio_output_set
void GLB_GPIO_Write(ui32 a0, word32 a1, word32 * a3)
{
	word32 * a0_15;
	word32 a5_11 = *a3;
	ui32 a0_12 = 0x01 << a0;
	if (a1 != 0x00)
		a0_15 = a0_12 | a3;
	else
		a0_15 = ~a0_12 & a3;
	*a0_15 = a5_11;
}

