pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 23053FA2: Register uint32 GLB_GPIO_Read(Register uint32 a0)
// Called from:
//      bl_gpio_input_get
uint32 GLB_GPIO_Read(uint32 a0)
{
	return (word32) ((0x01 << a0 & ((int32[]) 0x40000180)[a0 >> 0x05]) != 0x00);
}

// 23053FC2: Register word32 HBN_Set_UART_CLK_Sel(Register ui32 a0, Register (ptr32 Eq_276051) a5)
// Called from:
//      GLB_Set_UART_CLK
word32 HBN_Set_UART_CLK_Sel(ui32 a0, struct Eq_276051 * a5)
{
	word32 a4_5 = a5->dw0030;
	(a0 << 2 | a5 & ~0x04)->dw0030 = a4_5;
	return a4_5;
}

// 23053FD4: Register ptr32 HBN_Get_RTC_Timer_Val(Register ptr32 a0, Register ptr32 a1, Register Eq_2 a4)
// Called from:
//      bl_rtc_get_counter
ptr32 HBN_Get_RTC_Timer_Val(ptr32 a0, ptr32 a1, Eq_2 a4)
{
	word32 a5_5 = *((word32) a4 + 16);
	(a4 | 0x80000000)->dw0010 = a5_5;
	(a4 & 0x7FFFFFFF)->dw0010 = a5_5;
	struct Eq_276181 * a5_12 = (a4 & 0x7FFFFFFF)->ptr000C;
	*(a4 & 0x7FFFFFFF) = a0;
	*(a5_12->dw0010 & 0x00FF) = a1;
	return 0x00;
}

// 23053FFC: void TIMER_SetCompValue(Register ui32 a0, Register word32 a1, Register (ptr32 ui32) a2)
// Called from:
//      TIMER_Init
void TIMER_SetCompValue(ui32 a0, word32 a1, ui32 * a2)
{
	*a2 = (a0 + 0x03 + a1 << 2) + 0x4000A510;
}

// 23054014: void TIMER_SetCountMode(Register ui32 a0, Register ui32 a1)
// Called from:
//      TIMER_Init
void TIMER_SetCountMode(ui32 a0, ui32 a1)
{
	*(int32 *) 0x4000A588 = ~(0x01 << a0 + 0x01) & *((int32 *) 0x4000A588) | a1 << a0 + 0x01;
}

// 23054036: void TIMER_ClearIntStatus(Register word32 a1, Register Eq_2 a4)
// Called from:
//      int_timer_cb
//      cmd_timer_start
void TIMER_ClearIntStatus(word32 a1, Eq_2 a4)
{
	*(0x01 << a1 | a4) = (word32) *a4;
}

// 23054050: void TIMER_Init(Register (ptr32 Eq_166044) a0, Register (ptr32 ui32) a2, Stack Eq_2 dwArg38)
// Called from:
//      cmd_timer_start
void TIMER_Init(struct Eq_166044 * a0, ui32 * a2, Eq_2 dwArg38)
{
	ui32 a3_18;
	ui32 a5_19;
	ui32 s1_14 = (word32) a0->b0000;
	int32 a5_15 = *(int32 *) 0x4000A500;
	ui32 a4_17 = (word32) a0->b0001;
	if (s1_14 == 0x00)
	{
		a3_18 = a5_15 & -0x0D;
		a5_19 = a4_17 << 0x02;
	}
	else
	{
		a3_18 = a5_15 & -97;
		a5_19 = a4_17 << 0x05;
	}
	ui32 a3_33;
	ui32 a5_34;
	*(int32 *) 0x4000A500 = a5_19 | a3_18;
	Eq_276261 a5_27 = *(union Eq_276261 *) 0x4000A5BC;
	ui32 a4_29 = (word32) a0->b0004;
	if (s1_14 == 0x00)
	{
		a3_33 = a5_27 & 0xF00000FF;
		a5_34 = a4_29 << 0x08;
	}
	else
	{
		a3_33 = a5_27 & ~0x00FF0000;
		a5_34 = a4_29 << 0x10;
	}
	*(union Eq_276261 *) 0x4000A5BC = a5_34 | a3_33;
	TIMER_SetCountMode(s1_14, (word32) a0->b0003);
	null[(word32) a0->b0002 / 4] = (s1_14 << 0x02) + 0x4000A55C;
	word32 a4_57 = (word32) a0->b0003;
	if (a4_57 == 0x00)
		((word32[]) 0x4000A550)[s1_14] = a4_57;
	TIMER_SetCompValue(s1_14, 0x00, a2);
	TIMER_SetCompValue(s1_14, 0x01, a2);
	TIMER_SetCompValue(s1_14, 0x02, a2);
	0x00 = (uint16) dwArg38;
}

// 23054110: void TIMER_Enable(Register (ptr32 Eq_166044) a0)
// Called from:
//      cmd_timer_start
void TIMER_Enable(struct Eq_166044 * a0)
{
	*(int32 *) 0x4000A584 = 0x01 << &a0->b0001 | *((int32 *) 0x4000A584);
}

// 23054128: void TIMER_Disable(Register (ptr32 Eq_166044) a0)
// Called from:
//      cmd_timer_start
void TIMER_Disable(struct Eq_166044 * a0)
{
	*(int32 *) 0x4000A584 = ~(0x01 << &a0->b0001) & *((int32 *) 0x4000A584);
}

// 23054144: void TIMER_IntMask(Register word32 a1, Register (ptr32 ui32) a2)
// Called from:
//      cmd_timer_start
void TIMER_IntMask(word32 a1, ui32 * a2)
{
	word32 * a5_12;
	word32 a0_8 = *(word32 *) 0x4000A544;
	if (a1 != 0x01)
	{
		if (a1 != 0x00)
		{
			if (a1 != 0x02)
			{
				if (a1 != 0x03)
					return;
				if (a2 == null)
				{
					*(word32 *) 0x4000A545 = a0_8;
					*(word32 *) 0x4000A546 = a0_8;
l23054184:
					a5_12 = (word32 *) 0x4000A544;
					goto l2305416E;
				}
				*(word32 *) 0x4000A544 = a0_8;
				*(word32 *) 0x4000A544 = a0_8;
			}
			else if (a2 == null)
				goto l23054184;
			a5_12 = (word32 *) 0x4000A540;
		}
		else if (a2 == null)
			a5_12 = (word32 *) 0x4000A545;
		else
			a5_12 = (word32 *) 0x4000A544;
	}
	else if (a2 == null)
		a5_12 = (word32 *) 0x4000A546;
	else
		a5_12 = (word32 *) 0x4000A544;
l2305416E:
	*a5_12 = a0_8;
}

// 230541AA: void WDT_Set_Clock(Register ui32 a0, Register ui32 a1)
// Called from:
//      bl_wdt_init
void WDT_Set_Clock(ui32 a0, ui32 a1)
{
	*(int32 *) 0x4000A500 = a0 << 8 | *((int32 *) 0x4000A500) & -769;
	*(union Eq_276261 *) 0x4000A5BC = (word32) *(union Eq_276261 *) 0x4000A5BC | a1 << 24;
}

// 230541D0: void WDT_SetCompValue(Register uint32 a0)
// Called from:
//      bl_wdt_init
void WDT_SetCompValue(uint32 a0)
{
	*(int32 *) 0x4000A59C = *(int32 *) 0x4000A59C & 0xF0000000 | 0x0BFFFABA;
	*(int32 *) 0x4000A5A0 = *(int32 *) 0x4000A5A0 & 0xF0000000 | 0x0EFFFB10;
	*(uint32 *) 0x4000A568 = a0;
}

// 23054200: void WDT_ResetCounterValue()
// Called from:
//      bl_wdt_feed
//      bl_wdt_init
void WDT_ResetCounterValue()
{
	*(int32 *) 0x4000A59C = *(int32 *) 0x4000A59C & 0xF0000000 | 0x0BFFFABA;
	*(int32 *) 0x4000A5A0 = *(int32 *) 0x4000A5A0 & 0xF0000000 | 0x0EFFFB10;
	*(int32 *) 0x4000A598 |= 1;
}

// 23054238: void WDT_Enable()
// Called from:
//      bl_wdt_init
void WDT_Enable()
{
	*(int32 *) 0x4000A59C = *(int32 *) 0x4000A59C & 0xF0000000 | 0x0BFFFABA;
	*(int32 *) 0x4000A5A0 = *(int32 *) 0x4000A5A0 & 0xF0000000 | 0x0EFFFB10;
	*(int32 *) 0x4000A564 |= 1;
}

// 23054270: void WDT_Disable()
// Called from:
//      bl_wdt_disable
//      bl_wdt_init
void WDT_Disable()
{
	*(int32 *) 0x4000A59C = *(int32 *) 0x4000A59C & 0xF0000000 | 0x0BFFFABA;
	*(int32 *) 0x4000A5A0 = *(int32 *) 0x4000A5A0 & 0xF0000000 | 0x0EFFFB10;
	*(int32 *) 0x4000A564 &= ~0x01;
}

// 230542A6: void WDT_IntMask(Register word32 a0, Register word32 a1)
// Called from:
//      bl_wdt_init
void WDT_IntMask(word32 a0, word32 a1)
{
	*(int32 *) 0x4000A59C = *(int32 *) 0x4000A59C & 0xF0000000 | 0x0BFFFABA;
	*(int32 *) 0x4000A5A0 = *(int32 *) 0x4000A5A0 & 0xF0000000 | 0x0EFFFB10;
	int32 a4_18 = *(int32 *) 0x4000A564;
	if (a0 == 0x00)
	{
		int32 a4_21;
		if (a1 == 0x00)
			a4_21 = a4_18 & ~0x02;
		else
			a4_21 = a4_18 | 2;
		*(int32 *) 0x4000A564 = a4_21;
	}
}

// 230542EA: Register int32 EF_Ctrl_Get_Byte_Zero_Cnt(Register int32 a0, Register out Eq_276515 a3Out)
// Called from:
//      EF_Ctrl_Read_MAC_Address
//      EF_Ctrl_Read_MAC_Address_Opt
int32 EF_Ctrl_Get_Byte_Zero_Cnt(int32 a0, union Eq_276515 & a3Out)
{
	word32 a5_13;
	int32 a4_10 = 0x00;
	for (a5_13 = 0x00; a5_13 != 0x08; ++a5_13)
	{
		int32 a3_8 = a0 >> a5_13;
		if ((a3_8 & 0x01) == 0x00)
			++a4_10;
	}
	a3Out = a3_8 & 0x01;
	return a4_10;
}

// 23054304: Register Eq_2 EF_Ctrl_Read_MAC_Address(Register Eq_2 ra, Register (ptr32 Eq_166813) s0, Register Eq_2 s1, Register ptr32 a0, Register Eq_2 s2, Register word32 s3, Register word32 s4, Register out Eq_2 s0Out, Register out Eq_166840 s1Out, Register out Eq_166841 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      bl_efuse_read_mac
Eq_2 EF_Ctrl_Read_MAC_Address(Eq_2 ra, struct Eq_166813 * s0, Eq_2 s1, ptr32 a0, Eq_2 s2, word32 s3, word32 s4, union Eq_2 & s0Out, union Eq_166840 & s1Out, union Eq_166841 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	struct Eq_276533 * s0_20;
	uint32 s1_21;
	Eq_2 ra_26;
	uint32 a5_28;
	g_t4200C56A();
	s0_20->b0000 = (byte) a5_28;
	s0_20[1] = (struct Eq_276533) (byte) (a5_28 >> 0x08);
	s0_20[3] = (struct Eq_276533) (byte) (a5_28 >> 24);
	s0_20[2] = (struct Eq_276533) (byte) (a5_28 >> 0x10);
	s0_20[4] = (struct Eq_276533) (byte) s1_21;
	s0_20[5] = (struct Eq_276533) (byte) (s1_21 >> 0x08);
	ptr32 s3_35 = 0x00;
	Eq_166841 s2_36 = 0x00;
	do
	{
		s2_36 = (word32) s2_36.u0 + 1;
		word32 a3_139;
		s3_35 += EF_Ctrl_Get_Byte_Zero_Cnt(CONVERT(Mem48[s0_20 + s2_36:byte], byte, word32), out a3_139);
	} while (s2_36 != 0x06);
	ui32 s1_65 = s1_21 >> 16 ^ s3_35;
	if ((s1_65 & 63) == 0x00)
	{
		struct Eq_276597 * a5_68 = s0_20 + 5;
		s0_73 = s0_20;
		do
		{
			struct Eq_276533 * s0_73;
			word32 a3_74 = (word32) s0_73->b0000;
			s0_73->b0000 = (byte) (word32) a5_68->b0000;
			a5_68 = (struct Eq_276597 *) ((char *) a5_68 - 1);
			a5_68[1] = (struct Eq_276597) (byte) a3_74;
			++s0_73;
		} while (a5_68 != s0_20 + 2);
	}
	s0Out = s1;
	s1Out = s1_65 & 63;
	s2Out = s2_36;
	s3Out = s3_35;
	s4Out = dwArg04;
	return ra_26;
}

// 230543A4: Register word32 EF_Ctrl_Is_MAC_Address_Slot_Empty(Register word32 a0, Register word32 a1, Register out ptr32 a0Out)
// Called from:
//      mfg_media_read_macaddr
word32 EF_Ctrl_Is_MAC_Address_Slot_Empty(word32 a0, word32 a1, ptr32 & a0Out)
{
	ptr32 a0_100;
	struct Eq_276630 * a4_20;
	word32 a5_34;
	if (a0 == 0x00)
	{
		word32 s0_59;
		word32 a1_61;
		word32 a0_62;
		g_t4200C556();
		if (s0_59 != 0x00)
			g_t4200C56A();
		a5_34 = a4_20->ptr0014->dw0018;
	}
	else if (a0 == 0x01)
	{
		word32 s0_37;
		word32 a1_39;
		word32 a0_40;
		g_t4200C556();
		if (s0_37 != 0x00)
			g_t4200C56A();
		a5_34 = a4_20->ptr006C->dw0070;
	}
	else
	{
		if (a0 != 0x02)
			goto l230543D2;
		word32 s0_15;
		word32 a1_17;
		word32 a0_18;
		g_t4200C556();
		if (s0_15 != 0x00)
			g_t4200C56A();
		a5_34 = a4_20->ptr0004->dw0008;
	}
	a0_100 = 0x01;
	if (((word32) (word22) a5_34 | a4_20) == 0x00)
	{
l230543D4:
		a0Out = a0_100;
		return ra;
	}
l230543D2:
	a0_100 = 0x00;
	goto l230543D4;
}

// 23054420: Register ui32 EF_Ctrl_Read_MAC_Address_Opt(Register uint32 a0, Register (ptr32 Eq_276686) a1, Register word32 a2, Register Eq_276688 s2, Register ptr32 s3, Register (ptr32 Eq_276686) s4, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out Eq_276688 s2Out, Register out ptr32 s3Out, Register out (ptr32 Eq_276686) s4Out)
// Called from:
//      mfg_media_read_macaddr
ui32 EF_Ctrl_Read_MAC_Address_Opt(uint32 a0, struct Eq_276686 * a1, word32 a2, Eq_276688 s2, ptr32 s3, struct Eq_276686 * s4, ptr32 & a0Out, ptr32 & a3Out, union Eq_276688 & s2Out, ptr32 & s3Out, struct Eq_276686 & s4Out)
{
	if (a0 > 0x02)
	{
		a0Out = 0x01;
		a3Out = a3;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		return s1;
	}
	uint32 a5_44;
	struct Eq_276686 * s0_116 = a1;
	uint32 s1_21 = a0;
	if (a2 != 0x00)
	{
		if (a0 == 0x02)
		{
			word32 a4_59;
			word32 a3_60;
			word32 t3_61;
			word32 s8_62;
			word32 a6_63;
			g_t4200C56A();
			goto l23054446;
		}
		word32 a4_35;
		word32 a3_36;
		word32 t3_37;
		word32 s8_38;
		word32 a6_39;
		g_t4200C56A();
	}
	if (s1_21 == 0x00)
	{
		a5_44 = *(uint32 *) 0x40007014;
		goto l2305445E;
	}
	if (s1_21 == 0x01)
	{
		a5_44 = *(uint32 *) 0x4000706C;
l2305445E:
		s0_116->b0000 = (byte) a5_44;
		s0_116[1] = (struct Eq_276686) (byte) (a5_44 >> 0x08);
		s0_116[2] = (struct Eq_276686) (byte) (a5_44 >> 0x10);
		s0_116[3] = (struct Eq_276686) (byte) (a5_44 >> 24);
		s0_116[4] = (struct Eq_276686) (byte) s1_21;
		s0_116[5] = (struct Eq_276686) (byte) (s1_21 >> 0x08);
		ptr32 s3_103 = 0x00;
		Eq_276688 s2_90 = 0x00;
		do
		{
			s2_90 = (word32) s2_90.u0 + 1;
			ptr32 a3_100;
			s3_103 += EF_Ctrl_Get_Byte_Zero_Cnt(CONVERT(Mem88[s0_116 + s2_90:byte], byte, word32), out a3_100);
		} while (s2_90 != 0x06);
		ui32 s1_108 = s1_21 >> 16 ^ s3_103;
		ptr32 a0_110 = 0x01;
		if ((s1_108 & 63) == 0x00)
		{
			struct Eq_276773 * a5_111 = s0_116 + 5;
			struct Eq_276773 * a4_112 = s0_116 + 2;
			do
			{
				a3_100 = (word32) s0_116->b0000;
				s0_116->b0000 = (byte) (word32) a5_111->b0000;
				a5_111 = (struct Eq_276773 *) ((char *) a5_111 - 1);
				a5_111[1] = (struct Eq_276773) (byte) a3_100;
				++s0_116;
			} while (a4_112 != a5_111);
			a0_110 = 0x00;
		}
		a0Out = a0_110;
		a3Out = a3_100;
		s2Out = s2_90;
		s3Out = s3_103;
		s4Out = dwArg04;
		return s1_108 & 63;
	}
l23054446:
	a5_44 = *(uint32 *) 0x40007004;
	goto l2305445E;
}

// 2305450E: Register Eq_2 EF_Ctrl_Is_CapCode_Slot_Empty(Register Eq_2 ra, Register (ptr32 byte) s0, Register word32 a0, Register word32 a1, Register out (ptr32 byte) s0Out, Register out ptr32 a0Out)
// Called from:
//      mfg_media_read_xtal_capcode
Eq_2 EF_Ctrl_Is_CapCode_Slot_Empty(Eq_2 ra, byte * s0, word32 a0, word32 a1, byte & s0Out, ptr32 & a0Out)
{
	word32 a1_15;
	word32 a0_17;
	byte * s0_14;
	Eq_2 ra_16;
	g_t4200C556();
	if (a1_15 != 0x00)
		g_t4200C56A();
	ptr32 a0_38;
	uint32 a5_45;
	if (s0_14 == null)
		a5_45 = *(uint32 *) 0x4000700C >> 2;
	else
	{
		uint32 a5_41;
		if (s0_14 == (byte *) 0x01)
			a5_41 = *(uint32 *) 0x40007070;
		else
		{
			a0_38 = 0x00;
			if (s0_14 != (byte *) 0x02)
				goto l2305453E;
			a5_41 = *(uint32 *) 0x40007008;
		}
		a5_45 = a5_41 >> 22;
	}
	a0_38 = (word32) ((a5_45 & 0x00FF) < 1);
l2305453E:
	s0Out = s0_14;
	a0Out = a0_38;
	return ra_16;
}

