pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 230547B2: void SPI_IRQHandler(Register Eq_2 ra, Register Eq_2 t0, Register Eq_2 a5, Register Eq_2 t5, Stack Eq_2 dwArg3C, Stack (ptr32 Eq_277529) dwArg50, Stack word32 dwArg58)
void SPI_IRQHandler(Eq_2 ra, Eq_2 t0, Eq_2 a5, Eq_2 t5, Eq_2 dwArg3C, struct Eq_277529 * dwArg50, word32 dwArg58)
{
	Default_Handler(ra, a5, t0, dwLoc2C, dwLoc10, dwLoc0C, t5, dwArg3C, dwArg58);
	0x00 = (word32) dwArg50->t0368;
	0x00 = (word32) dwArg50->t01D8;
	__mret();
}

// 2305484E: Register Eq_2 mfg_efuse_read_xtal_capcode(Register Eq_2 ra, Register (ptr32 Eq_166956) s0, Register Eq_2 s1, Register (ptr32 byte) a0, Register word32 a1, Register Eq_2 a3, Register int32 s2, Register (ptr32 Eq_166962) s3, Register ptr32 s4, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      mfg_media_read_xtal_capcode
Eq_2 mfg_efuse_read_xtal_capcode(Eq_2 ra, struct Eq_166956 * s0, Eq_2 s1, byte * a0, word32 a1, Eq_2 a3, int32 s2, struct Eq_166962 * s3, ptr32 s4, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s10Out, ptr32 & s11Out)
{
	word32 a3_140;
	word32 s4_169;
	word32 s1_167;
	word32 s0_172;
	word32 s2_168;
	word32 s3_148;
	up32 s0_104;
	word32 s0_23;
	word32 s1_24;
	word32 s2_25;
	word32 a1_26;
	word32 s4_28;
	word32 a0_29;
	word32 a3_280;
	g_t4200CDF4();
	word32 s0_40;
	word32 s1_41;
	word32 a1_43;
	word32 s3_44;
	word32 s4_45;
	word32 a0_46;
	word32 a3_290;
	g_t4200CDFE();
	struct Eq_277571 * sp_56;
	word32 s1_59;
	Eq_2 ra_100;
	g_t4200CE44();
	byte * s0_101 = &g_b4200D974;
	if ((word32) g_b4200D974 > 0x02)
	{
		word32 a0_77;
		ra_100 = EF_Ctrl_Is_CapCode_Slot_Empty(ra_100, &g_b4200D974, 0x02, s1_59, out s0_101, out a0_77);
		if (a0_77 == 0x00)
		{
			s0_104 = 0x02;
			goto l230548D4;
		}
	}
	if ((word32) *s0_101 > 0x01)
	{
		word32 a0_95;
		ra_100 = EF_Ctrl_Is_CapCode_Slot_Empty(ra_100, s0_101, 0x01, s1_59, out s0_101, out a0_95);
		if (a0_95 == 0x00)
		{
			s0_104 = 0x01;
			goto l230548D4;
		}
	}
	if ((word32) *s0_101 == 0x00)
	{
l230548AA:
		word32 s11_370;
		word32 t4_371;
		word32 s6_365;
		word32 s8_367;
		word32 s9_368;
		word32 s10_369;
		word32 s7_366;
		word32 a2_360;
		word32 a5_362;
		word32 a7_363;
		word32 s5_364;
		word32 a4_361;
		word32 a0_358;
		word32 a1_359;
		printf(ra_100, &g_t230886B4, a3, sp_56->t0008, sp_56->t0028, sp_56->t0070, sp_56->t0074, sp_56->t0098, sp_56->t00BC, out s1_167, out a0_358, out a1_359, out a2_360, out a3_140, out a4_361, out a5_362, out a7_363, out s2_168, out s3_148, out s4_169, out s5_364, out s6_365, out s7_366, out s8_367, out s9_368, out s10_369, out s11_370, out t4_371);
		s0_172 = 0x01;
		goto l230548EE;
	}
	up32 a0_112;
	word32 s0_372;
	ra_100 = EF_Ctrl_Is_CapCode_Slot_Empty(ra_100, s0_101, 0x00, s1_59, out s0_372, out a0_112);
	s0_104 = a0_112;
	if (a0_112 != 0x00)
		goto l230548AA;
l230548D4:
	byte * s1_144;
	ptr32 s2_147;
	word32 s4_149;
	word32 a0_160;
	word32 a0_373;
	word32 a1_374;
	word32 a2_375;
	word32 a4_376;
	word32 a5_377;
	word32 a7_378;
	word32 s5_379;
	word32 s6_380;
	word32 s7_381;
	word32 s8_382;
	word32 s9_383;
	word32 s10_384;
	word32 s11_385;
	word32 t4_386;
	s1_167 = EF_Ctrl_Read_CapCode_Opt(printf(ra_100, &g_t230886A4, a3, sp_56->t0008, sp_56->t0028, sp_56->t0070, sp_56->t0074, sp_56->t0098, sp_56->t00BC, out s1_144, out a0_373, out a1_374, out a2_375, out a3_140, out a4_376, out a5_377, out a7_378, out s2_147, out s3_148, out s4_149, out s5_379, out s6_380, out s7_381, out s8_382, out s9_383, out s10_384, out s11_385, out t4_386), s0_104, s1_144, s0_104, s4_149, s1_144, s2_147, out a0_160, out s2_168, out s4_169);
	s0_172 = a0_160;
l230548EE:
	word32 s0_214;
	word32 s1_215;
	word32 s2_216;
	word32 a1_217;
	word32 s3_218;
	word32 s4_219;
	word32 a3_227;
	g_t4200CDEA();
	Eq_2 ra_240;
	word32 s0_241;
	ptr32 s1_242;
	ptr32 s2_243;
	ptr32 s3_245;
	ptr32 a3_254;
	ptr32 s10_256;
	ptr32 s11_257;
	ptr32 s5_258;
	ptr32 s6_259;
	ptr32 s7_260;
	g_t4200CE44();
	s0Out = s1;
	s1Out = s1_242;
	a0Out = 0x00 - (word32) (s0_241 != 0x00);
	a3Out = a3_254;
	s2Out = s2_243;
	s3Out = s3_245;
	s4Out = dwArg04;
	s5Out = s5_258;
	s6Out = s6_259;
	s7Out = s7_260;
	s8Out = s4;
	s10Out = s10_256;
	s11Out = s11_257;
	return ra_240;
}

// 23054920: Register Eq_2 mfg_efuse_read_poweroffset(Register Eq_2 ra, Register (ptr32 Eq_167055) s0, Register Eq_2 s1, Register ptr32 a0, Register word32 a1, Register (ptr32 byte) s2, Register Eq_2 s3, Register word32 s4, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out)
// Called from:
//      mfg_media_read_poweroffset
Eq_2 mfg_efuse_read_poweroffset(Eq_2 ra, struct Eq_167055 * s0, Eq_2 s1, ptr32 a0, word32 a1, byte * s2, Eq_2 s3, word32 s4, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out)
{
	word32 s4_181;
	Eq_2 s3_180;
	word32 s0_187;
	word32 s1_178;
	word32 s2_179;
	word32 s0_116;
	word32 s0_23;
	word32 s1_24;
	word32 s3_26;
	word32 s4_27;
	word32 a0_28;
	word32 a1_29;
	g_t4200CDF4();
	word32 s0_44;
	word32 s2_46;
	word32 s3_47;
	word32 s4_48;
	word32 a0_49;
	word32 a1_50;
	g_t4200CDFE();
	struct Eq_277788 * sp_64;
	word32 s4_70;
	Eq_2 a3_80;
	Eq_2 ra_106;
	g_t4200CE44();
	byte * s0_113 = &g_b4200D974;
	if ((word32) g_b4200D974 > 0x02)
	{
		word32 a0_89;
		ra_106 = EF_Ctrl_Is_PowerOffset_Slot_Empty(ra_106, &g_b4200D974, 0x02, s4_70, out s0_113, out a0_89);
		if (a0_89 == 0x00)
		{
			s0_116 = 0x02;
			goto l230549A8;
		}
	}
	if ((word32) *s0_113 > 0x01)
	{
		word32 a0_107;
		ra_106 = EF_Ctrl_Is_PowerOffset_Slot_Empty(ra_106, s0_113, 0x01, s4_70, out s0_113, out a0_107);
		if (a0_107 == 0x00)
		{
			s0_116 = 0x01;
			goto l230549A8;
		}
	}
	if ((word32) *s0_113 == 0x00)
	{
l2305497E:
		word32 t4_464;
		word32 s7_459;
		word32 s9_461;
		word32 s10_462;
		word32 s11_463;
		word32 s8_460;
		word32 a4_454;
		word32 a7_456;
		word32 s5_457;
		word32 s6_458;
		word32 a5_455;
		word32 a1_451;
		word32 a2_452;
		word32 a3_453;
		word32 a0_450;
		printf(ra_106, &g_t230886B4, a3_80, sp_64->t0008, sp_64->t0028, sp_64->t0070, sp_64->t0074, sp_64->t0098, sp_64->t00BC, out s1_178, out a0_450, out a1_451, out a2_452, out a3_453, out a4_454, out a5_455, out a7_456, out s2_179, out s3_180, out s4_181, out s5_457, out s6_458, out s7_459, out s8_460, out s9_461, out s10_462, out s11_463, out t4_464);
		s0_187 = 0x01;
		goto l23054ACA;
	}
	word32 a0_124;
	word32 s0_465;
	ra_106 = EF_Ctrl_Is_PowerOffset_Slot_Empty(ra_106, s0_113, 0x00, s4_70, out s0_465, out a0_124);
	s0_116 = a0_124;
	if (a0_124 != 0x00)
		goto l2305497E;
l230549A8:
	word32 s1_155;
	word32 s2_158;
	word32 s3_159;
	word32 s4_160;
	word32 a0_171;
	word32 a0_466;
	word32 a1_467;
	word32 a2_468;
	word32 a3_469;
	word32 a4_470;
	word32 a5_471;
	word32 a7_472;
	word32 s5_473;
	word32 s6_474;
	word32 s7_475;
	word32 s8_476;
	word32 s9_477;
	word32 s10_478;
	word32 s11_479;
	word32 t4_480;
	word32 t1_481;
	word32 a0_482;
	word32 a1_483;
	word32 a2_484;
	word32 a3_485;
	word32 a4_486;
	word32 a5_487;
	memset(EF_Ctrl_Read_PowerOffset_Opt(printf(ra_106, &g_t230886A4, a3_80, sp_64->t0008, sp_64->t0028, sp_64->t0070, sp_64->t0074, sp_64->t0098, sp_64->t00BC, out s1_155, out a0_466, out a1_467, out a2_468, out a3_469, out a4_470, out a5_471, out a7_472, out s2_158, out s3_159, out s4_160, out s5_473, out s6_474, out s7_475, out s8_476, out s9_477, out s10_478, out s11_479, out t4_480), s0_116, s1_155, s0_116, &sp_64->b000C, s4_160, s2_158, s3_159, s4_160, sp_64->dw0128, out s1_178, out a0_171, out s2_179, out s3_180, out s4_181), s3_180, 0x00, 0x0E, out t1_481, out a0_482, out a1_483, out a2_484, out a3_485, out a4_486, out a5_487);
	int32 a6_198 = (int32) sp_64->b000D;
	int32 a3_199 = (int32) sp_64->b000C;
	s3_180->u1 = (byte) a3_199;
	int32 a7_207 = (int32) sp_64->b000E;
	*((word32) s3_180 + 6) = (byte) a6_198;
	((word32) s3_180 + 0x0C)->u1 = (byte) a7_207;
	ui32 a4_210 = a6_198 - a3_199 + 100 ^ 0x06;
	((word32) s3_180 + 2)->u1 = (byte) ((a4_210 + 25 ^ 50) + (a3_199 & 0x00FF));
	*((word32) s3_180 + 3) = (byte) ((a4_210 + 0x35 ^ 100) + (a3_199 & 0x00FF));
	((word32) s3_180 + 4)->u1 = (byte) (((a4_210 << 0x02) + 50 ^ 100) + (a3_199 & 0x00FF));
	((word32) s3_180 + 1)->u1 = (byte) ((a4_210 + 50 ^ 100) + (a3_199 & 0x00FF));
	((word32) s3_180 + 5)->u1 = (byte) ((a4_210 + 55 ^ 100) + (a3_199 & 0x00FF));
	ui32 a5_235 = a7_207 - a6_198 + 100 ^ 0x06;
	((word32) s3_180 + 8)->u1 = (byte) ((a5_235 + 25 ^ 50) + (a6_198 & 0x00FF));
	((word32) s3_180 + 11)->u1 = (byte) ((a5_235 + 55 ^ 100) + (a6_198 & 0x00FF));
	((word32) s3_180 + 9)->u1 = (byte) ((a5_235 + 0x35 ^ 100) + (a6_198 & 0x00FF));
	*((word32) s3_180 + 7) = (byte) ((a5_235 + 50 ^ 100) + (a6_198 & 0x00FF));
	((word32) s3_180 + 0x0A)->u1 = (byte) (((a5_235 << 0x02) + 50 ^ 100) + (a6_198 & 0x00FF));
	*((word32) s3_180 + 0x0D) = (byte) ((a5_235 + 0x39 ^ 100) + (a6_198 & 0x00FF));
	s0_187 = a0_171;
l23054ACA:
	word32 s0_309;
	word32 s1_310;
	word32 s2_311;
	word32 s3_312;
	word32 s4_313;
	word32 a1_315;
	g_t4200CDEA();
	Eq_2 ra_337;
	word32 s0_338;
	ptr32 s1_339;
	ptr32 s2_340;
	ptr32 s4_342;
	ptr32 a3_352;
	ptr32 s5_357;
	ptr32 s6_358;
	ptr32 s7_359;
	ptr32 s9_360;
	g_t4200CE44();
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_339;
	a0Out = 0x00 - (word32) (s0_338 != 0x00);
	a3Out = a3_352;
	s2Out = s2_340;
	s4Out = s4_342;
	s5Out = s5_357;
	s6Out = s6_358;
	s7Out = s7_359;
	s8Out = dwArg58;
	s9Out = s9_360;
	return ra_337;
}

// 23054AFC: Register Eq_2 mfg_efuse_read_macaddr(Register Eq_2 ra, Register (ptr32 Eq_166813) s0, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Register Eq_2 a3, Register Eq_2 s2, Register word32 s3, Register word32 s4, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      mfg_media_read_macaddr
Eq_2 mfg_efuse_read_macaddr(Eq_2 ra, struct Eq_166813 * s0, Eq_2 s1, Eq_2 a0, word32 a1, Eq_2 a3, Eq_2 s2, word32 s3, word32 s4, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s10Out, ptr32 & s11Out)
{
	word32 a3_152;
	word32 s4_159;
	word32 s1_156;
	word32 s0_162;
	word32 s2_157;
	word32 s3_158;
	uint32 s0_110;
	word32 s0_23;
	word32 s1_24;
	word32 s2_25;
	word32 a1_26;
	word32 s4_28;
	word32 a0_29;
	word32 a3_272;
	g_t4200CDF4();
	word32 s0_40;
	word32 s1_41;
	word32 a1_43;
	word32 s3_44;
	word32 s4_45;
	word32 a0_46;
	word32 a3_282;
	g_t4200CDFE();
	struct Eq_278192 * sp_56;
	word32 s1_59;
	Eq_2 ra_109;
	g_t4200CE44();
	if ((word32) g_b4200D974 > 0x02)
	{
		word32 a0_77;
		ra_109 = EF_Ctrl_Is_MAC_Address_Slot_Empty(0x02, s1_59, out a0_77);
		if (a0_77 == 0x00)
		{
			s0_110 = 0x02;
			goto l23054B82;
		}
	}
	if ((word32) g_b4200D974 > 0x01)
	{
		word32 a0_91;
		ra_109 = EF_Ctrl_Is_MAC_Address_Slot_Empty(0x01, s1_59, out a0_91);
		if (a0_91 == 0x00)
		{
			s0_110 = 0x01;
			goto l23054B82;
		}
	}
	if ((word32) g_b4200D974 == 0x00)
	{
l23054B58:
		word32 t4_362;
		word32 s7_357;
		word32 s9_359;
		word32 s10_360;
		word32 s11_361;
		word32 s8_358;
		word32 a4_352;
		word32 a7_354;
		word32 s5_355;
		word32 s6_356;
		word32 a5_353;
		word32 a0_349;
		word32 a1_350;
		word32 a2_351;
		printf(ra_109, &g_t230886B4, a3, sp_56->t0008, sp_56->t0028, sp_56->t0070, sp_56->t0074, sp_56->t0098, sp_56->t00BC, out s1_156, out a0_349, out a1_350, out a2_351, out a3_152, out a4_352, out a5_353, out a7_354, out s2_157, out s3_158, out s4_159, out s5_355, out s6_356, out s7_357, out s8_358, out s9_359, out s10_360, out s11_361, out t4_362);
		s0_162 = 0x01;
		goto l23054B9C;
	}
	uint32 a0_104;
	ra_109 = EF_Ctrl_Is_MAC_Address_Slot_Empty(0x00, s1_59, out a0_104);
	s0_110 = a0_104;
	if (a0_104 != 0x00)
		goto l23054B58;
l23054B82:
	word32 s1_133;
	Eq_276688 s2_136;
	ptr32 s3_137;
	struct Eq_276686 * s4_138;
	word32 a1_364;
	word32 a2_365;
	word32 a3_366;
	word32 a0_363;
	word32 a4_367;
	word32 a5_368;
	word32 a7_369;
	word32 s5_370;
	word32 s6_371;
	word32 s7_372;
	word32 s8_373;
	word32 s9_374;
	word32 s10_375;
	word32 s11_376;
	word32 t4_377;
	printf(ra_109, &g_t230886A4, a3, sp_56->t0008, sp_56->t0028, sp_56->t0070, sp_56->t0074, sp_56->t0098, sp_56->t00BC, out s1_133, out a0_363, out a1_364, out a2_365, out a3_366, out a4_367, out a5_368, out a7_369, out s2_136, out s3_137, out s4_138, out s5_370, out s6_371, out s7_372, out s8_373, out s9_374, out s10_375, out s11_376, out t4_377);
	word32 a0_149;
	s1_156 = EF_Ctrl_Read_MAC_Address_Opt(s0_110, s4_138, s1_133, s2_136, s3_137, s4_138, out a0_149, out a3_152, out s2_157, out s3_158, out s4_159);
	s0_162 = a0_149;
l23054B9C:
	word32 s0_206;
	word32 s1_207;
	word32 s2_208;
	word32 a1_209;
	word32 s3_210;
	word32 s4_211;
	word32 a3_219;
	g_t4200CDEA();
	Eq_2 ra_232;
	word32 s0_233;
	ptr32 s1_234;
	ptr32 s2_235;
	ptr32 s3_237;
	ptr32 a3_246;
	ptr32 s10_248;
	ptr32 s11_249;
	ptr32 s5_250;
	ptr32 s6_251;
	ptr32 s7_252;
	g_t4200CE44();
	s0Out = s1;
	s1Out = s1_234;
	a0Out = 0x00 - (word32) (s0_233 != 0x00);
	a3Out = a3_246;
	s2Out = s2_235;
	s3Out = s3_237;
	s4Out = dwArg04;
	s5Out = s5_250;
	s6Out = s6_251;
	s7Out = s7_252;
	s10Out = s10_248;
	s11Out = s11_249;
	return ra_232;
}

// 23054BCE: Register Eq_2 mfg_flash_read(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out (ptr32 Eq_278392) s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out (ptr32 (ptr32 Eq_277262)) a4Out, Register out ptr32 mstatusOut)
// Called from:
//      mfg_media_read_xtal_capcode
//      mfg_media_read_poweroffset
//      mfg_media_read_macaddr
Eq_2 mfg_flash_read(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, struct Eq_278392 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, struct Eq_277262 & a4Out, ptr32 & mstatusOut)
{
	word32 s1_131;
	word32 a0_132;
	word32 a1_133;
	word32 a2_134;
	word32 a3_135;
	word32 a4_136;
	word32 a5_137;
	word32 a7_138;
	word32 s2_139;
	word32 s3_140;
	word32 s4_141;
	word32 s5_142;
	word32 s6_143;
	word32 s7_144;
	word32 s8_145;
	word32 s9_146;
	word32 s10_147;
	word32 s11_148;
	word32 t4_149;
	printf(ra, &g_t230886CC, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_131, out a0_132, out a1_133, out a2_134, out a3_135, out a4_136, out a5_137, out a7_138, out s2_139, out s3_140, out s4_141, out s5_142, out s6_143, out s7_144, out s8_145, out s9_146, out s10_147, out s11_148, out t4_149);
	__csrrc(mstatus, 0x08);
	word32 a0_41;
	ptr32 mstatus_43;
	Eq_2 a3_104;
	struct Eq_277262 ** a4_105;
	Eq_2 ra_108;
	struct Eq_278392 * s1_109;
	g_t4200C97A();
	__csrrs(mstatus_43, 0x08);
	ptr32 a5_64 = 0x00;
	if (a0_41 != 0x00)
	{
		word32 a0_150;
		word32 a1_151;
		word32 a2_152;
		word32 a5_153;
		word32 a7_154;
		word32 s2_155;
		word32 s3_156;
		word32 s4_157;
		word32 s5_158;
		word32 s6_159;
		word32 s7_160;
		word32 s8_161;
		word32 s9_162;
		word32 s10_163;
		word32 s11_164;
		word32 t4_165;
		ra_108 = printf(ra_108, &g_t230886E0, a3_104, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_109, out a0_150, out a1_151, out a2_152, out a3_104, out a4_105, out a5_153, out a7_154, out s2_155, out s3_156, out s4_157, out s5_158, out s6_159, out s7_160, out s8_161, out s9_162, out s10_163, out s11_164, out t4_165);
		a5_64 = ~0x00;
	}
	s1Out = s1_109;
	a0Out = a5_64;
	a3Out = a3_104;
	a4Out = a4_105;
	mstatusOut = mstatus_43;
	return ra_108;
}

// 23054C22: Register Eq_2 mfg_flash_read_xtal_capcode(Register Eq_2 ra, Register (ptr32 byte) a0, Register word32 a1, Register Eq_2 a3, Register (ptr32 (ptr32 Eq_277262)) a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Register out (ptr32 byte) s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mfg_media_read_xtal_capcode
Eq_2 mfg_flash_read_xtal_capcode(Eq_2 ra, byte * a0, word32 a1, Eq_2 a3, struct Eq_277262 ** a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, byte & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	ptr32 a0_108;
	byte * s1_127 = a0;
	if (a1 != 0x00)
	{
		word32 a0_17;
		ra = mfg_flash_read(ra, a3, mstatus, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_127, out a0_17, out a3, out a4, out mstatus);
		if (a0_17 != 0x00)
		{
l23054C42:
			a0_108 = ~0x00;
			goto l23054C44;
		}
	}
	struct Eq_277262 * s0_44 = *a4;
	if (a4 == (struct Eq_277262 **) 65)
	{
		struct Eq_278516 * s0_57;
		ptr32 a0_59;
		word32 a7_67;
		word32 s9_76;
		word32 t0_77;
		word32 t3_78;
		word32 t4_79;
		g_t4200C9DE();
		if (s2 == a0_59 && (word32) s0_57->b0004 == 90)
		{
			*s1_127 = (byte) (word32) s0_57->b0005;
			a0_108 = 0x00;
l23054C44:
			0x00 = (uint16) dwArg38;
			s1Out = s1_127;
			a0Out = a0_108;
			a3Out = a3;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			s8Out = s8;
			s10Out = s10;
			s11Out = s11;
			mstatusOut = mstatus;
			return ra;
		}
	}
	goto l23054C42;
}

// 23054C86: Register Eq_2 mfg_flash_read_poweroffset(Register Eq_2 ra, Register ptr32 a0, Register word32 a1, Register Eq_2 a3, Register (ptr32 (ptr32 Eq_277262)) a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Register out (ptr32 Eq_277262) s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      mfg_media_read_poweroffset
Eq_2 mfg_flash_read_poweroffset(Eq_2 ra, ptr32 a0, word32 a1, Eq_2 a3, struct Eq_277262 ** a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, struct Eq_277262 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	struct Eq_277262 * s1_214;
	ptr32 a0_165;
	if (a1 != 0x00)
	{
		word32 a0_17;
		ra = mfg_flash_read(ra, a3, mstatus, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_214, out a0_17, out a3, out a4, out mstatus);
		if (a0_17 != 0x00)
		{
l23054CA6:
			a0_165 = ~0x00;
			goto l23054CA8;
		}
	}
	s1_214 = (struct Eq_277262 *) *a4;
	if (a4 == (struct Eq_277262 **) 65)
	{
		Eq_2 s0_55;
		ptr32 a0_59;
		word32 a7_65;
		word32 t3_67;
		word32 t1_68;
		word32 a6_69;
		word32 s10_71;
		word32 s11_72;
		word32 s3_73;
		word32 t0_80;
		word32 t4_81;
		g_t4200C9DE();
		if (s2 == a0_59 && (word32) s1_214->b0006 == 90)
		{
			word32 t1_297;
			word32 a0_298;
			word32 a1_299;
			word32 a2_300;
			word32 a3_301;
			word32 a4_302;
			word32 a5_303;
			ra = memset(ra, s0_55, 0x00, 0x0E, out t1_297, out a0_298, out a1_299, out a2_300, out a3_301, out a4_302, out a5_303);
			int32 a7_96 = (int32) s1_214->b0008;
			int32 a3_97 = (int32) s1_214->b0007;
			int32 a6_103 = (int32) s1_214->b0009;
			s0_55->u1 = (byte) a3_97;
			*((word32) s0_55 + 6) = (byte) a7_96;
			((word32) s0_55 + 0x0C)->u1 = (byte) a6_103;
			ui32 a4_109 = a7_96 - a3_97 + 100 ^ 0x06;
			((word32) s0_55 + 2)->u1 = (byte) ((a4_109 + 25 ^ 50) + (a3_97 & 0x00FF));
			*((word32) s0_55 + 3) = (byte) ((a4_109 + 0x35 ^ 100) + (a3_97 & 0x00FF));
			((word32) s0_55 + 4)->u1 = (byte) (((a4_109 << 0x02) + 50 ^ 100) + (a3_97 & 0x00FF));
			((word32) s0_55 + 1)->u1 = (byte) ((a4_109 + 50 ^ 100) + (a3_97 & 0x00FF));
			((word32) s0_55 + 5)->u1 = (byte) ((a3_97 & 0x00FF) + (a4_109 + 55 ^ 100));
			ui32 a5_134 = a6_103 - a7_96 + 100 ^ 0x06;
			((word32) s0_55 + 8)->u1 = (byte) ((a5_134 + 25 ^ 50) + (a7_96 & 0x00FF));
			((word32) s0_55 + 0x0A)->u1 = (byte) (((a5_134 << 0x02) + 50 ^ 100) + (a7_96 & 0x00FF));
			*((word32) s0_55 + 7) = (byte) ((a5_134 + 50 ^ 100) + (a7_96 & 0x00FF));
			((word32) s0_55 + 9)->u1 = (byte) ((a5_134 + 0x35 ^ 100) + (a7_96 & 0x00FF));
			((word32) s0_55 + 11)->u1 = (byte) ((a5_134 + 55 ^ 100) + (a7_96 & 0x00FF));
			*((word32) s0_55 + 0x0D) = (byte) ((a5_134 + 0x39 ^ 100) + (a7_96 & 0x00FF));
			a3.u0 = 0x07;
			a0_165 = 0x00;
l23054CA8:
			0x00 = (uint16) dwArg38;
			s1Out = s1_214;
			a0Out = a0_165;
			a3Out = a3;
			s2Out = s2;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			s8Out = s8;
			s9Out = s9;
			mstatusOut = mstatus;
			return ra;
		}
	}
	goto l23054CA6;
}

