pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 23054DEA: Register Eq_2 mfg_flash_read_macaddr(Register Eq_2 ra, Register Eq_2 a0, Register word32 a1, Register Eq_2 a3, Register (ptr32 word32) a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mfg_media_read_macaddr
Eq_2 mfg_flash_read_macaddr(Eq_2 ra, Eq_2 a0, word32 a1, Eq_2 a3, word32 * a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg9C, Eq_2 dwArgAC, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	ptr32 a0_123;
	Eq_2 s1_110 = a0;
	if (a1 != 0x00)
	{
		word32 a0_17;
		ra = mfg_flash_read(ra, a3, mstatus, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_110, out a0_17, out a3, out a4, out mstatus);
		if (a0_17 != 0x00)
		{
			word32 a2_279;
			word32 a4_280;
			word32 a5_281;
			word32 a7_282;
			word32 a1_278;
			word32 a0_277;
			word32 s8_283;
			word32 s9_284;
			word32 t4_285;
			ra = printf(ra, &g_t230886F4, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_110, out a0_277, out a1_278, out a2_279, out a3, out a4_280, out a5_281, out a7_282, out s2, out s3, out s4, out s5, out s6, out s7, out s8_283, out s9_284, out s10, out s11, out t4_285);
			goto l23054E0A;
		}
	}
	word32 s0_44 = *a4;
	if (a4 == (word32 *) 65)
	{
		struct Eq_278835 * s0_57;
		ptr32 a0_59;
		word32 a7_67;
		word32 s8_75;
		word32 s9_76;
		word32 t0_77;
		word32 t3_78;
		word32 t4_79;
		word32 a6_146;
		word32 t1_147;
		word32 t5_148;
		word32 t6_149;
		g_t4200C9DE();
		if (s2 == a0_59 && (word32) s0_57->b000A == 90)
		{
			word32 a1_286;
			word32 a2_287;
			word32 a4_288;
			word32 a5_289;
			word32 a6_290;
			word32 a7_291;
			memcpy(s1_110, &s0_57->b000A + 1, 0x06, out a1_286, out a2_287, out a3, out a4_288, out a5_289, out a6_290, out a7_291);
			a0_123 = 0x00;
l23054E0C:
			0x00 = (uint16) dwArg38;
			s1Out = s1_110;
			a0Out = a0_123;
			a3Out = a3;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			s10Out = s10;
			s11Out = s11;
			mstatusOut = mstatus;
			return ra;
		}
	}
l23054E0A:
	a0_123 = ~0x00;
	goto l23054E0C;
}

// 23054E5C: Register Eq_2 Bl_F(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_278879 a5, Register Eq_2 a7, Register out Eq_278879 s0Out, Register out ptr32 s1Out, Register out Eq_2 s2Out)
// Called from:
//      bl60x_fw_password_hash
Eq_2 Bl_F(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_278879 a5, Eq_2 a7, union Eq_278879 & s0Out, ptr32 & s1Out, union Eq_2 & s2Out)
{
	Eq_2 a3_40;
	word32 a1_258;
	word32 a2_259;
	word32 a4_260;
	word32 a5_261;
	Eq_2 a0_39 = strlen(a2, out a1_258, out a2_259, out a3_40, out a4_260, out a5_261);
	int32 a6_59;
	word32 a1_262;
	word32 a2_263;
	word32 a3_264;
	word32 a4_265;
	word32 a5_266;
	word32 a7_267;
	memcpy(a0, a3_40, a4, out a1_262, out a2_263, out a3_264, out a4_265, out a5_266, out a6_59, out a7_267);
	struct Eq_278913 * a4_67 = (word32) a0 + dwLoc48;
	a4_67->b0000 = (byte) (a6_59 >> 0x18);
	a4_67->b0001 = (byte) (a6_59 >> 0x10);
	a4_67->b0002 = (byte) (a6_59 >> 0x08);
	a4_67->b0003 = (byte) a6_59;
	Bl_hmac_sha1(ra, 0x01, a2, a0_39, a1, 0x14);
	word32 a1_268;
	word32 a2_269;
	word32 a3_270;
	word32 a4_271;
	word32 a5_272;
	word32 a6_273;
	word32 a7_274;
	memcpy(a7, a1, 0x14, out a1_268, out a2_269, out a3_270, out a4_271, out a5_272, out a6_273, out a7_274);
	Eq_278879 s0_113 = 0x01;
	while (s0_113 < a5)
	{
		Bl_hmac_sha1(ra, 0x01, a2, a0_39, a0, 0x14);
		word32 a1_275;
		word32 a2_276;
		word32 a3_277;
		word32 a4_278;
		word32 a5_279;
		word32 a6_280;
		word32 a7_281;
		memcpy(a1, a0, 0x14, out a1_275, out a2_276, out a3_277, out a4_278, out a5_279, out a6_280, out a7_281);
		int32 a5_164;
		for (a5_164 = 0x00; a5_164 != 0x14; ++a5_164)
		{
			byte * a3_167 = (word32) a7 + a5_164;
			*a3_167 = (byte) ((word32) *((word32) a0 + a5_164) ^ (word32) (*a3_167));
		}
		s0_113 = (word32) s0_113.u0 + 1;
	}
	s0Out = s0_113;
	s1Out = a6;
	s2Out = a1;
	return dwLoc08;
}

// 23054F3A: Register Eq_2 Bl_PasswordHash(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register out ptr32 a0Out)
// Called from:
//      bl60x_fw_password_hash
Eq_2 Bl_PasswordHash(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, ptr32 & a0Out)
{
	ptr32 a0_114;
	Eq_2 s1_147 = a2;
	word32 a1_171;
	word32 a2_172;
	word32 a3_173;
	word32 a4_174;
	word32 a5_175;
	if (strlen(a0, out a1_171, out a2_172, out a3_173, out a4_174, out a5_175) <= 63)
	{
		a0_114 = ~0x00;
		if (a2 <= 32)
		{
			Eq_2 s0_49;
			Eq_2 s1_50;
			Eq_2 s2_51;
			Eq_2 ra_48 = Bl_F(ra, fp + -0x0044, fp + -88, a0, a2, 0x01000000, a3, out s0_49, out s1_50, out s2_51);
			word32 a1_176;
			word32 a2_177;
			word32 a3_178;
			word32 a4_179;
			word32 a5_180;
			word32 a6_181;
			word32 a7_182;
			memcpy((word32) s0_49 + 20, s0_49, 0x0C, out a1_176, out a2_177, out a3_178, out a4_179, out a5_180, out a6_181, out a7_182);
			word32 s0_183;
			word32 s2_184;
			Bl_F(ra_48, fp + -0x0044, fp + -88, s2_51, s1_50, 0x01000000, s0_49, out s0_183, out s1_147, out s2_184);
			a0_114 = 0x00;
		}
	}
	else
		a0_114 = ~0x00;
	a0Out = a0_114;
	return s1_147;
}

