pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 23054FAC: Register word32 bl60x_fw_password_hash(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register out ptr32 a0Out)
// Called from:
//      wifi_mgmr_psk_cal
word32 bl60x_fw_password_hash(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, ptr32 & a0Out)
{
	ptr32 a0_7;
	word32 s1_15 = Bl_PasswordHash(ra, a0, a2, a3, out a0_7);
	a0Out = a0_7;
	return s1_15;
}

// 23054FB0: Register Eq_2 bl_mtd_open(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out Eq_134031 s2Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      ota_tcp_cmd
//      ef_port_init
//      romfs_register
Eq_2 bl_mtd_open(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgB4, Eq_2 dwArgC8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & s0Out, ptr32 & a0Out, ptr32 & a3Out, union Eq_134031 & s2Out, ptr32 & s5Out, ptr32 & s6Out)
{
	ptr32 a0_42;
	Eq_2 a0_27;
	word32 s8_720;
	word32 s4_719;
	word32 s3_718;
	word32 a6_717;
	word32 a5_716;
	word32 a4_715;
	word32 a2_714;
	word32 a1_713;
	Eq_2 s1_102;
	Eq_134031 s2_36;
	ptr32 a3_30;
	pvPortMalloc(ra, a0, 32, a3, a4, a5, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_102, out a0_27, out a1_713, out a2_714, out a3_30, out a4_715, out a5_716, out a6_717, out s2_36, out s3_718, out s4_719, out s8_720);
	if (a0_27 != 0x00)
	{
		Eq_2 a3_108;
		struct Eq_279120 * a5_110;
		word32 a5_727;
		word32 a3_725;
		word32 a4_726;
		word32 a1_723;
		word32 a2_724;
		word32 a0_722;
		word32 t1_721;
		Eq_2 ra_52 = memset(ra, a0_27, 0x00, 32, out t1_721, out a0_722, out a1_723, out a2_724, out a3_725, out a4_726, out a5_727);
		word32 a3_728;
		word32 a5_730;
		word32 a4_729;
		strncpy(a0_27, s1_102, 0x10, out a3_728, out a4_729, out a5_730);
		if ((s2_36 & 1) != 0x00)
		{
			if ((s2_36 & 2) != 0x00)
			{
				word32 a0_244;
				Eq_2 a3_247;
				struct Eq_279166 * a5_249;
				s1_102 = hal_boot2_partition_bus_addr_inactive(s1_102, dwArgC8, out a0_244, out a3_247, out a5_249);
				if (a0_244 != 0x00 || a5_249 == null)
				{
					word32 a0_732;
					word32 s1_731;
					word32 a2_734;
					word32 a1_733;
					word32 a4_735;
					word32 a5_736;
					Eq_2 a3_537;
					word32 a7_737;
					word32 s2_738;
					word32 s3_739;
					word32 s4_740;
					word32 s5_741;
					word32 s6_742;
					word32 s7_743;
					word32 s8_744;
					word32 s9_745;
					word32 s10_746;
					word32 s11_747;
					word32 t4_748;
					word32 s1_749;
					word32 a0_750;
					word32 a1_751;
					word32 a2_752;
					word32 a3_753;
					word32 a4_754;
					word32 a5_755;
					word32 a7_756;
					word32 s2_757;
					word32 s3_758;
					word32 s4_759;
					word32 s5_760;
					word32 s6_761;
					word32 s7_762;
					word32 s8_763;
					word32 s9_764;
					word32 s10_765;
					word32 s11_766;
					word32 t4_767;
					printf(printf(ra_52, &g_t2308870C, a3_247, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_731, out a0_732, out a1_733, out a2_734, out a3_537, out a4_735, out a5_736, out a7_737, out s2_738, out s3_739, out s4_740, out s5_741, out s6_742, out s7_743, out s8_744, out s9_745, out s10_746, out s11_747, out t4_748), &g_t23088740, a3_537, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_749, out a0_750, out a1_751, out a2_752, out a3_753, out a4_754, out a5_755, out a7_756, out s2_757, out s3_758, out s4_759, out s5_760, out s6_761, out s7_762, out s8_763, out s9_764, out s10_765, out s11_766, out t4_767);
					while (true)
						;
				}
				a5_249->t001C = dwArgB4;
			}
			else
				*((word32) a0_27 + 28) = 0x00;
			if (hal_boot2_partition_addr_inactive(s1_102, dwArgC8, out a3_108, out a5_110) != 0x00 || a5_110 == null)
			{
				Eq_2 a3_482;
				word32 s1_768;
				word32 a0_769;
				word32 a1_770;
				word32 a2_771;
				word32 a4_772;
				word32 a5_773;
				word32 a7_774;
				word32 s2_775;
				word32 s3_776;
				word32 s4_777;
				word32 s5_778;
				word32 s6_779;
				word32 s7_780;
				word32 s8_781;
				word32 s9_782;
				word32 s10_783;
				word32 s11_784;
				word32 t4_785;
				word32 s1_786;
				word32 a0_787;
				word32 a1_788;
				word32 a2_789;
				word32 a3_790;
				word32 a4_791;
				word32 a5_792;
				word32 a7_793;
				word32 s2_794;
				word32 s3_795;
				word32 s4_796;
				word32 s5_797;
				word32 s6_798;
				word32 s7_799;
				word32 s8_800;
				word32 s9_801;
				word32 s10_802;
				word32 s11_803;
				word32 t4_804;
				printf(printf(ra_52, &g_t2308870C, a3_108, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_768, out a0_769, out a1_770, out a2_771, out a3_482, out a4_772, out a5_773, out a7_774, out s2_775, out s3_776, out s4_777, out s5_778, out s6_779, out s7_780, out s8_781, out s9_782, out s10_783, out s11_784, out t4_785), &g_t23088740, a3_482, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_786, out a0_787, out a1_788, out a2_789, out a3_790, out a4_791, out a5_792, out a7_793, out s2_794, out s3_795, out s4_796, out s5_797, out s6_798, out s7_799, out s8_800, out s9_801, out s10_802, out s11_803, out t4_804);
				while (true)
					;
			}
		}
		else
		{
			if ((s2_36 & 2) != 0x00)
			{
				word32 a0_73;
				Eq_2 a3_76;
				struct Eq_279615 * a5_78;
				word32 s2_904;
				word32 s3_905;
				word32 s6_906;
				hal_boot2_partition_bus_addr_active(s1_102, dwArgC8, out s1_102, out a0_73, out a3_76, out a5_78, out s2_904, out s3_905, out s6_906);
				if (a0_73 != 0x00 || a5_78 == null)
				{
					Eq_2 a3_198;
					word32 s1_907;
					word32 a0_908;
					word32 a1_909;
					word32 a2_910;
					word32 a4_911;
					word32 a5_912;
					word32 a7_913;
					word32 s2_914;
					word32 s3_915;
					word32 s4_916;
					word32 s5_917;
					word32 s6_918;
					word32 s7_919;
					word32 s8_920;
					word32 s9_921;
					word32 s10_922;
					word32 s11_923;
					word32 t4_924;
					word32 s1_925;
					word32 a0_926;
					word32 a1_927;
					word32 a2_928;
					word32 a3_929;
					word32 a4_930;
					word32 a5_931;
					word32 a7_932;
					word32 s2_933;
					word32 s3_934;
					word32 s4_935;
					word32 s5_936;
					word32 s6_937;
					word32 s7_938;
					word32 s8_939;
					word32 s9_940;
					word32 s10_941;
					word32 s11_942;
					word32 t4_943;
					printf(printf(ra_52, &g_t2308870C, a3_76, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_907, out a0_908, out a1_909, out a2_910, out a3_198, out a4_911, out a5_912, out a7_913, out s2_914, out s3_915, out s4_916, out s5_917, out s6_918, out s7_919, out s8_920, out s9_921, out s10_922, out s11_923, out t4_924), &g_t23088740, a3_198, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_925, out a0_926, out a1_927, out a2_928, out a3_929, out a4_930, out a5_931, out a7_932, out s2_933, out s3_934, out s4_935, out s5_936, out s6_937, out s7_938, out s8_939, out s9_940, out s10_941, out s11_942, out t4_943);
					while (true)
						;
				}
				a5_78->t001C = dwArgB4;
			}
			else
				*((word32) a0_27 + 28) = 0x00;
			word32 a0_105;
			word32 s1_944;
			word32 s2_945;
			hal_boot2_partition_addr_active(s1_102, dwArgC8, out s1_944, out a0_105, out a3_108, out a5_110, out s2_945);
			if (a0_105 != 0x00 || a5_110 == null)
			{
				Eq_2 a3_143;
				word32 s1_946;
				word32 a0_947;
				word32 a1_948;
				word32 a2_949;
				word32 a4_950;
				word32 a5_951;
				word32 a7_952;
				word32 s2_953;
				word32 s3_954;
				word32 s4_955;
				word32 s5_956;
				word32 s6_957;
				word32 s7_958;
				word32 s8_959;
				word32 s9_960;
				word32 s10_961;
				word32 s11_962;
				word32 t4_963;
				word32 s1_964;
				word32 a0_965;
				word32 a1_966;
				word32 a2_967;
				word32 a3_968;
				word32 a4_969;
				word32 a5_970;
				word32 a7_971;
				word32 s2_972;
				word32 s3_973;
				word32 s4_974;
				word32 s5_975;
				word32 s6_976;
				word32 s7_977;
				word32 s8_978;
				word32 s9_979;
				word32 s10_980;
				word32 s11_981;
				word32 t4_982;
				printf(printf(ra_52, &g_t2308870C, a3_108, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_946, out a0_947, out a1_948, out a2_949, out a3_143, out a4_950, out a5_951, out a7_952, out s2_953, out s3_954, out s4_955, out s5_956, out s6_957, out s7_958, out s8_959, out s9_960, out s10_961, out s11_962, out t4_963), &g_t23088740, a3_143, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_964, out a0_965, out a1_966, out a2_967, out a3_968, out a4_969, out a5_970, out a7_971, out s2_972, out s3_973, out s4_974, out s5_975, out s6_976, out s7_977, out s8_978, out s9_979, out s10_980, out s11_981, out t4_982);
				while (true)
					;
			}
		}
		a5_110->t0014 = dwArgB4;
		a5_110->t0018 = dwArgB4;
		word32 a0_805;
		word32 a1_806;
		word32 a2_807;
		word32 a4_808;
		word32 a5_809;
		word32 s4_810;
		word32 s8_811;
		puts(0x23088784, out a0_805, out a1_806, out a2_807, out a4_808, out a5_809, out s4_810, out s8_811);
		Eq_2 a3_329;
		Eq_2 a3_354;
		Eq_2 a3_380;
		struct Eq_279378 * a1_404;
		Eq_2 a3_406;
		word32 s1_812;
		word32 a0_813;
		word32 a1_814;
		word32 a2_815;
		word32 a4_816;
		word32 a5_817;
		word32 a7_818;
		word32 s2_819;
		word32 s3_820;
		word32 s4_821;
		word32 s5_822;
		word32 s6_823;
		word32 s7_824;
		word32 s8_825;
		word32 s9_826;
		word32 s10_827;
		word32 s11_828;
		word32 t4_829;
		word32 s1_830;
		word32 a0_831;
		word32 a1_832;
		word32 a2_833;
		word32 a4_834;
		word32 a5_835;
		word32 a7_836;
		word32 s2_837;
		word32 s3_838;
		word32 s4_839;
		word32 s5_840;
		word32 s6_841;
		word32 s7_842;
		word32 s8_843;
		word32 s9_844;
		word32 s10_845;
		word32 s11_846;
		word32 t4_847;
		word32 s1_848;
		word32 a0_849;
		word32 a1_850;
		word32 a2_851;
		word32 a4_852;
		word32 a5_853;
		word32 a7_854;
		word32 s2_855;
		word32 s3_856;
		word32 s4_857;
		word32 s5_858;
		word32 s6_859;
		word32 s7_860;
		word32 s8_861;
		word32 s9_862;
		word32 s10_863;
		word32 s11_864;
		word32 t4_865;
		word32 s1_866;
		word32 a0_867;
		word32 a2_868;
		word32 a4_869;
		word32 a5_870;
		word32 a7_871;
		word32 s2_872;
		word32 s3_873;
		word32 s4_874;
		word32 s5_875;
		word32 s6_876;
		word32 s7_877;
		word32 s8_878;
		word32 s9_879;
		word32 s10_880;
		word32 s11_881;
		word32 t4_882;
		Eq_2 ra_409 = printf(printf(printf(printf(ra_52, &g_t230887AC, a3_108, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_812, out a0_813, out a1_814, out a2_815, out a3_329, out a4_816, out a5_817, out a7_818, out s2_819, out s3_820, out s4_821, out s5_822, out s6_823, out s7_824, out s8_825, out s9_826, out s10_827, out s11_828, out t4_829), &g_t230887BC, a3_329, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_830, out a0_831, out a1_832, out a2_833, out a3_354, out a4_834, out a5_835, out a7_836, out s2_837, out s3_838, out s4_839, out s5_840, out s6_841, out s7_842, out s8_843, out s9_844, out s10_845, out s11_846, out t4_847), &g_t230887CC, a3_354, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_848, out a0_849, out a1_850, out a2_851, out a3_380, out a4_852, out a5_853, out a7_854, out s2_855, out s3_856, out s4_857, out s5_858, out s6_859, out s7_860, out s8_861, out s9_862, out s10_863, out s11_864, out t4_865), &g_t230887E4, a3_380, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_866, out a0_867, out a1_404, out a2_868, out a3_406, out a4_869, out a5_870, out a7_871, out s2_872, out s3_873, out s4_874, out s5_875, out s6_876, out s7_877, out s8_878, out s9_879, out s10_880, out s11_881, out t4_882);
		word32 s0_423 = a1_404->dw001C;
		word32 * s3_439;
		word32 s1_883;
		word32 a0_884;
		word32 a1_885;
		word32 a2_886;
		word32 a4_887;
		word32 a5_888;
		word32 a7_889;
		word32 s4_890;
		word32 s7_891;
		word32 s8_892;
		word32 s9_893;
		word32 s10_894;
		word32 s11_895;
		word32 t4_896;
		ra = printf(ra_409, &g_t23088800, a3_406, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_883, out a0_884, out a1_885, out a2_886, out a3_30, out a4_887, out a5_888, out a7_889, out s2_36, out s3_439, out s4_890, out s5, out s6, out s7_891, out s8_892, out s9_893, out s10_894, out s11_895, out t4_896);
		word32 a0_897;
		word32 a1_898;
		word32 a2_899;
		word32 a4_900;
		word32 a5_901;
		word32 s4_902;
		word32 s8_903;
		puts(0x23088814, out a0_897, out a1_898, out a2_899, out a4_900, out a5_901, out s4_902, out s8_903);
		*s3_439 = s0_423;
		a0_42 = 0x00;
	}
	else
		a0_42 = ~0x00;
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	a0Out = a0_42;
	a3Out = a3_30;
	s2Out = s2_36;
	s5Out = s5;
	s6Out = s6;
	return ra;
}

