pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 230552CA: Register int32 bloop_handler_register(Register word32 a0, Register int32 a1, Register uint32 a2)
// Called from:
//      looprt_start
//      cmd_looprt_test
//      loopset_led_hook_on_looprt
int32 bloop_handler_register(word32 a0, int32 a1, uint32 a2)
{
	int32 a5_10 = 0x1F;
	if (a2 > 0x1F)
		return a5_10;
	struct Eq_280096 * a2_8 = (a2 << 2) + a0;
	a5_10 = a2_8->dw0410;
	if (a5_10 != 0x00)
		return a5_10;
	a2_8->dw0410 = a1;
	return a5_10;
}

// 230552E8: Register word32 bloop_timer_init(Register Eq_2 ra, Register Eq_2 a0, Register word32 a1)
// Called from:
//      cmd_looprt_test_schedule_evt2
//      loopset_led_trigger
word32 bloop_timer_init(Eq_2 ra, Eq_2 a0, word32 a1)
{
	word32 t1_39;
	word32 a0_40;
	word32 a1_41;
	word32 a2_42;
	word32 a3_43;
	word32 a4_44;
	word32 a5_45;
	memset(ra, a0, 0x00, 36, out t1_39, out a0_40, out a1_41, out a2_42, out a3_43, out a4_44, out a5_45);
	*a0 = a0;
	*((word32) a0 + 4) = a0;
	((word32) a0 + 8)->u1 = (byte) ((word32) (a1 != 0x00) << 1);
	return a1;
}

// 23055316: Register word32 bloop_timer_configure(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register (ptr32 Eq_183664) a4, Stack Eq_2 dwArgB4)
// Called from:
//      cmd_looprt_test_schedule_evt2
//      loopset_led_trigger
word32 bloop_timer_configure(Eq_2 a0, Eq_2 a1, Eq_2 a3, struct Eq_183664 * a4, Eq_2 dwArgB4)
{
	struct Eq_280143 * a5_21;
	Eq_2 a0_20 = xTaskGetTickCount(out a5_21);
	*((word32) a0_20 + 0x0C) = a0;
	Mem29[a0_20 + a1 + 16:word32] = a0;
	*((word32) dwArgB4 + 28) = a0;
	*((word32) a3 + 32) = a0;
	a4->t0014 = a0;
	a5_21->t0018 = a0;
	return dwArgE4;
}

// 2305534C: void bloop_timer_repeat_enable(Register Eq_2 a0)
// Called from:
//      loopset_led_trigger
void bloop_timer_repeat_enable(Eq_2 a0)
{
	((word32) a0 + 8)->u1 = (byte) ((word32) *((word32) a0 + 8) | 1);
}

// 2305535A: Register Eq_2 bloop_timer_repeat_reconfigure(Register Eq_2 s0, Register Eq_2 a0)
// Called from:
//      bloop_run
Eq_2 bloop_timer_repeat_reconfigure(Eq_2 s0, Eq_2 a0)
{
	ptr32 s0_14 = s0 - *((word32) (*((word32) s0 + 16)) + 0x0C);
	word32 a5_29;
	Eq_2 a0_15 = xTaskGetTickCount(out a5_29);
	(word32) a0_15 + s0_14 + 16 = (word32) a0;
	*((word32) a0_15 + 0x0C) = a0;
	return a0;
}

// 2305537E: Register Eq_2 bloop_timer_register(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      looprt_timer_register
//      cmd_looprt_test_schedule_evt2
//      bloop_run
Eq_2 bloop_timer_register(Eq_2 a0, Eq_2 a1, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a2_5 = *((word32) a0 + 0x0494);
	if ((word32) a0 + 1168 != a2_5)
	{
		Eq_2 a4_10 = a2_5;
		Eq_2 a5_16 = 0x00;
		while ((word32) a0 + 1168 != a4_10)
		{
			if (*((word32) a1 + 16) - *((word32) a4_10 + 16) <= 0x00)
			{
				if (a5_16 != 0x00)
					break;
				*((word32) a2_5 + 4) = a1;
				*((word32) a0 + 1168) = a1;
				*((word32) a0 + 0x0494) = a1;
				*a1 = a2_5;
				a3Out.u0 = <invalid>;
				a4Out = a4_10;
				a5Out = a5_16;
				return <invalid>;
			}
			a5_16 = a4_10;
			a4_10 = *((word32) a4_10 + 4);
		}
		Eq_2 a5_27 = *((word32) a4_10 + 4);
		*a5_27 = a1;
		*((word32) a4_10 + 4) = a1;
		*((word32) a1 + 4) = a5_27;
		*a1 = a4_10;
		a3Out.u0 = <invalid>;
		a4Out = a4_10;
		a5Out = a5_27;
		return <invalid>;
	}
	else
	{
		*((word32) a0 + 0x0494) = a1;
		*((word32) a0 + 1168) = a1;
		*((word32) a0 + 0x0494) = a1;
		*((word32) a0 + 1168) = a1;
		a3Out.u0 = <invalid>;
		a4Out = a4;
		a5Out = a5;
		return <invalid>;
	}
}

// 230553D0: Register word32 bloop_wait_startup(Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out Eq_2 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      looprt_start
//      cmd_looprt_test
word32 bloop_wait_startup(Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg0128, Eq_2 dwArg0168, union Eq_2 & a3Out, ptr32 & s2Out, ptr32 & s3Out)
{
	while (a5 == 0x00)
	{
		word32 a0_77;
		word32 a1_78;
		word32 s4_79;
		word32 s8_80;
		vTaskDelay(0x01, a2, a3, a4, a5, mstatus, dwArg14, dwArg18, dwArg0128, dwArg0168, out s1, out a0_77, out a1_78, out a2, out a3, out a4, out a5, out s2, out s3, out s4_79, out s8_80);
	}
	a3Out = a3;
	s2Out = s2;
	s3Out = s3;
	return s1;
}

// 230553EC: Register Eq_2 bloop_evt_set_async(Register Eq_2 ra, Register Eq_2 a0, Register up32 a1, Register ui32 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0128, Register out ptr32 s1Out, Register out ptr32 mstatusOut)
// Called from:
//      loopset_led_trigger
Eq_2 bloop_evt_set_async(Eq_2 ra, Eq_2 a0, up32 a1, ui32 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgE4, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0128, ptr32 & s1Out, ptr32 & mstatusOut)
{
	if (a1 <= 0x1F)
	{
		struct Eq_280293 * a5_17;
		vTaskEnterCritical(a4, mstatus, out a5_17);
		Eq_2 a3_22 = 0x01 << a1;
		(a3_22 | 0x01)->t0004 = *(union Eq_2 *) 0x05;
		(a5_17 | a2)->dw0010 = a5_17->dw0010;
		Eq_2 a4_32;
		word32 a5_105;
		vTaskExitCritical(a3_22, mstatus, out a4_32, out a5_105);
		ptr32 s1_46;
		ptr32 mstatus_54;
		word32 s0_125;
		word32 a0_126;
		word32 a1_127;
		word32 a2_128;
		word32 a3_129;
		word32 a4_130;
		word32 a5_131;
		word32 s2_132;
		word32 s3_133;
		word32 s4_134;
		Eq_2 ra_55 = xTaskGenericNotify(ra, a0, 0x00, 0x02, 0x00, a4_32, mstatus, dwArg14, dwArg38, dwArg58, dwArgE4, dwArg0100, dwArg0104, dwArg0128, out s0_125, out s1_46, out a0_126, out a1_127, out a2_128, out a3_129, out a4_130, out a5_131, out s2_132, out s3_133, out s4_134, out mstatus_54);
		s1Out = s1_46;
		mstatusOut = mstatus_54;
		return ra_55;
	}
	else
	{
		word32 s1_106;
		word32 a0_107;
		word32 a1_108;
		word32 a2_109;
		word32 a3_110;
		word32 a4_111;
		word32 a5_112;
		word32 a7_113;
		word32 s2_114;
		word32 s3_115;
		word32 s4_116;
		word32 s5_117;
		word32 s6_118;
		word32 s7_119;
		word32 s8_120;
		word32 s9_121;
		word32 s10_122;
		word32 s11_123;
		word32 t4_124;
		printf(ra, &g_t23086048, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_106, out a0_107, out a1_108, out a2_109, out a3_110, out a4_111, out a5_112, out a7_113, out s2_114, out s3_115, out s4_116, out s5_117, out s6_118, out s7_119, out s8_120, out s9_121, out s10_122, out s11_123, out t4_124);
		while (true)
			;
	}
}

