pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305544C: Register Eq_197168 bloop_evt_set_sync(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out (ptr32 Eq_280402) a1Out, Register out Eq_280403 a3Out, Register out (ptr32 Eq_2) a4Out, Register out Eq_280405 a5Out)
// Called from:
//      bloop_run
Eq_197168 bloop_evt_set_sync(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, struct Eq_280402 & a1Out, union Eq_280403 & a3Out, union Eq_2 & a4Out, union Eq_280405 & a5Out)
{
	if (a1 <= 0x1F)
	{
		Eq_280403 a3_6 = 0x01 << a1;
		(a3_6 | 0x01)->t0008 = *(union Eq_2 *) 0x09;
		Eq_197168 a0_12 = *(union Eq_197168 *) 0x2F;
		(a2 | 0x1F)->t0010 = a0_12;
		a1Out = a1 << 2;
		a3Out = a3_6;
		a4Out = a3_6 | 0x01;
		a5Out = a2 | 0x1F;
		return a0_12;
	}
	else
	{
		word32 s1_58;
		word32 a0_59;
		word32 a1_60;
		word32 a2_61;
		word32 a3_62;
		word32 a4_63;
		word32 a5_64;
		word32 a7_65;
		word32 s2_66;
		word32 s3_67;
		word32 s4_68;
		word32 s5_69;
		word32 s6_70;
		word32 s7_71;
		word32 s8_72;
		word32 s9_73;
		word32 s10_74;
		word32 s11_75;
		word32 t4_76;
		printf(ra, &g_t23086048, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_58, out a0_59, out a1_60, out a2_61, out a3_62, out a4_63, out a5_64, out a7_65, out s2_66, out s3_67, out s4_68, out s5_69, out s6_70, out s7_71, out s8_72, out s9_73, out s10_74, out s11_75, out t4_76);
		while (true)
			;
	}
}

// 23055488: Register word32 bloop_evt_unset_sync(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
// Called from:
//      bloop_run
word32 bloop_evt_unset_sync(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	if (a1 <= 0x1F)
	{
		word32 a0_8 = *((word32) a1 + 8);
		(~(0x01 << a1) & a1)->dw0008 = a0_8;
		return a0_8;
	}
	else
	{
		word32 s1_50;
		word32 a0_51;
		word32 a1_52;
		word32 a2_53;
		word32 a3_54;
		word32 a4_55;
		word32 a5_56;
		word32 a7_57;
		word32 s2_58;
		word32 s3_59;
		word32 s4_60;
		word32 s5_61;
		word32 s6_62;
		word32 s7_63;
		word32 s8_64;
		word32 s9_65;
		word32 s10_66;
		word32 s11_67;
		word32 t4_68;
		printf(ra, &g_t23086048, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_50, out a0_51, out a1_52, out a2_53, out a3_54, out a4_55, out a5_56, out a7_57, out s2_58, out s3_59, out s4_60, out s5_61, out s6_62, out s7_63, out s8_64, out s9_65, out s10_66, out s11_67, out t4_68);
		while (true)
			;
	}
}

// 230554BE: void bloop_run(Register Eq_2 ra, Register Eq_2 s1, Register word32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg6C, Stack word32 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148)
// Called from:
//      proc_entry_looprt
void bloop_run(Eq_2 ra, Eq_2 s1, word32 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg5C, Eq_2 dwArg6C, word32 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0148)
{
	word32 a5_1000;
	Eq_2 a0_101 = xTaskGetCurrentTaskHandle(out a5_1000);
	*a0_101 = a0;
	word32 s0_15 = a0;
	struct Eq_280545 * s2_150 = (struct Eq_280545 *) 0x42021000;
	struct Eq_280547 * s3_153 = (struct Eq_280547 *) 0x42021000;
	struct Eq_280549 * s4_155 = &g_t4200E000;
	word32 s5_165 = 0x23089000;
	do
	{
		Eq_2 s7_40 = s0_15 + 1168;
		while (true)
		{
			ui32 a5_43;
			Eq_2 a4_44 = vTaskEnterCritical(a4, mstatus, out a5_43);
			struct Eq_280586 * s0_47 = *((word32) a4_44 + 4);
			s0_47->dw0004 = 0x00;
			(a5_43 | a4_44)->ptr0008 = s0_47;
			struct Eq_280598 * a5_52;
			Eq_2 a4_104;
			a3 = vTaskExitCritical(a3, mstatus, out a4_104, out a5_52);
			Eq_2 s0_203 = a5_52->t0008;
			if (a5_52 != null)
				break;
			Eq_2 a5_487 = *((word32) s0_203 + 0x0494);
			a1.u0 = ~0x00;
			if (a5_487 != s7_40)
			{
				a0_101 = xTaskGetTickCount(out a5_487);
				a1 = s1 - a0_101;
				if (a1 <= 0x00)
					break;
			}
			a0_101.u0 = 0x01;
			s1 = ulTaskNotifyTake((struct Eq_62092 *) 0x01, a1, a2, a3, a4_104, a5_487, mstatus, s6, dwArgD8, out a2, out a3, out a4, out s2_150, out s3_153);
		}
		if (*((word32) s0_203 + 0x0494) != s7_40)
		{
			Eq_2 a5_121;
			Eq_2 a0_68 = xTaskGetTickCount(out a5_121);
			Eq_2 s1_126 = *((word32) s0_203 + 0x0494);
			Eq_2 s6_123 = 0x00;
			if (s1_126 != 0x00)
				s6_123 = *((word32) s1_126 + 4);
			Eq_2 s8_139 = (word32) s0_203 + 1176;
			a0_101 = a0_68;
			while (s1_126 != s7_40)
			{
				a5_121 = a0_68 - a5_121;
				if (a5_121 < 0x00)
					break;
				Eq_2 a5_105;
				a0_101 = bloop_evt_set_sync(ra, a1, a2, a3, s6, dwArg10, dwArg14, dwArg38, dwArg5C, out a1, out a3, out a4_104, out a5_105);
				if (a5_105 != 0x00)
					a5_105();
				Eq_2 s1_110 = *a4_104;
				*((word32) a5_105 + 4) = a4_104;
				*a4_104 = a5_105;
				Eq_2 a5_114 = *((word32) s0_203 + 1180);
				*s1_110 = (word32) s0_203 + 1176;
				*((word32) a5_114 + 4) = s1_110;
				*((word32) s0_203 + 1180) = s1_110;
				*s1_110 = a5_114;
				a5_121.u0 = 0x00;
				if (s6_123 != 0x00)
					a5_121 = *((word32) s6_123 + 4);
				s1_126 = s6_123;
				s6_123 = a5_121;
			}
			Eq_2 s1_131 = *((word32) s0_203 + 1180);
			Eq_2 s6_132 = 0x00;
			if (s1_131 != 0x00)
				s6_132 = *((word32) s1_131 + 4);
			Eq_2 s7_134 = 0x01;
			word32 s10_136 = 0x23089000;
			word32 s11_137 = 0x23089000;
			while (s1_131 != s8_139)
			{
				Eq_2 s1_144 = *((word32) a5_121 + 4);
				*((word32) a5_121 + 4) = a4_104;
				*a4_104 = a5_121;
				ui32 a5_147 = (word32) *((word32) s1_144 + 8);
				a4_104 = a5_147 & 2;
				if ((a5_147 & 2) != 0x00)
				{
					Eq_2 a5_218 = (word32) s2_150->bFFFFFD64;
					if (s7_134 >= a5_218)
					{
						a5_218 = (word32) s3_153->bFFFFFD65;
						if (s7_134 >= a5_218)
						{
							if (s4_155->dwFFFFFE84 != 0x00)
							{
								word32 a5_1056;
								xTaskGetTickCountFromISR(out a5_1056);
							}
							else
							{
								word32 a5_1055;
								xTaskGetTickCount(out a5_1055);
							}
							word32 s9_1062;
							word32 a1_1058;
							word32 s4_1061;
							word32 a3_1059;
							word32 a4_1060;
							word32 a0_1057;
							ra = bl_printk(ra, s11_137 + -1884, s5_165 + -0x0784, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_144, out a0_1057, out a1_1058, out a2, out a3_1059, out a4_1060, out a5_218, out s2_150, out s3_153, out s4_1061, out s5_165, out s6_132, out s7_134, out s8_139, out s9_1062, out s10_136, out s11_137);
						}
					}
					word32 t3_1054;
					word32 a6_1053;
					word32 s1_1051;
					word32 a5_1052;
					vPortFree(s1_144, a2, a5_218, mstatus, dwArg0108, dwArg0148, out s0_203, out s1_1051, out a0_101, out a1, out a2, out a3, out a4_104, out a5_1052, out a6_1053, out s4_155, out t3_1054);
				}
				else if ((a5_147 & 0x01) != 0x00)
				{
					if (s7_134 >= (word32) s2_150->bFFFFFD64 && s7_134 >= (word32) s3_153->bFFFFFD65)
					{
						if (s4_155->dwFFFFFE84 != 0x00)
						{
							word32 a5_1065;
							xTaskGetTickCountFromISR(out a5_1065);
						}
						else
						{
							word32 a5_1064;
							xTaskGetTickCount(out a5_1064);
						}
						word32 a3_1069;
						word32 a4_1070;
						word32 a5_1071;
						word32 s9_1072;
						word32 a0_1066;
						word32 a1_1067;
						word32 a2_1068;
						ra = bl_printk(ra, s10_136 + -0x073C, s5_165 + -0x0784, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_144, out a0_1066, out a1_1067, out a2_1068, out a3_1069, out a4_1070, out a5_1071, out s2_150, out s3_153, out s4_155, out s5_165, out s6_132, out s7_134, out s8_139, out s9_1072, out s10_136, out s11_137);
					}
					Eq_2 s1_208 = bloop_timer_repeat_reconfigure(s0_203, s1_144);
					a1 = s1_208;
					a0_101 = s0_203;
					word32 a5_1063;
					a2 = bloop_timer_register(s0_203, s1_208, out a3, out a4_104, out a5_1063);
				}
				a5_121.u0 = 0x00;
				if (s6_132 != 0x00)
					a5_121 = *((word32) s6_132 + 4);
				s1_131 = s6_132;
				s6_132 = a5_121;
			}
		}
		word32 a4_1001;
		Eq_2 a0_308 = __clzsi2(a0_101, out a4_1001);
		s0_15 = (word32) *((word32) a0_308 + 0x0C);
		s1 = a0_308;
		Eq_2 a0_313 = __clzsi2(a0_308, out a4);
		if (a0_313 >= a0_308)
		{
			s1 = 0x1F - a0_308;
			if (s1 != ~0x00)
			{
				struct Eq_280694 * s6_320 = (s1 << 0x02) + s0_15;
				if (s6_320->dw0410 != 0x00)
				{
					word32 a5_1022;
					vTaskEnterCritical(a4, mstatus, out a5_1022);
					int32 a4_330 = s6_320->dw0010;
					int32 a5_331 = s6_320->dw0090;
					s6_320->dw0010 = 0x00;
					s6_320->dw0090 = a5_331 | a4_330;
					word32 a4_1023;
					word32 a5_1024;
					vTaskExitCritical(a3, mstatus, out a4_1023, out a5_1024);
					a5_350();
					<anonymous> * a5_350;
					word32 a3_1027;
					word32 a4_1028;
					word32 a2_1026;
					word32 a1_1025;
					Eq_2 a0_345 = bl_timer_now_us(out a1_1025, out a2_1026, out a3_1027, out a4_1028, out a5_350);
					word32 a5_1031;
					word32 a4_1030;
					word32 a1_1029;
					Eq_2 a0_377 = bl_timer_now_us(out a1_1029, out a2, out a3, out a4_1030, out a5_1031);
					struct Eq_280753 * a5_390 = (s1 << 0x04) + s0_15;
					int32 a4_391 = a5_390->dw0218;
					Eq_280761 a0_392 = a0_377 - a0_345;
					a5_390->t0214 = a0_392;
					a5_390->dw0218 = (word32) a0_392.u1 + a4_391;
					if (a5_390->t0210 < a0_392)
						a5_390->t0210 = a0_392;
					int32 a4_400 = a5_390->dw021C;
					a5_390->dw021C = a4_400 + 0x01;
					a1 = s1;
					a4 = a4_400 + 0x01;
					a0_101 = bloop_evt_unset_sync(ra, s1, a3, s6, dwArg10, dwArg14, dwArg38, dwArg5C);
					continue;
				}
				else
				{
					word32 a7_1039;
					word32 a2_1035;
					word32 s5_1043;
					word32 s9_1047;
					word32 t4_1050;
					word32 s10_1048;
					word32 s11_1049;
					word32 s8_1046;
					word32 s6_1044;
					word32 s7_1045;
					word32 s4_1042;
					word32 s2_1040;
					word32 s3_1041;
					word32 a5_1038;
					word32 a3_1036;
					word32 a4_1037;
					word32 a1_1034;
					word32 s1_1032;
					word32 a0_1033;
					printf(ra, &g_t23086048, a3, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_1032, out a0_1033, out a1_1034, out a2_1035, out a3_1036, out a4_1037, out a5_1038, out a7_1039, out s2_1040, out s3_1041, out s4_1042, out s5_1043, out s6_1044, out s7_1045, out s8_1046, out s9_1047, out s10_1048, out s11_1049, out t4_1050);
					while (true)
						;
				}
			}
		}
		a0_101 = 0x1F - a0_313;
		if (a0_101 == ~0x00)
			continue;
		word32 a5_1002;
		a0_101 = utils_list_pop_front(a4, (struct Eq_108479 *) ~0x00, out a5_1002);
	} while (a0_101 != 0x00);
	word32 s10_1019;
	word32 s11_1020;
	word32 t4_1021;
	word32 s1_1003;
	word32 a0_1004;
	word32 s9_1018;
	word32 a1_1005;
	word32 s3_1012;
	word32 s4_1013;
	word32 s5_1014;
	word32 s8_1017;
	word32 s6_1015;
	word32 s7_1016;
	word32 a2_1006;
	word32 a3_1007;
	word32 a7_1010;
	word32 s2_1011;
	word32 a4_1008;
	word32 a5_1009;
	printf(ra, &g_t23086048, a3, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_1003, out a0_1004, out a1_1005, out a2_1006, out a3_1007, out a4_1008, out a5_1009, out a7_1010, out s2_1011, out s3_1012, out s4_1013, out s5_1014, out s6_1015, out s7_1016, out s8_1017, out s9_1018, out s10_1019, out s11_1020, out t4_1021);
	while (true)
		;
}

