pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305574A: Register Eq_2 bloop_status_dump(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s5, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg010C, Register out (ptr32 Eq_2) s0Out, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 s5Out)
// Called from:
//      cmd_looprt_test_status
//      loop_evt_entity_sys_evt
Eq_2 bloop_status_dump(Eq_2 ra, Eq_2 a3, Eq_2 s5, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg6C, Eq_2 dwArg010C, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a3Out, ptr32 & s5Out)
{
	word32 a5_516;
	word32 a4_515;
	word32 a2_514;
	word32 a1_513;
	word32 a0_512;
	word32 s4_517;
	word32 s8_518;
	puts(0x230888F0, out a0_512, out a1_513, out a2_514, out a4_515, out a5_516, out s4_517, out s8_518);
	struct Eq_281082 * a1_51;
	Eq_2 a3_53;
	word32 s10_533;
	word32 t4_535;
	word32 s11_534;
	word32 s6_529;
	word32 s8_531;
	word32 s7_530;
	word32 s9_532;
	word32 s2_525;
	word32 s4_527;
	word32 s3_526;
	word32 s5_528;
	word32 a2_521;
	word32 a5_523;
	word32 a4_522;
	word32 a7_524;
	word32 s1_519;
	word32 a0_520;
	Eq_2 ra_56 = printf(ra, &g_t2308890C, a3, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_519, out a0_520, out a1_51, out a2_521, out a3_53, out a4_522, out a5_523, out a7_524, out s2_525, out s3_526, out s4_527, out s5_528, out s6_529, out s7_530, out s8_531, out s9_532, out s10_533, out s11_534, out t4_535);
	struct Eq_281126 * s0_70 = a1_51->ptr000C;
	word32 t4_553;
	word32 s8_549;
	word32 s10_551;
	word32 s9_550;
	word32 s11_552;
	word32 s4_545;
	word32 s6_547;
	word32 s5_546;
	word32 s7_548;
	word32 a5_541;
	word32 s2_543;
	word32 a7_542;
	word32 s3_544;
	word32 a0_537;
	word32 a2_539;
	word32 a1_538;
	word32 a4_540;
	word32 s1_536;
	Eq_2 a3_137;
	Eq_2 ra_130 = printf(ra_56, &g_t23088920, a3_53, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_536, out a0_537, out a1_538, out a2_539, out a3_137, out a4_540, out a5_541, out a7_542, out s2_543, out s3_544, out s4_545, out s5_546, out s6_547, out s7_548, out s8_549, out s9_550, out s10_551, out s11_552, out t4_553);
	word32 a5_554;
	xTaskGetTickCount(out a5_554);
	word32 a4_557;
	word32 s8_559;
	word32 a5_558;
	word32 a0_555;
	word32 a1_556;
	word32 a2_101;
	word32 s4_107;
	puts(0x23088934, out a0_555, out a1_556, out a2_101, out a4_557, out a5_558, out s4_107, out s8_559);
	Eq_281193 s1_110 = s0_70->t0494;
	Eq_281193 s3_111 = (char *) s0_70 + 1168;
	word32 s5_113 = 0x23089000;
	while (s3_111 != s1_110)
	{
		struct Eq_281202 * s1_141;
		word32 t4_572;
		word32 s11_571;
		word32 s10_570;
		word32 s9_569;
		word32 s2_565;
		word32 s7_567;
		word32 s6_566;
		word32 s8_568;
		word32 a1_561;
		word32 a5_563;
		word32 a4_562;
		word32 a7_564;
		word32 a0_560;
		ra_130 = printf(ra_130, s5_113 + -1716, s4_107 - a2_101, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_141, out a0_560, out a1_561, out a2_101, out a3_137, out a4_562, out a5_563, out a7_564, out s2_565, out s3_111, out s4_107, out s5_113, out s6_566, out s7_567, out s8_568, out s9_569, out s10_570, out s11_571, out t4_572);
		s1_110 = s1_141->t0004;
	}
	word32 a1_574;
	word32 a0_573;
	word32 a2_575;
	word32 a4_576;
	word32 a5_577;
	word32 a7_578;
	word32 s2_579;
	word32 s3_580;
	word32 s4_581;
	word32 s5_582;
	word32 s6_583;
	word32 s7_584;
	word32 s8_585;
	word32 s9_586;
	word32 s10_587;
	word32 s11_588;
	word32 t4_589;
	struct Eq_281260 * s1_172;
	Eq_2 a3_168;
	Eq_2 ra_171 = printf(ra_130, &g_t23088998, a3_137, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_172, out a0_573, out a1_574, out a2_575, out a3_168, out a4_576, out a5_577, out a7_578, out s2_579, out s3_580, out s4_581, out s5_582, out s6_583, out s7_584, out s8_585, out s9_586, out s10_587, out s11_588, out t4_589);
	ptr32 s5_188 = 0x23089000;
	do
	{
		s1_172->dw0400 == 0x00;
		word32 s6_229;
		word32 a0_590;
		word32 a1_591;
		word32 a2_592;
		word32 a4_593;
		word32 a5_594;
		word32 a7_595;
		word32 s3_596;
		word32 s4_597;
		word32 s7_598;
		word32 s8_599;
		word32 s9_600;
		word32 s10_601;
		word32 s11_602;
		word32 t4_603;
		word32 s2_225;
		struct Eq_281303 * s1_222;
		ra_171 = printf(ra_171, s5_188 + -0x0658, a3_168, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_222, out a0_590, out a1_591, out a2_592, out a3_168, out a4_593, out a5_594, out a7_595, out s2_225, out s3_596, out s4_597, out s5_188, out s6_229, out s7_598, out s8_599, out s9_600, out s10_601, out s11_602, out t4_603);
		if (s1_222->dw0400 != 0x00)
		{
			Eq_2 a3_246;
			word32 s7_258;
			Eq_2 a3_270;
			word32 s8_283;
			Eq_2 a3_294;
			word32 s9_308;
			Eq_2 a3_319;
			word32 s10_324;
			word32 s1_604;
			word32 a0_605;
			word32 a1_606;
			word32 a2_607;
			word32 a4_608;
			word32 a5_609;
			word32 a7_610;
			word32 s2_611;
			word32 s3_612;
			word32 s4_613;
			word32 s5_614;
			word32 s6_615;
			word32 s8_616;
			word32 s9_617;
			word32 s10_618;
			word32 s11_619;
			word32 t4_620;
			word32 s1_621;
			word32 a0_622;
			word32 a1_623;
			word32 a2_624;
			word32 a4_625;
			word32 a5_626;
			word32 a7_627;
			word32 s2_628;
			word32 s3_629;
			word32 s4_630;
			word32 s5_631;
			word32 s6_632;
			word32 s7_633;
			word32 s9_634;
			word32 s10_635;
			word32 s11_636;
			word32 t4_637;
			word32 s1_638;
			word32 a0_639;
			word32 a1_640;
			word32 a2_641;
			word32 a4_642;
			word32 a5_643;
			word32 a7_644;
			word32 s2_645;
			word32 s3_646;
			word32 s4_647;
			word32 s5_648;
			word32 s6_649;
			word32 s7_650;
			word32 s8_651;
			word32 s10_652;
			word32 s11_653;
			word32 t4_654;
			word32 s1_655;
			word32 a0_656;
			word32 a1_657;
			word32 a2_658;
			word32 a4_659;
			word32 a5_660;
			word32 a7_661;
			word32 s2_662;
			word32 s3_663;
			word32 s4_664;
			word32 s5_665;
			word32 s6_666;
			word32 s7_667;
			word32 s8_668;
			word32 s9_669;
			word32 s11_670;
			word32 t4_671;
			word32 a0_672;
			word32 a1_673;
			word32 a2_674;
			word32 a4_675;
			word32 a5_676;
			word32 a7_677;
			word32 s3_678;
			word32 s4_679;
			word32 s6_680;
			word32 s7_681;
			word32 s8_682;
			word32 s9_683;
			word32 s10_684;
			word32 s11_685;
			word32 t4_686;
			ra_171 = printf(printf(printf(printf(printf(ra_171, s6_229 + -1600, a3_168, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_604, out a0_605, out a1_606, out a2_607, out a3_246, out a4_608, out a5_609, out a7_610, out s2_611, out s3_612, out s4_613, out s5_614, out s6_615, out s7_258, out s8_616, out s9_617, out s10_618, out s11_619, out t4_620), s7_258 + -0x0628, a3_246, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_621, out a0_622, out a1_623, out a2_624, out a3_270, out a4_625, out a5_626, out a7_627, out s2_628, out s3_629, out s4_630, out s5_631, out s6_632, out s7_633, out s8_283, out s9_634, out s10_635, out s11_636, out t4_637), s8_283 + -1556, a3_270, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_638, out a0_639, out a1_640, out a2_641, out a3_294, out a4_642, out a5_643, out a7_644, out s2_645, out s3_646, out s4_647, out s5_648, out s6_649, out s7_650, out s8_651, out s9_308, out s10_652, out s11_653, out t4_654), s9_308 + -0x0600, a3_294, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_655, out a0_656, out a1_657, out a2_658, out a3_319, out a4_659, out a5_660, out a7_661, out s2_662, out s3_663, out s4_664, out s5_665, out s6_666, out s7_667, out s8_668, out s9_669, out s10_324, out s11_670, out t4_671), s10_324 + -0x05E4, a3_319, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_222, out a0_672, out a1_673, out a2_674, out a3_168, out a4_675, out a5_676, out a7_677, out s2_225, out s3_678, out s4_679, out s5_188, out s6_680, out s7_681, out s8_682, out s9_683, out s10_684, out s11_685, out t4_686);
		}
		s1_172 = (struct Eq_281260 *) ((char *) s1_222 - 4);
	} while (s2_225 != 0x00);
	0x00 = (uint16) dwArg010C;
	s0Out = dwArgCC;
	s1Out = dwLoc4C;
	a3Out = s2;
	s5Out = s5_188;
	return dwLoc08;
}

