pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 230558A2: void loop_evt_entity_sys_handler(Register Eq_2 ra, Register (ptr32 Eq_281554) a5, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void loop_evt_entity_sys_handler(Eq_2 ra, struct Eq_281554 * a5, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	word32 s1_50;
	word32 a0_51;
	word32 a1_52;
	word32 a2_53;
	word32 a3_54;
	word32 a4_55;
	word32 a5_56;
	word32 a7_57;
	word32 s2_58;
	word32 s3_59;
	word32 s4_60;
	word32 s5_61;
	word32 s6_62;
	word32 s7_63;
	word32 s8_64;
	word32 s9_65;
	word32 s10_66;
	word32 s11_67;
	word32 t4_68;
	printf(ra, &g_t23088AB0, (word32) a5->ptr0008->b0006, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_50, out a0_51, out a1_52, out a2_53, out a3_54, out a4_55, out a5_56, out a7_57, out s2_58, out s3_59, out s4_60, out s5_61, out s6_62, out s7_63, out s8_64, out s9_65, out s10_66, out s11_67, out t4_68);
}

// 230558D2: void loop_evt_entity_sys_evt(Register Eq_2 ra, Register (ptr32 Eq_2) s0, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack word32 dwArg38, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgFC)
void loop_evt_entity_sys_evt(Eq_2 ra, union Eq_2 * s0, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, word32 dwArg38, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgFC)
{
	word32 a0_182;
	word32 a1_183;
	word32 a2_184;
	word32 a4_185;
	word32 a5_186;
	word32 a7_187;
	word32 s2_188;
	word32 s3_189;
	word32 s4_190;
	word32 s6_191;
	word32 s7_192;
	word32 s8_193;
	word32 s9_194;
	word32 s10_195;
	word32 s11_196;
	word32 t4_197;
	Eq_2 a3_26;
	Eq_2 s5_36;
	word32 * s1_109;
	Eq_2 ra_29 = printf(ra, &g_t23088A5C, *s0, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_109, out a0_182, out a1_183, out a2_184, out a3_26, out a4_185, out a5_186, out a7_187, out s2_188, out s3_189, out s4_190, out s5_36, out s6_191, out s7_192, out s8_193, out s9_194, out s10_195, out s11_196, out t4_197);
	do
	{
		if ((s0 & 1) == 0x00)
		{
			if (s0 == null)
				break;
			word32 s1_198;
			word32 a0_199;
			word32 a1_200;
			word32 a2_201;
			word32 a3_202;
			word32 a4_203;
			word32 a5_204;
			word32 a7_205;
			word32 s2_206;
			word32 s3_207;
			word32 s4_208;
			word32 s5_209;
			word32 s6_210;
			word32 s7_211;
			word32 s8_212;
			word32 s9_213;
			word32 s10_214;
			word32 s11_215;
			word32 t4_216;
			printf(ra_29, &g_t23086048, a3_26, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_198, out a0_199, out a1_200, out a2_201, out a3_202, out a4_203, out a5_204, out a7_205, out s2_206, out s3_207, out s4_208, out s5_209, out s6_210, out s7_211, out s8_212, out s9_213, out s10_214, out s11_215, out t4_216);
			while (true)
				;
		}
		ra_29 = bloop_status_dump(ra_29, a3_26, s5_36, dwArg10, dwArg14, dwArg5C, dwArgFC, out s0, out s1_109, out a3_26, out s5_36);
	} while (s0 != null);
	*s1_109 = 0x00;
	0x00 = dwArg38;
}

// 23055930: void misaligned_load_trap(Register Eq_2 gp, Register (ptr32 word32) a0, Register (ptr32 Eq_163935) a2, Register (ptr32 (ptr32 Eq_163935)) a5, Register ptr32 mstatus, Register ptr32 mcause, Register ptr32 mtval)
// Called from:
//      exception_entry
void misaligned_load_trap(Eq_2 gp, word32 * a0, struct Eq_163935 * a2, struct Eq_163935 ** a5, ptr32 mstatus, ptr32 mcause, ptr32 mtval)
{
	__csrrs(mstatus, 0x00);
	if ((a2 & 2) == 0x00)
	{
		a2 = (struct Eq_163935 *) *a5;
		if ((a5 & 0x03) != 0x03)
			a5 = (word32) (word16) a5;
	}
	else
	{
		a5 = (word32) a2->w0000;
		if ((a5 & 0x03) == 0x03)
			a5 = (struct Eq_163935 **) ((char *) a5 + ((word32) a2->w0002 << 16));
	}
	__csrrw(mstatus, 0x00);
	struct Eq_163935 ** t6_121 = a5;
	word32 t3_26 = 0x04;
	if ((a5 & 3) != 0x03)
		t3_26 = 0x02;
	word32 a7_147;
	word32 t1_119;
	word32 a6_48;
	word32 t3_31 = a2 + t3_26 / 4;
	struct Eq_84 * t5_38 = __csrrs(mtval, gp);
	ui32 a4_43 = a5 & 0x0700007F;
	if (a4_43 != 0x02000003)
	{
		if (a4_43 == 0x02000007)
		{
l230559CE:
			a6_48 = 0x04;
			t1_119 = 0x01;
			a7_147 = 0x00;
			goto l230559D4;
		}
		if (a4_43 == 0x01000003)
		{
			a6_48 = 0x02;
			t1_119 = 0x00;
			a7_147 = 0x10;
			goto l230559D4;
		}
		if (a4_43 == 0x05000003)
		{
			a6_48 = 0x02;
			t1_119 = 0x00;
			a7_147 = 0x00;
			goto l230559D4;
		}
		ui32 a4_58 = a5 & 0x0E000003;
		if (a4_58 == 0x04000000)
		{
			t6_121 = (a5 >> 2 & 0x07) + 0x08 << 0x07;
			a6_48 = 0x04;
			t1_119 = 0x00;
			a7_147 = 0x00;
			goto l230559D4;
		}
		if (a4_58 != 0x04000002)
		{
			if (a4_58 != 0x06000000)
			{
				if (a4_58 != 0x06000002)
				{
l230559C6:
					__csrrw(mcause, 0x05);
					__ebreak();
					while (true)
						;
				}
				goto l230559CE;
			}
			t6_121 = (a5 >> 2 & 0x07) + 0x08 << 0x07;
			a6_48 = 0x04;
			t1_119 = 0x01;
			a7_147 = 0x00;
l230559D4:
			struct Eq_84 * a6_99 = t5_38 + a6_48;
			struct Eq_84 * a5_100 = t5_38;
			do
			{
				__csrrs(mstatus, 0x00);
				++a5_100;
				word32 t0_114 = (word32) a5_100->bFFFFFFFF;
				__csrrw(mstatus, 0x00);
				union Eq_281866 * a4_106 = (word32) (a5_100 - t5_38) + ((word32) fp - 8);
				*a4_106 = (union Eq_281866 *) (byte) t0_114;
			} while (a6_99 != a5_100);
			if (t1_119 != 0x00)
			{
				*a4_106 = (union Eq_281866 *) (a0 + ((t6_121 >> 0x07 & 0x1F) + 0x01 << 2));
				*a0 = t3_31;
				return;
			}
			else
			{
				(a0 + (t6_121 >> 0x05 & 0x007C))[31] = a4_106 << a7_147 >> a7_147;
				*a0 = t3_31;
				return;
			}
		}
		if ((a5 >> 7 & 0x1F) == 0x00)
			goto l230559C6;
	}
	a6_48 = 0x04;
	t1_119 = 0x00;
	a7_147 = 0x00;
	goto l230559D4;
}

// 23055A82: void misaligned_store_trap(Register Eq_2 gp, Register (ptr32 word32) a0, Register (ptr32 Eq_163935) a2, Register (ptr32 (ptr32 Eq_163935)) a5, Register word32 fs0, Register word32 fs1, Register word32 fa0, Register word32 fa1, Register word32 fa2, Register word32 fa3, Register word32 fa4, Register word32 fa5, Register ptr32 mstatus, Register ptr32 mcause, Register ptr32 mtval)
// Called from:
//      exception_entry
void misaligned_store_trap(Eq_2 gp, word32 * a0, struct Eq_163935 * a2, struct Eq_163935 ** a5, word32 fs0, word32 fs1, word32 fa0, word32 fa1, word32 fa2, word32 fa3, word32 fa4, word32 fa5, ptr32 mstatus, ptr32 mcause, ptr32 mtval)
{
	__csrrs(mstatus, 0x00);
	if ((a2 & 2) == 0x00)
	{
		a2 = (struct Eq_163935 *) *a5;
		if ((a5 & 0x03) != 0x03)
			a5 = (word32) (word16) a5;
	}
	else
	{
		a5 = (word32) a2->w0000;
		if ((a5 & 0x03) == 0x03)
			a5 = (struct Eq_163935 **) ((char *) a5 + ((word32) a2->w0002 << 16));
	}
	__csrrw(mstatus, 0x00);
	word32 t4_30 = 0x04;
	if ((a5 & 3) != 0x03)
		t4_30 = 0x02;
	word32 a4_104;
	ui32 a4_48 = a5 & 0x0700007F;
	word32 t4_51 = a2 + t4_30 / 4;
	if (a4_48 != 0x02000023)
	{
		if (a4_48 == 0x02000027)
		{
			uint32 a5_54 = a5 >> 0x0011;
			ptr32 a5_58 = 587553588 + (a5_54 & 0x00F8);
			word32 mcause_73;
			word32 mtval_75;
			word32 gp_76;
			word32 fa4_78;
			word32 fa5_79;
			word32 fa3_80;
			word32 fa2_81;
			word32 fa1_82;
			word32 fa0_83;
			word32 fs1_84;
			word32 fs0_85;
			(a5_58 + 0x009A)();
			return;
		}
		if (a4_48 != 0x01000023)
		{
			ui32 a4_91 = a5 & 0x0E000003;
			if (a4_91 != 0x0C000000)
			{
				if (a4_91 != 0x0C000002)
				{
					if (a4_91 == 0x0E000000)
					{
						ui32 a0_142 = (a5 >> 0x02 & 0x07) + 0x08;
						ptr32 a5_146 = 587553684 + (a0_142 << 3);
						switch (a0_142 << 3)
						{
						case 0x00:
							word32 mcause_367;
							word32 t0_368;
							g_t23055B9E();
							return;
						case 0x01:
							word32 mcause_338;
							word32 t0_339;
							word32 fs0_350;
							g_t23055B9E();
							return;
						case 0x02:
							word32 mcause_309;
							word32 t0_310;
							word32 fs1_320;
							word32 fs0_321;
							g_t23055B9E();
							return;
						case 0x03:
							word32 mcause_280;
							word32 t0_281;
							word32 fa0_290;
							word32 fs1_291;
							word32 fs0_292;
							g_t23055B9E();
							return;
						case 0x04:
							word32 mcause_251;
							word32 t0_252;
							word32 fa1_260;
							word32 fa0_261;
							word32 fs1_262;
							word32 fs0_263;
							g_t23055B9E();
							return;
						case 0x05:
							word32 mcause_222;
							word32 t0_223;
							word32 fa2_230;
							word32 fa1_231;
							word32 fa0_232;
							word32 fs1_233;
							word32 fs0_234;
							g_t23055B9E();
							return;
						case 0x06:
							word32 mcause_193;
							word32 t0_194;
							word32 fa3_200;
							word32 fa2_201;
							word32 fa1_202;
							word32 fa0_203;
							word32 fs1_204;
							word32 fs0_205;
							g_t23055B9E();
							return;
						case 0x07:
							word32 mcause_164;
							word32 t0_165;
							word32 fa4_169;
							word32 fa3_171;
							word32 fa2_172;
							word32 fa1_173;
							word32 fa0_174;
							word32 fs1_175;
							word32 fs0_176;
							g_t23055B9E();
							return;
						}
					}
					if (a4_91 == 0x0E000002)
					{
						ui32 a5_381 = a5 << 1;
						ptr32 a5_385 = 587553728 + (a5_381 & 0x00F8);
						word32 mcause_399;
						(a5_385 + 0x0E)();
						return;
					}
l23055B24:
					__csrrw(mcause, 0x07);
					__ebreak();
					while (true)
						;
				}
				if ((a5 >> 0x07 & 0x1F) == 0x00)
					goto l23055B24;
				a4_104 = 0x04;
			}
			else
				a4_104 = 0x04;
		}
		else
			a4_104 = 0x02;
	}
	else
		a4_104 = 0x04;
	byte * a5_116 = (word32) fp - 8;
	byte * a4_118 = a4_104 + ((word32) fp - 8);
	int32 a7_119 = __csrrs(mtval, gp) - ((word32) fp - 8);
	do
	{
		word32 a0_124 = (word32) *a5_116;
		__csrrs(mstatus, 0x00);
		a5_116[a7_119] = (byte) a0_124;
		__csrrw(mstatus, 0x00);
		++a5_116;
	} while (a4_118 != a5_116);
	*a0 = t4_51;
}

<anonymous> g_t23055B9E = <code>;
// 23055DCE: void backtrace_riscv()
// Called from:
//      exception_entry
void backtrace_riscv()
{
}

// 23055DD2: Register Eq_2 set_if(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out)
// Called from:
//      dhcpd_start
Eq_2 set_if(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s3, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArg0128, union Eq_2 & s1Out)
{
	Eq_2 s0_108 = a0;
	Eq_2 s2_15 = a2;
	Eq_2 s1_17 = a3;
	if (a1 != 0x00)
	{
		word32 a0_21;
		Eq_2 a3_23;
		Eq_2 a4_24;
		Eq_2 a5_25;
		Eq_2 s4_36;
		s0_108 = ip4addr_aton(a1, fp + ~0x13, out a0_21, out a3_23, out a4_24, out a5_25, out s4_36);
		if (a0_21 != 0x00)
			s0_108 = netif_set_ipaddr(ra, a3, s0_108, fp + ~0x13, a3_23, a4_24, a5_25, a2, s3, s4_36, s7, mstatus, dwLoc0C, dwLoc08, dwArg08, dwArg18, dwArg1C, dwArg34, dwArg38, dwArg48, dwArg50, dwArg54, dwArg58, dwArg5C, s1, dwArg78, dwArg88, dwArgA8, dwArg0128, out s1_17, out s2_15);
	}
	if (s2_15 != 0x00)
	{
		word32 a0_76;
		struct Eq_206185 * a4_79;
		struct Eq_206185 * a5_80;
		word32 s4_260;
		word32 a3_259;
		s0_108 = ip4addr_aton(s2_15, fp + ~0x13, out a0_76, out a3_259, out a4_79, out a5_80, out s4_260);
		if (a0_76 != 0x00)
			netif_set_gw(s0_108, fp + ~0x13, a4_79, a5_80);
	}
	if (s1_17 != 0x00)
	{
		word32 a0_102;
		struct Eq_206169 * a4_105;
		struct Eq_206169 * a5_106;
		word32 s4_262;
		word32 a3_261;
		s0_108 = ip4addr_aton(s1_17, fp + ~0x13, out a0_102, out a3_261, out a4_105, out a5_106, out s4_262);
		if (a0_102 != 0x00)
			netif_set_netmask(s0_108, fp + ~0x13, a4_105, a5_106);
	}
	s1Out = s1_17;
	return s0_108;
}

// 23055E2C: void block_cipher_df(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2)
// Called from:
//      mbedtls_ctr_drbg_reseed
//      mbedtls_ctr_drbg_random
void block_cipher_df(Eq_2 ra, Eq_2 a1, Eq_2 a2)
{
	if (a2 > 384)
		return;
	word32 a3_435;
	word32 a4_436;
	word32 a4_439;
	word32 a5_437;
	word32 a1_438;
	word32 a5_440;
	word32 a1_433;
	word32 t1_431;
	word32 a0_432;
	word32 a2_434;
	Eq_2 ra_111 = mbedtls_aes_init(memset(ra, fp + -448, 0x00, 416, out t1_431, out a0_432, out a1_433, out a2_434, out a3_435, out a4_436, out a5_437), fp + -728, out a1_438, out a4_439, out a5_440);
	word32 a5_445;
	word32 a6_446;
	word32 a7_447;
	word32 a1_441;
	word32 a4_444;
	word32 a2_442;
	word32 a3_443;
	memcpy(fp + -424, a1, a2, out a1_441, out a2_442, out a3_443, out a4_444, out a5_445, out a6_446, out a7_447);
	(word32) a2 + (fp + -32) + 0x0E78 = (ptr32) 0x80;
	Eq_282256 a5_80 = 0x00;
	do
	{
		*((word32) a5_80.u0 + (fp + -808)) = (byte) a5_80;
		a5_80 = (word32) a5_80.u0 + 1;
	} while (a5_80 != 32);
	word32 a1_449;
	word32 a4_451;
	word32 a3_450;
	word32 a0_448;
	Eq_2 s0_121 = mbedtls_aes_setkey_enc(fp + -728, fp + -808, 0x0100, (struct Eq_282277 *) 32, a5_80, dwLoc02FC, dwLoc0218, out a0_448, out a1_449, out a3_450, out a4_451);
	Eq_2 s5_105 = 0x10;
	do
	{
		word32 t1_464;
		word32 a0_465;
		word32 a1_466;
		word32 a2_467;
		word32 a3_468;
		word32 a4_469;
		word32 a5_470;
		ra_111 = memset(ra_111, fp + -0x0338, 0x00, 0x10, out t1_464, out a0_465, out a1_466, out a2_467, out a3_468, out a4_469, out a5_470);
		Eq_2 s2_122 = s0_121;
		ptr32 s4_123 = fp + -448;
		do
		{
			struct Eq_282300 * a4_125 = fp + -0x0338;
			Eq_2 a5_126 = 0x00;
			do
			{
				++a4_125;
				a4_125[0x0FFF] = (struct Eq_282300) (byte) ((word32) *((word32) a5_126 + s4_123) ^ (word32) a4_125->b0000);
				a5_126 = (word32) a5_126 + 1;
			} while (a5_126 != s5_105);
			word32 s11_457;
			word32 s9_455;
			word32 s8_454;
			word32 s10_456;
			int32 s3_167;
			int32 s6_170;
			word32 s1_452;
			word32 s7_453;
			s0_121 = mbedtls_aes_crypt_ecb(0x01, fp + -0x0338, fp + -0x0338, dwLoc0314, dwLoc0208, out s1_452, out s2_122, out s3_167, out s4_123, out s5_105, out s6_170, out s7_453, out s8_454, out s9_455, out s10_456, out s11_457);
		} while (s2_122 != 0x00);
		struct Eq_282277 * a4_186;
		word32 a1_458;
		word32 a2_459;
		word32 a3_460;
		word32 a5_461;
		word32 a6_462;
		word32 a7_463;
		memcpy(fp + -776 + s3_167, fp + -0x0338, 0x10, out a1_458, out a2_459, out a3_460, out a4_186, out a5_461, out a6_462, out a7_463);
		word32 a5_199 = (word32) bLoc01BD;
		bLoc01BD = (byte) (a5_199 + 0x01);
	} while (s3_167 + 0x10 != s6_170);
	word32 a0_471;
	word32 a1_472;
	word32 a3_473;
	word32 a4_474;
	mbedtls_aes_setkey_enc(fp + -728, fp + -776, 0x0100, a4_186, a5_199 + 0x01, dwLoc02FC, dwLoc0218, out a0_471, out a1_472, out a3_473, out a4_474);
	do
	{
		Eq_2 s1_234;
		word32 s2_475;
		word32 s3_476;
		word32 s4_477;
		word32 s5_478;
		word32 s6_479;
		word32 s7_480;
		word32 s8_481;
		word32 s9_482;
		word32 s10_483;
		word32 s11_484;
		Eq_2 s0_233 = mbedtls_aes_crypt_ecb(0x01, fp + -744, fp + -744, dwLoc0314, dwLoc0208, out s1_234, out s2_475, out s3_476, out s4_477, out s5_478, out s6_479, out s7_480, out s8_481, out s9_482, out s10_483, out s11_484);
		word32 a1_485;
		word32 a2_486;
		word32 a3_487;
		word32 a4_488;
		word32 a5_489;
		word32 a6_490;
		word32 a7_491;
		memcpy(s1_234, fp + -744, 0x10, out a1_485, out a2_486, out a3_487, out a4_488, out a5_489, out a6_490, out a7_491);
	} while (s0_233 != (word32) s1_234 + 16);
	mbedtls_aes_free(fp + -728);
}

