pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 23055F98: Register Eq_2 ctr_drbg_update_internal(Register Eq_2 ra, Register Eq_2 a0, Stack Eq_2 dwArgD8, Stack Eq_59116 dwArgE8, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a5Out, Register out Eq_282504 s2Out)
// Called from:
//      mbedtls_ctr_drbg_reseed
//      mbedtls_ctr_drbg_random
Eq_2 ctr_drbg_update_internal(Eq_2 ra, Eq_2 a0, Eq_2 dwArgD8, Eq_59116 dwArgE8, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a5Out, union Eq_282504 & s2Out)
{
	word32 a3_238;
	word32 a2_237;
	word32 a5_240;
	word32 a4_239;
	word32 a1_236;
	word32 a0_235;
	word32 t1_234;
	memset(ra, fp + -80, 0x00, 48, out t1_234, out a0_235, out a1_236, out a2_237, out a3_238, out a4_239, out a5_240);
	Eq_2 s0_156 = a0;
	Eq_282504 s2_27 = 0x00;
	Eq_2 s5_37 = (word32) a0 + 0x0F;
	do
	{
		Eq_2 a3_43 = (word32) s2_27.u0 + (fp + -80);
		Eq_2 a4_45 = s5_37;
		while (true)
		{
			ui32 a5_50 = (word32) *a4_45 + 0x01 & 0x00FF;
			a4_45->u1 = (byte) a5_50;
			if (a5_50 != 0x00)
				break;
			Eq_2 a5_52 = (word32) a4_45 - 1;
			if (s0_156 == a4_45)
				break;
			a4_45 = a5_52;
		}
		struct Eq_282274 * s3_83;
		ptr32 s4_84;
		Eq_282504 s6_86;
		word32 s10_244;
		word32 s11_245;
		word32 s7_241;
		word32 s9_243;
		word32 s8_242;
		struct Eq_282556 * s1_103;
		s0_156 = mbedtls_aes_crypt_ecb(0x01, s0_156, a3_43, dwLoc24, dwArgE8, out s1_103, out s2_27, out s3_83, out s4_84, out s5_37, out s6_86, out s7_241, out s8_242, out s9_243, out s10_244, out s11_245);
	} while (s2_27 != s6_86);
	Eq_282256 a5_101 = 0x00;
	do
	{
		++s1_103;
		struct Eq_282277 * a4_109 = (word32) *((word32) a5_101.u0 + s4_84) ^ (word32) s1_103->b0000;
		s1_103[0x0FFF] = (struct Eq_282556) (byte) a4_109;
		a5_101 = (word32) a5_101.u0 + 1;
	} while (a5_101 != 48);
	word32 a3_248;
	word32 a4_249;
	word32 a1_247;
	word32 a0_246;
	Eq_2 s0_124 = mbedtls_aes_setkey_enc(s3_83, fp + -80, 0x0100, a4_109, a5_101, dwLoc0C, dwArgD8, out a0_246, out a1_247, out a3_248, out a4_249);
	ptr32 a5_133;
	word32 a3_252;
	word32 a4_253;
	word32 a7_255;
	word32 a6_254;
	word32 a2_251;
	word32 a1_250;
	memcpy(s0_124, fp + -48, 0x10, out a1_250, out a2_251, out a3_252, out a4_253, out a5_133, out a6_254, out a7_255);
	s0Out = s0_124;
	s1Out = dwLoc4C;
	a5Out = a5_133;
	s2Out = s2_27;
	return dwLoc08;
}

// 23056048: Register Eq_2 mbedtls_ctr_drbg_init(Register Eq_2 ra, Register Eq_2 a0)
// Called from:
//      iot_tls_connect
Eq_2 mbedtls_ctr_drbg_init(Eq_2 ra, Eq_2 a0)
{
	word32 t1_16;
	word32 a0_17;
	word32 a1_18;
	word32 a2_19;
	word32 a3_20;
	word32 a4_21;
	word32 a5_22;
	return memset(ra, a0, 0x00, 320, out t1_16, out a0_17, out a1_18, out a2_19, out a3_20, out a4_21, out a5_22);
}

// 23056052: void mbedtls_ctr_drbg_free(Register (ptr32 byte) a0)
// Called from:
//      iot_tls_destroy
void mbedtls_ctr_drbg_free(byte * a0)
{
	if (a0 == null)
		return;
	mbedtls_aes_free(a0 + 32);
	byte * s0_14;
	for (s0_14 = a0; s0_14 != a0 + 320; ++s0_14)
		*s0_14 = 0x00;
}

// 2305607E: Register int32 mbedtls_ctr_drbg_reseed(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register word32 s3)
// Called from:
//      mbedtls_ctr_drbg_seed
//      mbedtls_ctr_drbg_random
int32 mbedtls_ctr_drbg_reseed(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 a4, word32 s3)
{
	struct Eq_282676 * a0_17 = *((word32) a4 + 24);
	int32 s2_122 = -56;
	if (a4 <= 384)
	{
		s2_122 = -56;
		if ((struct Eq_282685 *) 384 - a4 >= a2)
		{
			struct Eq_282688 * a2_32;
			word32 a4_34;
			word32 a5_228;
			word32 a1_226;
			word32 a3_227;
			word32 t1_224;
			word32 a0_225;
			Eq_2 ra_36 = memset(ra, fp + -416, 0x00, 384, out t1_224, out a0_225, out a1_226, out a2_32, out a3_227, out a4_34, out a5_228);
			word32 s0_40 = a2_32->dw0018;
			Eq_2 sp_43;
			Eq_2 ra_45;
			Eq_2 s0_46;
			Eq_2 s1_47;
			Eq_2 s4_49;
			word32 a0_50;
			word32 a3_55;
			word32 t0_56;
			word32 t1_57;
			word32 a7_157;
			word32 a6_158;
			word32 t3_159;
			word32 t4_160;
			word32 t5_161;
			word32 t6_162;
			word32 s10_163;
			word32 s11_164;
			word32 s7_165;
			word32 s8_166;
			word32 s9_167;
			word32 t2_168;
			word32 tp_169;
			word32 s5_170;
			word32 s6_171;
			a0_17->ptr0138();
			if (a0_50 == 0x00)
			{
				Eq_2 s3_60 = *((word32) s0_46 + 24);
				if (s4_49 != 0x00 && s1_47 != 0x00)
				{
					word32 a4_234;
					word32 a5_235;
					word32 a2_232;
					word32 a3_233;
					word32 a1_231;
					word32 a6_236;
					word32 a7_237;
					memcpy(sp_43 + s3_60, s4_49, s1_47, out a1_231, out a2_232, out a3_233, out a4_234, out a5_235, out a6_236, out a7_237);
					s3_60 += s1_47;
				}
				block_cipher_df(ra_45, sp_43, s3_60);
				Eq_2 s0_118;
				word32 a5_230;
				word32 s1_229;
				ctr_drbg_update_internal(ra_45, s0_46, *((word32) sp_43 + 0x00D8), *((word32) sp_43 + 232), out s0_118, out s1_229, out a5_230, out s2_122);
				*(union Eq_2 *) 0x11 = s0_118;
			}
			else
				s2_122 = -52;
		}
	}
	return s2_122;
}

// 23056126: Register Eq_2 mbedtls_ctr_drbg_seed_entropy_len(Register Eq_2 ra, Register (ptr32 Eq_266666) a0, Register word32 a1, Register Eq_2 a2, Stack Eq_2 dwArgD8, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a5Out)
// Called from:
//      mbedtls_ctr_drbg_seed
Eq_2 mbedtls_ctr_drbg_seed_entropy_len(Eq_2 ra, struct Eq_266666 * a0, word32 a1, Eq_2 a2, Eq_2 dwArgD8, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a5Out)
{
	struct Eq_282277 * a4_44;
	struct Eq_282800 * a5_45;
	word32 t1_122;
	word32 a0_123;
	word32 a1_124;
	word32 a2_125;
	word32 a3_126;
	word32 a4_127;
	word32 a5_128;
	word32 a1_129;
	Eq_2 ra_46 = mbedtls_aes_init(memset(ra, fp + -64, 0x00, 32, out t1_122, out a0_123, out a1_124, out a2_125, out a3_126, out a4_127, out a5_128), (char *) a0 + 32, out a1_129, out a4_44, out a5_45);
	a0->dw0138 = a1;
	a0->t013C = a2;
	a5_45->ptr0018 = a0;
	*(struct Eq_266666 **) 0x0200072C = a0;
	Eq_2 a3_62;
	Eq_2 a4_63;
	word32 a0_130;
	word32 a1_131;
	mbedtls_aes_setkey_enc((char *) a0 + 32, fp + -64, 0x0100, a4_44, 0x02000710, dwLoc0C, dwArgD8, out a0_130, out a1_131, out a3_62, out a4_63);
	a0Out = mbedtls_ctr_drbg_reseed(ra_46, a3_62, a4_63, a4_63, a1);
	a3Out = s2;
	a5Out = a5_77;
	return dwLoc08;
}

// 23056190: Register Eq_2 mbedtls_ctr_drbg_seed(Register Eq_2 ra, Register (ptr32 Eq_266666) a0, Register word32 a1, Register Eq_2 a2, Stack Eq_2 dwArgD8, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a5Out)
// Called from:
//      iot_tls_connect
Eq_2 mbedtls_ctr_drbg_seed(Eq_2 ra, struct Eq_266666 * a0, word32 a1, Eq_2 a2, Eq_2 dwArgD8, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a5Out)
{
	ptr32 a0_9;
	ptr32 a3_12;
	ptr32 a5_14;
	Eq_2 ra_17 = mbedtls_ctr_drbg_seed_entropy_len(ra, a0, a1, a2, dwArgD8, out a0_9, out a3_12, out a5_14);
	a0Out = a0_9;
	a3Out = a3_12;
	a5Out = a5_14;
	return ra_17;
}

