pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 23056198: void mbedtls_ctr_drbg_random_with_add(Register Eq_2 ra, Register word32 a1, Register Eq_282876 a2, Register Eq_282877 a4, Register word32 s4, Stack (ptr32 Eq_282879) dwArg34, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_59116 dwArg78, Stack Eq_59116 dwArgC8)
// Called from:
//      mbedtls_ctr_drbg_random
void mbedtls_ctr_drbg_random_with_add(Eq_2 ra, word32 a1, Eq_282876 a2, Eq_282877 a4, word32 s4, struct Eq_282879 * dwArg34, Eq_2 dwArg54, Eq_2 dwArg68, Eq_59116 dwArg78, Eq_59116 dwArgC8)
{
	if (a2 > 0x0400 || a4 > 0x0100)
		return;
	Eq_282876 s1_141 = a2;
	Eq_2 a3_40;
	Eq_2 a4_41;
	struct Eq_282879 * a5_42;
	word32 a2_419;
	word32 a1_418;
	word32 t1_416;
	word32 a0_417;
	Eq_2 ra_222 = memset(ra, fp + -80, 0x00, 48, out t1_416, out a0_417, out a1_418, out a2_419, out a3_40, out a4_41, out a5_42);
	Eq_2 s0_110 = dwArg54;
	if (a5_42 >= dwArg34)
	{
		s0_110 = a5_42->t0014;
		if (a5_42 == null)
		{
			if (a4_41 != 0x00)
			{
				block_cipher_df(ra_222, a3_40, a4_41);
				word32 a5_437;
				word32 s2_438;
				ra_222 = ctr_drbg_update_internal(ra_222, s0_110, dwArg68, dwArg78, out s0_110, out s1_141, out a5_437, out s2_438);
			}
l23056218:
			Eq_2 s4_138 = (word32) s0_110 + 0x0F;
			while (s1_141 != 0x00)
			{
				Eq_2 a4_143 = s4_138;
				while (true)
				{
					ui32 a5_148 = (word32) *a4_143 + 0x01 & 0x00FF;
					a4_143->u1 = (byte) a5_148;
					if (a5_148 != 0x00)
						break;
					Eq_2 a5_150 = (word32) a4_143 - 1;
					if (s0_110 == a4_143)
						break;
					a4_143 = a5_150;
				}
				Eq_2 s1_174;
				Eq_2 s3_178;
				Eq_2 s6_181;
				word32 s9_427;
				word32 s10_428;
				word32 s11_429;
				word32 s8_426;
				word32 s7_425;
				word32 s2_423;
				word32 s5_424;
				s0_110 = mbedtls_aes_crypt_ecb(0x01, s0_110, fp + -96, s4, dwArgC8, out s1_174, out s2_423, out s3_178, out s4_138, out s5_424, out s6_181, out s7_425, out s8_426, out s9_427, out s10_428, out s11_429);
				Eq_2 s2_193 = s1_174;
				if (s6_181 < s1_174)
					s2_193.u0 = 0x10;
				word32 a5_434;
				word32 a6_435;
				word32 a7_436;
				word32 a4_433;
				word32 a3_432;
				word32 a1_430;
				word32 a2_431;
				memcpy(s3_178, fp + -96, s2_193, out a1_430, out a2_431, out a3_432, out a4_433, out a5_434, out a6_435, out a7_436);
				s1_141 = s1_174 - s2_193;
			}
			struct Eq_282927 * a5_235;
			word32 s0_420;
			word32 s1_421;
			word32 s2_422;
			ctr_drbg_update_internal(ra_222, s0_110, dwArg68, dwArg78, out s0_420, out s1_421, out a5_235, out s2_422);
			a5_235->dw0011 = a5_235->dw0010;
			return;
		}
	}
	if (mbedtls_ctr_drbg_reseed(ra_222, a3_40, a4_41, a4_41, a1) != 0x00)
		return;
	goto l23056218;
}

// 23056280: void mbedtls_ctr_drbg_random(Register Eq_2 ra, Register word32 a1, Register Eq_282876 a2, Register word32 s4, Stack (ptr32 Eq_282879) dwArg34, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_59116 dwArg78, Stack Eq_59116 dwArgC8)
void mbedtls_ctr_drbg_random(Eq_2 ra, word32 a1, Eq_282876 a2, word32 s4, struct Eq_282879 * dwArg34, Eq_2 dwArg54, Eq_2 dwArg68, Eq_59116 dwArg78, Eq_59116 dwArgC8)
{
	mbedtls_ctr_drbg_random_with_add(ra, a1, a2, 0x00, s4, dwArg34, dwArg54, dwArg68, dwArg78, dwArgC8);
}

// 23056288: Register Eq_2 entropy_update(Register Eq_2 ra, Register Eq_283037 a3, Stack Eq_2 dwArg58, Register out ptr32 s1Out, Register out (ptr32 Eq_283040) a0Out, Register out ptr32 a1Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      entropy_gather_internal.part.0
Eq_2 entropy_update(Eq_2 ra, Eq_283037 a3, Eq_2 dwArg58, ptr32 & s1Out, struct Eq_283040 & a0Out, ptr32 & a1Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	word32 * a5_14 = (word32 *) 32;
	if (a3 > 32)
		mbedtls_sha256(ra, out a5_14);
	word32 * a5_58;
	Eq_2 s1_62;
	ptr32 a1_80;
	ptr32 a4_83;
	ptr32 a5_84;
	ptr32 s2_89;
	ptr32 s3_90;
	ptr32 s4_91;
	word32 a1_136;
	word32 a4_137;
	word32 s2_138;
	word32 s3_139;
	word32 s4_140;
	word32 s5_141;
	word32 s1_142;
	word32 s5_143;
	mbedtls_sha256_update(s1_62, mbedtls_sha256_update(fp + -0x0044, 0x02, a5_14, dwLoc08, dwArg58, out s1_62, out a1_136, out a4_137, out a5_58, out s2_138, out s3_139, out s4_140, out s5_141), a5_58, dwLoc08, dwArg58, out s1_142, out a1_80, out a4_83, out a5_84, out s2_89, out s3_90, out s4_91, out s5_143);
	s1Out = dwLoc4C;
	a0Out = null;
	a1Out = a1_80;
	a4Out = a4_83;
	a5Out = a5_84;
	s2Out = s2_89;
	s3Out = s3_90;
	s4Out = s4_91;
	return dwLoc08;
}

// 230562E2: Register Eq_2 entropy_gather_internal.part.0(Register Eq_2 ra, Register (ptr32 Eq_283115) a0, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_283119 s3Out)
// Called from:
//      mbedtls_entropy_func
Eq_2 entropy_gather_internal.part.0(Eq_2 ra, struct Eq_283115 * a0, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_283119 & s3Out)
{
	struct Eq_283120 * sp_103 = fp + -0x00B0;
	struct Eq_283115 * s2_112 = a0;
	Eq_283119 s3_117 = 0x00;
	<anonymous> * s1_20 = null;
	<anonymous> * s4_114 = (<anonymous> *) 0x01;
	while (true)
	{
		<anonymous> * a5_24 = s2_112->ptr0074;
		if (s1_20 >= a5_24)
			break;
		if (a5_24 == s4_114)
			s3_117.u0 = 0x01;
		word32 s0_34 = a0->dw0004;
		sp_103->dw0084 = 0x00;
		word32 s5_127;
		word32 a7_126;
		word32 a6_125;
		Eq_283037 a3_57;
		word32 s6_128;
		word32 s8_129;
		word32 t0_130;
		word32 t3_131;
		word32 t4_132;
		word32 t6_133;
		word32 tp_134;
		word32 s1_50;
		a5_24();
		if (a0 != null)
			break;
		a2 = sp_103->ptr00A4;
		if (a3_57 != 0x00)
		{
			int32 a4_72;
			struct Eq_283171 * a5_73;
			ra = entropy_update(ra, a3_57, sp_103->t0058, out s1_50, out a0, out a1, out a4_72, out a5_73, out s2_112, out s3_117, out s4_114);
			a2 = sp_103->ptr00C4;
			(a5_73 + a4_72 / 0x0C)->dw0008 = a5_73->dw0008;
		}
		s1_20 = s1_50 + 0x01;
	}
	a0Out = sp_103->ptr0114;
	a1Out = a1;
	a2Out = a2;
	s3Out = s3_117;
	return ra;
}

// 23056356: Register Eq_2 mbedtls_entropy_init(Register Eq_2 ra, Register Eq_2 a0)
// Called from:
//      iot_tls_connect
Eq_2 mbedtls_entropy_init(Eq_2 ra, Eq_2 a0)
{
	struct Eq_283200 * a4_16;
	word32 a2_60;
	word32 a3_61;
	word32 a1_59;
	word32 a0_58;
	word32 t1_57;
	word32 a5_62;
	Eq_2 ra_18 = memset(ra, a0, 0x00, 520, out t1_57, out a0_58, out a1_59, out a2_60, out a3_61, out a4_16, out a5_62);
	mbedtls_sha256_starts(a0, null);
	int32 s0_24 = a4_16->dw0074;
	if (a4_16 <= (struct Eq_283200 *) 0x13)
	{
		struct Eq_283231 * a5_31 = (char *) a4_16 + 20 + s0_24;
		g_ptr23056508 = a5_31;
		a5_31->dw0084 = 32;
		a5_31->dw007C = 0x00;
		a5_31->dw0088 = 0x01;
		a4_16->dw0075 = s0_24;
	}
	return ra_18;
}

// 230563A8: void mbedtls_entropy_free(Register (ptr32 byte) a0)
// Called from:
//      iot_tls_destroy
void mbedtls_entropy_free(byte * a0)
{
	a0_5 = a0;
	while (true)
	{
		byte * a0_5;
		if (a0_5 == a0 + 520)
			break;
		*a0_5 = 0x00;
		++a0_5;
	}
}

