pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 230563BA: void mbedtls_entropy_func(Register Eq_2 ra, Register Eq_283263 a2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68)
void mbedtls_entropy_func(Eq_2 ra, Eq_283263 a2, Eq_2 dwArg08, Eq_2 dwArg48, Eq_2 dwArg68)
{
	struct Eq_283267 * a5_18 = (struct Eq_283267 *) 32;
	if (a2 > 32)
	{
l230563D2:
	}
	else
	{
		int32 s3_25 = 258;
		do
		{
			if (s3_25 == ~0x00)
				goto l230563D2;
			struct Eq_283115 * s0_30 = a5_18->dw0074;
			if (a5_18 == null)
				return;
			struct Eq_283279 * a0_34;
			struct Eq_283279 * a1_35;
			struct Eq_283281 * a2_36;
			ra = entropy_gather_internal.part.0(ra, s0_30, out a0_34, out a1_35, out a2_36, out s3_25);
			if (a0_34 != null)
				return;
			a5_18 = a2_36->dw0074 + 0x0080;
			struct Eq_283281 * a4_63 = null;
			word32 a3_64 = 0x01;
			while (a4_63 < a2_36)
			{
				word32 a5_71 = a1_35->dw0004;
				if (a0_34 < a1_35)
					a3_64 = 0x00;
				a4_63 = (struct Eq_283281 *) ((char *) a4_63 + 1);
				a5_18 = a5_71 + 0x14;
			}
		} while (a3_64 == 0x00);
		Eq_2 a2_89;
		word32 a4_388;
		word32 a5_389;
		word32 a1_386;
		word32 a3_387;
		word32 t1_384;
		word32 a0_385;
		Eq_2 ra_93 = memset(ra, fp + -64, 0x00, 32, out t1_384, out a0_385, out a1_386, out a2_89, out a3_387, out a4_388, out a5_389);
		word32 s5_395;
		word32 s4_394;
		word32 s2_392;
		word32 s3_393;
		word32 s1_390;
		word32 a5_391;
		Eq_2 s0_108 = mbedtls_sha256_finish(a2_89, dwLoc18, dwArg48, out s1_390, out a5_391, out s2_392, out s3_393, out s4_394, out s5_395);
		word32 a0_397;
		word32 a2_399;
		word32 t1_396;
		word32 a1_398;
		word32 a3_400;
		word32 a4_401;
		word32 a5_402;
		Eq_2 ra_132 = memset(ra_93, s0_108, 0x00, 116, out t1_396, out a0_397, out a1_398, out a2_399, out a3_400, out a4_401, out a5_402);
		Eq_2 s4_153;
		Eq_2 s5_154;
		word32 s1_403;
		word32 a1_404;
		word32 s3_407;
		word32 a4_405;
		word32 a5_406;
		struct Eq_283383 * s2_151;
		mbedtls_sha256_update(fp + -64, 32, mbedtls_sha256_starts(s0_108, null), dwArg08, dwArg68, out s1_403, out a1_404, out a4_405, out a5_406, out s2_151, out s3_407, out s4_153, out s5_154);
		word32 a5_408;
		int32 a4_172 = mbedtls_sha256(ra_132, out a5_408);
		int32 a5_183;
		for (a5_183 = 0x00; a5_183 < a4_172; ++a5_183)
		{
			s2_151->dw0000 = 0x00;
			++s2_151;
		}
		word32 a1_409;
		word32 a2_410;
		word32 a3_411;
		word32 a4_412;
		word32 a5_413;
		word32 a6_414;
		word32 a7_415;
		memcpy(s5_154, fp + -64, s4_153, out a1_409, out a2_410, out a3_411, out a4_412, out a5_413, out a6_414, out a7_415);
	}
}

// 23056490: void mbedtls_platform_entropy_poll(Register int32 a1, Register (ptr32 Eq_52584) a2, Register (ptr32 Eq_52584) a3)
void mbedtls_platform_entropy_poll(int32 a1, struct Eq_52584 * a2, struct Eq_52584 * a3)
{
	a3->dw0000 = (word32) 0x00;
	Eq_2 a0_10 = 0x00;
	struct Eq_52584 * s0_11;
	for (s0_11 = null; s0_11 != a2; ++s0_11)
	{
		if ((s0_11 & 3) == 0x00)
		{
			word32 a4_84;
			word32 a5_85;
			word32 s4_86;
			bl_rand(a0_10, a2, out a0_10, out a1, out a3, out a4_84, out a5_85, out s4_86);
			a2 = dwArg84;
			s0_11 = a3;
		}
		s0_11[a1] = (struct Eq_52584) (byte) a0_10;
		a0_10 >>= 8;
	}
	s0_11->dw0000 = a3;
}

// 230564D2: void mbedtls_pk_init(Register (ptr32 Eq_266661) a0)
// Called from:
//      iot_tls_connect
void mbedtls_pk_init(struct Eq_266661 * a0)
{
	if (a0 != null)
	{
		a0->dw0000 = 0x00;
		a0->dw0004 = 0x00;
	}
}

// 230564DE: Register Eq_2 mbedtls_pk_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a5, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out Eq_2 a5Out)
// Called from:
//      iot_tls_destroy
//      pk_parse_key_pkcs8_unencrypted_der
//      mbedtls_pk_parse_subpubkey
//      mbedtls_pk_parse_key
//      mbedtls_x509_crt_free
Eq_2 mbedtls_pk_free(Eq_2 ra, Eq_2 a0, Eq_2 a5, union Eq_2 & a0Out, ptr32 & a2Out, union Eq_2 & a5Out)
{
	if (a0 == 0x00)
	{
		a0Out = a0;
		a2Out = a2;
		a5Out = a5;
		return ra;
	}
	else
	{
		Eq_2 a0_10 = *a5;
		if (a5 != 0x00)
		{
			<anonymous> * a5_12 = *((word32) a5 + 40);
			byte * s0_16;
			word32 a2_19;
			a5_12();
			a5 = s0_16 + 8;
			s0_21 = s0_16;
			while (true)
			{
				byte * s0_21;
				if (s0_21 == s0_16 + 8)
					break;
				*s0_21 = 0x00;
				++s0_21;
			}
		}
		a0Out = a0_10;
		a2Out = dwArg10;
		a5Out = a5;
		return ra;
	}
}

struct Eq_283231 * g_ptr23056508 = &g_t8082B7FD;
// 2305650C: Register word32 mbedtls_pk_info_from_type(Register word32 a0, Register out Eq_283514 a5Out)
// Called from:
//      pk_parse_key_pkcs8_unencrypted_der
//      mbedtls_pk_parse_subpubkey
//      mbedtls_pk_parse_key
word32 mbedtls_pk_info_from_type(word32 a0, union Eq_283514 & a5Out)
{
	uint32 a0_5 = a0 + ~0x00 & 0x00FF;
	if (a0_5 > 0x02)
	{
		a5Out.u0 = 0x02;
		return 0x00;
	}
	else
	{
		word32 a0_13 = g_a23088B34[a0_5 * 0x04];
		a5Out.u0 = 0x23088B34;
		return a0_13;
	}
}

// 2305652C: Register Eq_2 mbedtls_pk_setup(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a5, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_2 a5Out)
// Called from:
//      pk_parse_key_pkcs8_unencrypted_der
//      mbedtls_pk_parse_subpubkey
//      mbedtls_pk_parse_key
Eq_2 mbedtls_pk_setup(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, ptr32 a1, Eq_2 a5, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_2 & a5Out)
{
	if (a0 != 0x00 && a1 != 0x00)
	{
		word32 a0_7 = *a5;
		if (a5 == 0x00)
		{
			ptr32 a0_31;
			Eq_2 a1_10 = *((word32) a5 + 36);
			struct Eq_283558 * a0_21;
			ptr32 a1_22;
			Eq_2 a5_23;
			word32 s0_24;
			Eq_2 s1_25;
			Eq_2 ra_26;
			word32 a2_27;
			word32 tp_28;
			a5();
			a0_21->dw0004 = s0_24;
			if (a0_21 != null)
			{
				*s1_25 = s0_24;
				a0_31 = 0x00;
			}
			else
				a0_31 = 0xFC000080;
			s1Out = s1_25;
			a0Out = a0_31;
			a1Out = a1_22;
			a2Out = dwArg10;
			a5Out = a5_23;
			return ra_26;
		}
	}
	s1Out = s1;
	a0Out = 0xFC000180;
	a1Out = a1;
	a2Out = a2;
	a5Out = a5;
	return ra;
}

// 23056566: Register Eq_2 mbedtls_pk_can_do(Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a5, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_pk_verify_ext
//      mbedtls_ssl_sig_from_pk
//      mbedtls_ssl_parse_certificate
//      mbedtls_ssl_handshake_server_step
Eq_2 mbedtls_pk_can_do(Eq_2 a0, ptr32 a1, Eq_2 a5, union Eq_2 & a5Out)
{
	if (a0 == 0x00 || a5 == 0x00)
	{
		a5Out = a5;
		return 0x00;
	}
	else
	{
		Eq_2 a0_12;
		Eq_2 a5_13;
		word32 t1_14;
		(*((word32) a5 + 0x0C))();
		a5Out = a5_13;
		return a0_12;
	}
}

// 23056578: Register Eq_2 mbedtls_pk_verify(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_283597 a4, Register Eq_2 a5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg44, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC4, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out Eq_283597 a4Out, Register out Eq_2 a5Out, Register out Eq_283597 s8Out)
// Called from:
//      mbedtls_pk_verify_ext
Eq_2 mbedtls_pk_verify(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_283597 a4, Eq_2 a5, Eq_2 dwArg00, Eq_2 dwArg44, Eq_2 dwArgA4, Eq_2 dwArgC4, union Eq_2 & s0Out, ptr32 & a0Out, union Eq_283597 & a4Out, union Eq_2 & a5Out, union Eq_283597 & s8Out)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		a0Out = 0xFC000180;
		a4Out = a4;
		a5Out = a5;
		s8Out = s8;
		return ra;
	}
	ptr32 a0_22;
	Eq_2 s0_107 = a0;
	Eq_2 a0_10 = *a0;
	if (a0_10 != 0x00)
	{
		if (a3 != 0x00)
		{
l230565BC:
			s0_107 = *a0_10;
			<anonymous> * t1_30 = *((word32) a0_10 + 16);
			if (t1_30 != null)
			{
				ptr32 a0_52;
				Eq_2 s0_53;
				Eq_2 ra_54;
				Eq_2 a5_57;
				Eq_283597 a4_58;
				word32 tp_60;
				word32 t1_61;
				Eq_283597 s8_62;
				t1_30();
				s0Out = s0_53;
				a0Out = a0_52;
				a4Out = a4_58;
				a5Out = a5_57;
				s8Out = s8_62;
				return ra_54;
			}
			a0_22 = 0xFC000100;
l23056588:
			s0Out = s0_107;
			a0Out = a0_22;
			a4Out = a4;
			a5Out = a5;
			s8Out = dwLoc1C;
			return ra;
		}
		word32 a5_129;
		mbedtls_md_info_from_type(a0, out a5_129);
		a0_10 = a1;
		dwLoc1C = a4;
		if (a1 != 0x00)
		{
			mbedtls_md_get_size(a0);
			0x00 = (uint16) dwArg44;
			a2 = dwArgC4;
			a3 = a1;
			goto l230565BC;
		}
	}
	a0_22 = 0xFC000180;
	goto l23056588;
}

// 230565D8: void mbedtls_pk_sign(Register word32 ra, Register (ptr32 Eq_2) a0, Register Eq_2 a1, Register Eq_2 a3, Register word32 a4, Register word32 a5, Register word32 a6, Register word32 a7, Stack word32 dwArg34, Stack word32 dwArg94, Stack word32 dwArgB4, Stack word32 dwArgE4, Stack word32 dwArg0100)
void mbedtls_pk_sign(word32 ra, union Eq_2 * a0, Eq_2 a1, Eq_2 a3, word32 a4, word32 a5, word32 a6, word32 a7, word32 dwArg34, word32 dwArg94, word32 dwArgB4, word32 dwArgE4, word32 dwArg0100)
{
	if (a0 == null)
		return;
	Eq_2 a0_10 = *a0;
	if (a0_10 == 0x00)
		return;
	if (a3 == 0x00)
	{
		Eq_2 a0_25 = mbedtls_md_info_from_type(a1, out a5);
		if (a0_25 == 0x00)
			return;
		a0_10 = mbedtls_md_get_size(a0_25);
		a6 = dwArg94;
		a3 = a0_10;
	}
	<anonymous> * t1_40 = *((word32) a0_10 + 20);
	if (t1_40 == null)
		return;
	word32 t3_73;
	word32 s8_74;
	word32 s4_75;
	word32 t1_76;
	t1_40();
}

