pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 23056640: void mbedtls_pk_decrypt(Register (ptr32 (ptr32 Eq_283701)) a0)
void mbedtls_pk_decrypt(struct Eq_283701 ** a0)
{
	if (a0 == null)
		return;
	struct Eq_283701 * t1_5 = *a0;
	if (t1_5 == null)
		return;
	<anonymous> * t1_8 = t1_5->ptr0018;
	if (t1_8 == null)
		return;
	word32 t1_14;
	t1_8();
}

// 23056666: void mbedtls_pk_encrypt(Register (ptr32 (ptr32 Eq_283717)) a0)
void mbedtls_pk_encrypt(struct Eq_283717 ** a0)
{
	if (a0 == null)
		return;
	struct Eq_283717 * t1_5 = *a0;
	if (t1_5 == null)
		return;
	<anonymous> * t1_8 = t1_5->ptr001C;
	if (t1_8 == null)
		return;
	word32 t1_14;
	t1_8();
}

// 2305668C: Register Eq_2 mbedtls_pk_get_bitlen(Register Eq_2 a0, Register Eq_2 a5, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_pk_verify_ext
//      x509_profile_check_key
//      mbedtls_x509_crt_info
Eq_2 mbedtls_pk_get_bitlen(Eq_2 a0, Eq_2 a5, union Eq_2 & a5Out)
{
	if (a0 != 0x00)
	{
		word32 a0_6 = *a5;
		if (a5 != 0x00)
		{
			Eq_2 a0_11;
			Eq_2 a5_12;
			word32 t1_13;
			(*((word32) a5 + 8))();
			a5Out = a5_12;
			return a0_11;
		}
	}
	a5Out = a5;
	return 0x00;
}

// 2305669E: Register Eq_2 mbedtls_pk_verify_ext(Register Eq_2 ra, Register ptr32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register Eq_283597 a6, Register Eq_2 a7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg44, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC4, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0198, Register out (ptr32 Eq_283765) s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_283768 a4Out, Register out Eq_2 a5Out, Register out Eq_2 a6Out, Register out Eq_2 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_283597 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      x509_crt_verify_top.isra.7
//      x509_crt_verify_child
Eq_2 mbedtls_pk_verify_ext(Eq_2 ra, ptr32 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, Eq_283597 a6, Eq_2 a7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg44, Eq_2 dwArgA4, Eq_2 dwArgC4, Eq_2 dwArg0138, Eq_2 dwArg0198, struct Eq_283765 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_283768 & a4Out, union Eq_2 & a5Out, union Eq_2 & a6Out, union Eq_2 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_283597 & s6Out, ptr32 & s7Out, ptr32 & s8Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 s0_114;
	if (a2 != 0x00 && *a2 != 0x00)
	{
		s7 = a0;
		s2 = a7;
		s6 = a6;
		s5 = a5;
		s3 = a3;
		s1 = a2;
		if (mbedtls_pk_can_do(a2, a0, a5, out a5) != 0x00)
		{
			a5.u0 = 0x06;
			if (a0 != 0x06)
			{
				if (a1 == 0x00)
				{
					0x00 = (uint16) dwArg0198;
					Eq_2 a0_62;
					struct Eq_283765 * s0_63;
					ptr32 s8_64;
					Eq_283768 a4_70;
					Eq_2 a5_71;
					Eq_2 ra_72 = mbedtls_pk_verify(ra, a2, a3, dwArg0138, a5, a6, a7, dwArg00, dwArg44, dwArgA4, dwArgC4, out s0_63, out a0_62, out a4_70, out a5_71, out s8_64);
					s0Out = s0_63;
					s1Out = a2;
					a0Out = a0_62;
					a4Out = a4_70;
					a5Out = a5_71;
					a6Out.u0 = <invalid>;
					a7Out = a7;
					s2Out = a7;
					s3Out = a3;
					s4Out.u0 = <invalid>;
					s5Out = a5;
					s6Out = a6;
					s7Out = a0;
					s8Out = s8_64;
					s10Out = s10;
					s11Out = s11;
					mstatusOut = mstatus;
					return ra_72;
				}
				goto l230566B4;
			}
			if (a1 == 0x00)
				goto l230566B4;
			Eq_2 a0_79 = mbedtls_pk_get_bitlen(a2, 0x06, out a5) + 0x07 >> 3;
			if (a7 >= a0_79)
			{
				s1 = *((word32) a0_79 + 4);
				Eq_2 a0_96 = mbedtls_rsa_rsassa_pss_verify_ext(ra, a0_79, 0x00, 0x00, a3, a5, (word32) **((word16) a5.u0 + 4), a3, s10, s11, mstatus, a5, dwLoc3C, out a4, out a5, out a7, out s10, out s11, out mstatus);
				s0_114 = a0_96;
				if (a0_96 == 0x00 && mbedtls_pk_get_bitlen(s1, a5, out a5) + 0x07 >> 3 < a7)
					s0_114.u0 = 0xFC000700;
			}
			else
				s0_114.u0 = ~0x0400037F;
		}
		else
			s0_114.u0 = 0xFC000100;
l230566BA:
		0x00 = (uint16) dwArg0198;
		s0Out = dwArg0158;
		s1Out = s1;
		a0Out = s0_114;
		a4Out = a4;
		a5Out = a5;
		a6Out.u0 = <invalid>;
		a7Out = a7;
		s2Out = s2;
		s3Out = s3;
		s4Out.u0 = <invalid>;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = dwArgD4;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
l230566B4:
		s0_114.u0 = 0xFC000180;
		goto l230566BA;
	}
}

// 23056776: Register Eq_2 mbedtls_pk_debug(Register Eq_2 ra, Register word32 a0, Register (ptr32 Eq_283897) a5, Stack Eq_2 dwArg10, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out (ptr32 Eq_283897) a5Out)
// Called from:
//      mbedtls_debug_print_crt
Eq_2 mbedtls_pk_debug(Eq_2 ra, word32 a0, struct Eq_283897 * a5, Eq_2 dwArg10, ptr32 & a0Out, union Eq_2 & a2Out, struct Eq_283897 & a5Out)
{
	if (a0 != 0x00)
	{
		word32 a0_6 = a5->t0000;
		if (a5 != null)
		{
			struct Eq_283897 * a5_9 = a5->ptr002C;
			if (a5_9 == null)
			{
				a0Out = 0xFC000100;
				a2Out = a2;
				a5Out = a5_9;
				return ra;
			}
			else
			{
				struct Eq_283897 * a5_18;
				Eq_2 ra_19;
				a5_9();
				a0Out = 0x00;
				a2Out = dwArg10;
				a5Out = a5_18;
				return ra_19;
			}
		}
	}
	a0Out = 0xFC000180;
	a2Out = a2;
	a5Out = a5;
	return ra;
}

// 230567A0: void mbedtls_pk_get_name(Register ptr32 a0, Register word32 a5)
// Called from:
//      mbedtls_x509_crt_info
void mbedtls_pk_get_name(ptr32 a0, word32 a5)
{
	if (a0 == 0x00 || a5 == 0x00)
		;
}

// 230567B4: Register word32 mbedtls_pk_get_type(Register word32 a0, Register Eq_2 a5)
// Called from:
//      mbedtls_x509_crt_verify_with_profile
word32 mbedtls_pk_get_type(word32 a0, Eq_2 a5)
{
	if (a0 == 0x00 || a5 == 0x00)
		return 0x00;
	return (word32) *a5;
}

