pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 230567C6: Register word32 pk_use_ecparams(Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_283960) s4Out)
// Called from:
//      pk_parse_key_sec1_der
//      pk_parse_key_pkcs8_unencrypted_der
//      mbedtls_pk_parse_subpubkey
word32 pk_use_ecparams(Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, struct Eq_283960 & s4Out)
{
	Eq_2 a0_5 = *a4;
	if (a4 == 0x06)
	{
		ptr32 a0_26;
		byte bLoc11_63 = SLICE(s0, byte, 24);
		word32 a0_16;
		Eq_2 a4_20;
		ptr32 a3_19;
		Eq_2 a2_18;
		Eq_2 a1_17;
		Eq_2 a5_21;
		ptr32 s2_109;
		word32 s1_106 = mbedtls_oid_get_ec_grp(a0_5, fp + ~0x10, a2, 0x06, dwArg18, out a0_16, out a1_17, out a2_18, out a3_19, out a4_20, out a5_21, out s2_109);
		if (a0_16 == 0x00)
		{
			a5_21 = (word32) *a1;
			a1_17 = (word32) bLoc11_63;
			if (a5_21 != 0x00 && a5_21 != a1_17)
				a0_26 = 0xFC000300;
			else
				mbedtls_ecp_group_load(a1, a2_18, a4_20, mstatus, dwLoc08, dwArg24, dwArgE8, dwArgF8, dwArg0108, dwArg0128, dwArg0138, dwArg0148, out s1_106, out a0_26, out a1_17, out a2_18, out a3_19, out a4_20, out a5_21, out s2_109, out s4);
		}
		else
			a0_26 = 0xFC000600;
		a0Out = a0_26;
		a1Out = a1_17;
		a2Out = a2_18;
		a3Out = a3_19;
		a4Out = a4_20;
		a5Out = a5_21;
		s2Out = s2_109;
		s4Out = s4;
		return s1_106;
	}
	else
	{
		a0Out = 0xFC000300;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out.u0 = 0x06;
		s2Out = s2;
		s4Out = s4;
		return s1;
	}
}

// 23056814: Register Eq_2 pk_parse_key_pkcs1_der(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out)
// Called from:
//      pk_parse_key_pkcs8_unencrypted_der
//      mbedtls_pk_parse_key
Eq_2 pk_parse_key_pkcs1_der(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, Eq_2 s2, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_2 & s6Out, union Eq_2 & s7Out, union Eq_2 & s10Out, union Eq_2 & s11Out)
{
	ptr32 s0_304;
	word32 s0_105;
	Eq_2 s1_284 = a0;
	word32 a2_537;
	word32 a1_536;
	Eq_2 a5_281;
	Eq_2 a4_280;
	ptr32 a3_279;
	word32 a0_24 = mbedtls_asn1_get_tag(a1 + a2, fp + -40, 48, a5, out a1_536, out a2_537, out a3_279, out a4_280, out a5_281);
	if (a0_24 == 0x00)
	{
		s2 += a5_281;
		word32 a1_538;
		mbedtls_asn1_get_int(s2, a0, a5_281, out s1_284, out a0_24, out a1_538, out a3_279, out a4_280, out a5_281);
		if (a0_24 == 0x00)
		{
			s1_284 = *a5_281;
			if (a5_281 != 0x00)
			{
				s0_304 = 0xFC000280;
				goto l2305683C;
			}
			word32 a0_57;
			word32 s4_541;
			word32 a1_540;
			word32 s0_539;
			Eq_2 s1_117;
			Eq_2 a5_114;
			Eq_2 a4_113;
			Eq_2 a2_111;
			ra = mbedtls_asn1_get_mpi(ra, s2, a5_281, mstatus, dwArg34, dwArg88, dwArg98, dwArgC8, dwArgD8, dwArg0108, dwArg0118, out s0_539, out s1_117, out a0_57, out a1_540, out a2_111, out a4_113, out a5_114, out s2, out s3, out s4_541);
			s0_105 = a0_57;
			if (a0_57 == 0x00)
			{
				word32 a0_83;
				word32 s4_544;
				word32 a1_543;
				word32 s0_542;
				ra = mbedtls_asn1_get_mpi(ra, s2, a5_114, mstatus, dwArg34, dwArg88, dwArg98, dwArgC8, dwArgD8, dwArg0108, dwArg0118, out s0_542, out s1_117, out a0_83, out a1_543, out a2_111, out a4_113, out a5_114, out s2, out s3, out s4_544);
				s0_105 = a0_83;
				if (a0_83 == 0x00)
				{
					word32 a0_109;
					word32 s4_547;
					word32 a1_546;
					word32 s0_545;
					ra = mbedtls_asn1_get_mpi(ra, s2, a5_114, mstatus, dwArg34, dwArg88, dwArg98, dwArgC8, dwArgD8, dwArg0108, dwArg0118, out s0_545, out s1_117, out a0_109, out a1_546, out a2_111, out a4_113, out a5_114, out s2, out s3, out s4_547);
					s0_105 = a0_109;
					if (a0_109 == 0x00)
					{
						word32 a0_135;
						word32 s0_548;
						word32 a1_549;
						word32 s4_550;
						ra = mbedtls_asn1_get_mpi(ra, s2, a5_114, mstatus, dwArg34, dwArg88, dwArg98, dwArgC8, dwArgD8, dwArg0108, dwArg0118, out s0_548, out s1_117, out a0_135, out a1_549, out a2_111, out a4_113, out a5_114, out s2, out s3, out s4_550);
						s0_105 = a0_135;
						if (a0_135 == 0x00)
						{
							word32 a0_161;
							word32 s0_551;
							word32 a1_552;
							word32 s4_553;
							ra = mbedtls_asn1_get_mpi(ra, s2, a5_114, mstatus, dwArg34, dwArg88, dwArg98, dwArgC8, dwArgD8, dwArg0108, dwArg0118, out s0_551, out s1_117, out a0_161, out a1_552, out a2_111, out a4_113, out a5_114, out s2, out s3, out s4_553);
							s0_105 = a0_161;
							if (a0_161 == 0x00)
							{
								word32 a0_187;
								word32 s0_554;
								word32 a1_555;
								word32 s4_556;
								ra = mbedtls_asn1_get_mpi(ra, s2, a5_114, mstatus, dwArg34, dwArg88, dwArg98, dwArgC8, dwArgD8, dwArg0108, dwArg0118, out s0_554, out s1_117, out a0_187, out a1_555, out a2_111, out a4_113, out a5_114, out s2, out s3, out s4_556);
								s0_105 = a0_187;
								if (a0_187 == 0x00)
								{
									word32 a0_213;
									word32 s0_557;
									word32 a1_558;
									word32 s4_559;
									ra = mbedtls_asn1_get_mpi(ra, s2, a5_114, mstatus, dwArg34, dwArg88, dwArg98, dwArgC8, dwArgD8, dwArg0108, dwArg0118, out s0_557, out s1_117, out a0_213, out a1_558, out a2_111, out a4_113, out a5_114, out s2, out s3, out s4_559);
									s0_105 = a0_213;
									if (a0_213 == 0x00)
									{
										word32 a0_239;
										Eq_2 s4_248;
										word32 s0_560;
										word32 a1_561;
										ra = mbedtls_asn1_get_mpi(ra, s2, a5_114, mstatus, dwArg34, dwArg88, dwArg98, dwArgC8, dwArgD8, dwArg0108, dwArg0118, out s0_560, out s1_117, out a0_239, out a1_561, out a2_111, out a4_113, out a5_114, out s2, out s3, out s4_248);
										s0_105 = a0_239;
										if (a0_239 == 0x00)
										{
											Eq_2 a4_267;
											Eq_2 a5_268;
											word32 a1_562;
											word32 a3_563;
											*((word32) mbedtls_mpi_size(a2_111, a4_113, a5_114, out a1_562, out a3_563, out a4_267, out a5_268) + 4) = s1_117;
											if (a5_268 != s2)
											{
												s1_284 = mbedtls_rsa_free(s1_117, dwArgB4, a4_267, a5_268, mstatus, s2, dwArg0108, dwArg0118, dwArg0148, dwArg0158, out a3_279, out a4_280, out a5_281);
												s0_304 = 0xFC00029A;
											}
											else
											{
												ptr32 a0_276;
												Eq_2 a2_278;
												ra = mbedtls_rsa_check_privkey(ra, s1_117, dwArgB4, a4_267, a5_268, s2, s4_248, s6, s7, s10, s11, mstatus, dwLoc28, dwLoc08, dwArg08, dwArg18, dwArg24, dwArg28, dwArg34, dwArg38, dwArg44, dwArg48, a1, dwArg58, dwArg74, dwArg98, dwArgA8, out s1_284, out a0_276, out a2_278, out a3_279, out a4_280, out a5_281, out s2, out s3, out s6, out s7, out s10, out s11);
												s0_304 = a0_276;
												if (a0_276 != 0x00)
													s1_284 = mbedtls_rsa_free(s1_284, a2_278, a4_280, a5_281, mstatus, s2, dwArg0108, dwArg0118, dwArg0148, dwArg0158, out a3_279, out a4_280, out a5_281);
											}
l2305683C:
											0x00 = (uint16) dwArg0128;
											s0Out = dwArgE4;
											s1Out = s1_284;
											a0Out = s0_304;
											a2Out = dwArg0100;
											a3Out = a3_279;
											a4Out = a4_280;
											a5Out = a5_281;
											s2Out = s2;
											s3Out = s3;
											s6Out = s6;
											s7Out = s7;
											s10Out = s10;
											s11Out = s11;
											return ra;
										}
									}
								}
							}
						}
					}
				}
			}
			s1_284 = mbedtls_rsa_free(s1_117, a2_111, a4_113, a5_114, mstatus, s2, dwArg0108, dwArg0118, dwArg0148, dwArg0158, out a3_279, out a4_280, out a5_281);
			a0_24.u0 = 0xFC000300;
l2305683A:
			s0_304 = (ptr32) ((word16) a0_24.u0 + s0_105);
			goto l2305683C;
		}
	}
	s0_105 = 0xFC000300;
	goto l2305683A;
}

// 23056928: Register Eq_2 pk_parse_key_sec1_der(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      pk_parse_key_pkcs8_unencrypted_der
//      mbedtls_pk_parse_key
Eq_2 pk_parse_key_sec1_der(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a2, Eq_2 a5, Eq_2 s2, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s6Out, union Eq_2 & s7Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 s0_112;
	Eq_2 s0_107;
	Eq_2 s1_154 = a0;
	word32 a1_820;
	word32 a2_821;
	Eq_2 a5_190;
	Eq_2 a4_111;
	Eq_2 a3_188;
	word32 a0_185 = mbedtls_asn1_get_tag(a1 + a2, fp + -52, 48, a5, out a1_820, out a2_821, out a3_188, out a4_111, out a5_190);
	if (a0_185 != 0x00)
	{
l23056948:
		s0_107.u0 = 0xFC000300;
		goto l23056996;
	}
	s2 += a5_190;
	word32 a1_822;
	mbedtls_asn1_get_int(s2, fp + -56, a5_190, out s1_154, out a0_185, out a1_822, out a3_188, out a4_111, out a5_190);
	if (a0_185 != 0x00)
		goto l23056948;
	a5_190.u0 = 0x01;
	if (a4_111 != 0x01)
	{
		s0_112.u0 = 0xFC000280;
		goto l23056998;
	}
	Eq_2 a1_59;
	word32 a2_823;
	a0_185 = mbedtls_asn1_get_tag(s2, fp + -52, 0x04, 0x01, out a1_59, out a2_823, out a3_188, out a4_111, out a5_190);
	if (a0_185 != 0x00)
		goto l23056948;
	Eq_2 a0_69;
	word32 a5_74;
	word32 s0_824;
	word32 a1_825;
	word32 a3_826;
	word32 a7_827;
	word32 s8_828;
	Eq_2 s4_160;
	Eq_2 a4_105;
	Eq_2 a2_103;
	ra = mbedtls_mpi_read_binary(ra, a1_59, dwArg44, a3_188, a4_111, mstatus, a1, s2, dwArg98, dwArgA8, dwArgD8, dwArgE8, dwArg0118, dwArg0128, out s0_824, out s1_154, out a0_69, out a1_825, out a2_103, out a3_826, out a4_105, out a5_74, out a7_827, out s2, out s3, out s4_160, out s8_828);
	s0_107 = a0_69;
	if (a0_69 != 0x00)
	{
l2305698A:
		s1_154 = mbedtls_ecp_keypair_free(s1_154, a2_103, a4_105, mstatus, dwLoc30, dwLoc18, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out a3_188, out a4_111, out a5_190, out s2);
		a0_185.u0 = 0xFC000300;
l23056996:
		s0_112 = s0_107 + a0_185;
		goto l23056998;
	}
	Eq_2 a2_110;
	Eq_2 a5_211;
	Eq_2 a5_94 = (word32) a4_105 + a5_74;
	Eq_2 dwLoc38_440 = a5_94;
	if (a5_94 != s2)
	{
		Eq_2 a5_108;
		byte * a5_106;
		word32 a3_830;
		word32 a1_829;
		Eq_2 a0_100 = mbedtls_asn1_get_tag(s2, fp + -52, 0x00A0, a5_94, out a1_829, out a2_103, out a3_830, out a4_105, out a5_106);
		s0_107 = a0_100;
		if (a0_100 == 0x00)
		{
			Eq_2 a5_113 = (word32) *a5_106;
			a2_110 = dwLoc3C;
			a4_111.u0 = 0x06;
			s0_112 = a0_100 + a5_106;
			dwArg48 = a5_113;
			if (a5_113 != 0x06)
			{
				s0_112.u0 = 0xFC00029E;
				goto l230569FC;
			}
			word32 a5_127;
			word32 a3_832;
			word32 a1_831;
			Eq_2 a0_121 = mbedtls_asn1_get_tag(s0_112, fp + -40, 0x06, a5_113, out a1_831, out a2_110, out a3_832, out a4_111, out a5_127);
			if (a0_121 != 0x00)
			{
				s0_112 = (word32) a0_121 - 0x03FFFD00;
				if (a0_121 != 0xFC000300)
					goto l230569FC;
			}
			else
			{
				Eq_2 a5_131 = (word16) a4_111.u0 + a5_127;
				dwLoc38_440 = a5_131;
				if (s0_112 != a5_131)
				{
					s0_112.u0 = 0xFC00029A;
					goto l230569FC;
				}
			}
			Eq_2 a0_147;
			word32 a3_834;
			word32 a1_833;
			s1_154 = pk_use_ecparams(s0_112, s1_154, a2_110, a4_111, mstatus, s2, dwLoc1C, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, out a0_147, out a1_833, out a2_110, out a3_834, out a4_111, out a5_108, out s2, out s4_160);
			s0_112 = a0_147;
			if (a0_147 != 0x00)
				goto l230569FC;
		}
		else
		{
			a5_108.u0 = -98;
			if (a0_100 != -98)
				goto l2305698A;
		}
		Eq_2 a5_175;
		word32 a1_835;
		word32 a3_836;
		Eq_2 a0_169 = mbedtls_asn1_get_tag(s2, fp + -52, 161, a5_108, out a1_835, out a2_103, out a3_836, out a4_105, out a5_175);
		s0_107 = a0_169;
		if (a0_169 == 0x00)
		{
			word32 s0_183 = a0_169 + a5_175;
			word32 a2_838;
			word32 a1_837;
			s1_154 = mbedtls_asn1_get_bitstring_null(s0_183, fp + -52, a5_175, out a0_185, out a1_837, out a2_838, out a3_188, out a4_111, out a5_190);
			if (a0_185 != 0x00)
				goto l23056948;
			a5_190 += dwArgA4;
			if (s0_183 != a5_190)
			{
				s0_112.u0 = 0xFC00029A;
				goto l23056998;
			}
			word32 a1_839;
			Eq_2 s0_213;
			word32 a0_206;
			ra = mbedtls_ecp_point_read_binary(ra, s0_183, (word32) s1_154 + 0x0088, dwArgA4, s0_183 - dwArgA4, a4_111, (word32) s1_154 + 0x0088, mstatus, dwLoc40, dwLoc3C, s2, dwLoc18, dwLoc08, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, dwArg0138, out s0_213, out s1_154, out a0_206, out a1_839, out a2_103, out a3_188, out a4_111, out a5_211, out s2, out s3, out s4_160);
			if (a0_206 == 0x00)
			{
				word32 s5_841;
				word32 a1_840;
				ra = mbedtls_ecp_check_pubkey(ra, s1_154, s1_154, s2, a2_103, s4_160, s6, s7, s10, s11, mstatus, dwLoc3C, dwLoc38_440, s2, dwLoc18, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg48, s1, dwArg64, dwArg68, dwArg78, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArg0108, dwArg0118, out s0_213, out s1_154, out a0_206, out a1_840, out a2_103, out a3_188, out a4_111, out a5_211, out s2, out s3, out s4_160, out s5_841, out s6, out s7, out s10, out s11, out mstatus);
			}
			dwLoc38_440 = s0_213;
			if (a0_206 == 0x00)
			{
l23056AAC:
				Eq_2 a0_345;
				s1_154 = mbedtls_ecp_check_privkey(a2_103, a5_211, out a0_345, out a2_110, out a3_188, out a4_111, out a5_190);
				s0_112 = a0_345;
				if (a0_345 == 0x00)
					goto l23056998;
l230569FC:
				s1_154 = mbedtls_ecp_keypair_free(s1_154, a2_110, a4_111, mstatus, dwLoc30, dwLoc18, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out a3_188, out a4_111, out a5_190, out s2);
				goto l23056998;
			}
			a5_190.u0 = 0xFB000180;
			if (a0_206 != 0xFB000180)
			{
				s0_112.u0 = 0xFC000300;
l23056998:
				s1Out = s1_154;
				a0Out = s0_112;
				a2Out = dwArg0138;
				a3Out = a3_188;
				a4Out = a4_111;
				a5Out = a5_190;
				s2Out = s2;
				s3Out = s3;
				s6Out = s6;
				s7Out = s7;
				s10Out = s10;
				s11Out = s11;
				mstatusOut = mstatus;
				return ra;
			}
		}
		else if (a0_169 != -98)
			goto l2305698A;
	}
	Eq_2 a0_307;
	ra = mbedtls_ecp_mul(ra, s1_154, (word32) s1_154 + 0x0088, s3, (word32) s1_154 + 40, 0x00, s2, s4_160, s7, s10, s11, mstatus, dwLoc40, dwLoc3C, dwLoc38_440, s2, dwLoc18, dwArg08, dwArg18, dwArg38, dwArg44, dwArg48, s1, dwArg68, dwArg74, dwArg78, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgE8, dwArgF8, out s1_154, out a0_307, out a2_103, out a4_105, out a5_211, out s2, out s3, out s6, out s7, out s10, out s11, out mstatus);
	s0_107 = a0_307;
	if (a0_307 != 0x00)
		goto l2305698A;
	goto l23056AAC;
}

// 23056ACC: Register Eq_2 pk_get_pk_alg(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      pk_parse_key_pkcs8_unencrypted_der
//      mbedtls_pk_parse_subpubkey
Eq_2 pk_get_pk_alg(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	ptr32 a0_116;
	ptr32 a5_127;
	Eq_2 a5_30;
	word32 a4_171;
	word32 a1_168;
	word32 a3_170;
	word32 a2_169;
	word32 a0_167;
	word32 t1_166;
	Eq_2 ra_31 = memset(ra, a3, 0x00, 0x0C, out t1_166, out a0_167, out a1_168, out a2_169, out a3_170, out a4_171, out a5_30);
	Eq_2 a2_39;
	Eq_2 a5_42;
	ptr32 s3_47;
	ptr32 s4_48;
	word32 a0_52;
	ptr32 a4_124;
	ptr32 a3_121;
	ptr32 a1_118;
	ptr32 s2_138;
	Eq_2 s1_135 = mbedtls_asn1_get_alg(a1, fp + -44, a3, a5_30, dwArg84, dwArgF8, out a0_52, out a1_118, out a2_39, out a3_121, out a4_124, out a5_42, out s2_138, out s3_47, out s4_48);
	if (a0_52 != 0x00)
	{
		a5_127 = 0xFC000580;
		a0_116 = a0_52 + 0xFC000580;
	}
	else
	{
		s1_135 = mbedtls_oid_get_pk_alg(fp + -44, s1_135, a2_39, a5_42, dwArg08, out a0_116, out a1_118, out a3_121, out a4_124, out a5_127, out s2_138);
		if (a0_116 == 0x00)
		{
			a4_124 = (word32) *s1_135;
			a5_127 = 0x01;
			if (a4_124 == 0x01)
			{
				a4_124 = 0x05;
				if (true && true || true)
					a0_116 = 0xFC000580;
			}
		}
		else
			a0_116 = 0xFC000380;
	}
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_135;
	a0Out = a0_116;
	a1Out = a1_118;
	a3Out = a3_121;
	a4Out = a4_124;
	a5Out = a5_127;
	s2Out = s2_138;
	s3Out = s3_47;
	s4Out = s4_48;
	return ra_31;
}

