pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 23056B40: Register Eq_2 pk_parse_key_pkcs8_unencrypted_der(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register ptr32 a2, Register Eq_2 a5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_pk_parse_key
Eq_2 pk_parse_key_pkcs8_unencrypted_der(Eq_2 ra, Eq_2 s0, Eq_2 a1, ptr32 a2, Eq_2 a5, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_2 & s6Out, union Eq_2 & s7Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 s0_119;
	Eq_2 s1_112 = a0;
	word32 a2_426;
	word32 a1_425;
	ptr32 a4_109;
	ptr32 a3_108;
	Eq_2 a5_101;
	Eq_2 a0_204 = mbedtls_asn1_get_tag((word32) a1 + a2, fp + -36, 48, a5, out a1_425, out a2_426, out a3_108, out a4_109, out a5_101);
	byte bLoc29_234 = SLICE((uint32) nLoc2C, byte, 24);
	if (a0_204 != 0x00)
	{
l23056B60:
		s0_119 = (word32) a0_204 - 0x03FFFD00;
		goto l23056B68;
	}
	word32 a1_427;
	mbedtls_asn1_get_int(s0 + a5_101, fp + -40, a5_101, out s1_112, out a0_204, out a1_427, out a3_108, out a4_109, out a5_101);
	if (a0_204 != 0x00)
		goto l23056B60;
	if (a5_101 != 0x00)
	{
		s0_119.u0 = 0xFC000280;
		goto l23056B68;
	}
	Eq_2 s0_61;
	word32 s4_429;
	word32 a1_428;
	ra = pk_get_pk_alg(ra, dwArgB4, fp + -28, a1, dwArg54, dwArgC8, dwArgF8, out s0_61, out s1_112, out a0_204, out a1_428, out a3_108, out a4_109, out a5_101, out s2, out s3, out s4_429);
	if (a0_204 != 0x00)
		goto l23056B60;
	word32 a2_431;
	word32 a1_430;
	a0_204 = mbedtls_asn1_get_tag(s0_61, fp + -36, 0x04, a5_101, out a1_430, out a2_431, out a3_108, out a4_109, out a5_101);
	if (a0_204 != 0x00)
		goto l23056B60;
	if (a5_101 == 0x00)
	{
		s0_119.u0 = 0xFC0002A0;
		goto l23056B68;
	}
	ptr32 a0_86 = mbedtls_pk_info_from_type((word32) bLoc29_234, out a5_101);
	if (a0_86 == 0x00)
	{
l23056BB8:
		s0_119.u0 = 0xFC000380;
		goto l23056B68;
	}
	Eq_2 a0_90;
	Eq_2 a1_91;
	Eq_2 a2_92;
	ra = mbedtls_pk_setup(ra, s0_61, s1_112, s1_112, a0_86, a5_101, out s1_112, out a0_90, out a1_91, out a2_92, out a5_101);
	s0_119 = a0_90;
	if (a0_90 != 0x00)
		goto l23056B68;
	Eq_2 a0_127;
	Eq_2 a5_98 = (word32) bLoc29_234;
	a4_109 = 0x01;
	if (a5_98 == 0x01)
	{
		word32 a2_433;
		word32 s0_432;
		ra = pk_parse_key_pkcs1_der(ra, a0_90, a1_91, dwArg54, a5_98, s2, s6, s7, s10, s11, mstatus, a1, dwLoc18, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg14, dwArg18, dwArg28, dwArg44, dwArg58, dwArg68, dwArg78, dwArg84, dwArg98, dwArgA8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0128, out s0_432, out s1_112, out a0_127, out a2_433, out a3_108, out a4_109, out a5_101, out s2, out s3, out s6, out s7, out s10, out s11);
	}
	else
	{
		a5_101 = (word32) a5_98 - 2 & 0x00FF;
		if (a5_101 > 0x01)
			goto l23056BB8;
		Eq_2 a0_105;
		Eq_2 a1_106;
		word32 s4_437;
		word32 a2_436;
		s1_112 = pk_use_ecparams(a0_90, a1_91, a2_92, 0x01, mstatus, dwLoc18, dwLoc0C, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, out a0_105, out a1_106, out a2_436, out a3_108, out a4_109, out a5_101, out s2, out s4_437);
		s0_119 = a0_105;
		if (a0_105 != 0x00)
		{
l23056BE2:
			word32 a2_435;
			word32 a0_434;
			ra = mbedtls_pk_free(ra, s1_112, a5_101, out a0_434, out a2_435, out a5_101);
			goto l23056B68;
		}
		word32 a2_438;
		ra = pk_parse_key_sec1_der(ra, *((word32) a0_105 + 4), a1_106, dwArg54, a5_101, s2, s6, s7, s10, s11, mstatus, a1, dwLoc18, dwLoc08, dwArg08, dwArg14, dwArg18, dwArg34, dwArg38, dwArg44, dwArg48, dwArg58, ra, dwArg68, dwArg74, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s1_112, out a0_127, out a2_438, out a3_108, out a4_109, out a5_101, out s2, out s3, out s6, out s7, out s10, out s11, out mstatus);
	}
	s0_119 = a0_127;
	if (a0_127 == 0x00)
	{
l23056B68:
		s0Out = dwArgE4;
		s1Out = s1_112;
		a0Out = s0_119;
		a2Out = dwArg0100;
		a3Out = a3_108;
		a4Out = a4_109;
		a5Out = a5_101;
		s2Out = s2;
		s3Out = s3;
		s6Out = s6;
		s7Out = s7;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	goto l23056BE2;
}

// 23056C1C: Register Eq_2 mbedtls_pk_load_file(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_2) s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out Eq_2 s8Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_pk_parse_keyfile
//      mbedtls_x509_crt_parse_file
Eq_2 mbedtls_pk_load_file(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, union Eq_2 & s8Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	ptr32 a3_199;
	ptr32 a4_200;
	ptr32 a1_196;
	ptr32 s1_175;
	ptr32 s10_120;
	union Eq_2 * s2_176;
	ptr32 s3_177;
	ptr32 s11_121;
	ptr32 s6_183;
	ptr32 s7_127;
	ptr32 s5_182;
	ptr32 a5_206;
	Eq_2 s1_35;
	Eq_2 s2_38;
	Eq_2 a0_51;
	struct Eq_7032 * s2_62;
	ptr32 mstatus_75;
	word32 a0_477;
	word32 a1_478;
	word32 a2_479;
	word32 a3_480;
	word32 a4_481;
	word32 a5_482;
	word32 a7_483;
	word32 s3_484;
	word32 s4_485;
	word32 s5_486;
	word32 s6_487;
	word32 s7_488;
	word32 s8_489;
	word32 s9_490;
	word32 s10_491;
	word32 s11_492;
	word32 t4_493;
	word32 s0_494;
	word32 a4_495;
	word32 a5_496;
	word32 s3_497;
	word32 s6_498;
	Eq_2 a3_236;
	Eq_2 ra_164 = aos_open(printf(ra, &g_t23088B64, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_35, out a0_477, out a1_478, out a2_479, out a3_480, out a4_481, out a5_482, out a7_483, out s2_38, out s3_484, out s4_485, out s5_486, out s6_487, out s7_488, out s8_489, out s9_490, out s10_491, out s11_492, out t4_493), s1_35, s2_38, mstatus, s4, s3, s1, dwArgD8, dwArg0118, dwArg0158, out s0_494, out a0_51, out a3_236, out a4_495, out a5_496, out s2_62, out s3_497, out s6_498, out mstatus_75);
	if (a0_51 >= 0x00)
	{
		word32 a0_82;
		Eq_2 a3_85;
		Eq_2 a4_86;
		Eq_2 a2_89;
		word32 s0_507;
		ra_164 = aos_lseek(ra_164, a0_51, 0x00, dwLoc20, dwArg24, out s0_507, out a0_82, out a2_89, out a3_85, out a4_86);
		if (a0_82 == ~0x00)
		{
			word32 a2_519;
			word32 a4_520;
			word32 a5_521;
			word32 s2_522;
			word32 s3_523;
			word32 s5_524;
			word32 s6_525;
			aos_close(ra_164, a0_51, a2_89, a3_85, a4_86, s2_62, mstatus_75, dwArg18, out a2_519, out a3_236, out a4_520, out a5_521, out s2_522, out s3_523, out s5_524, out s6_525);
			goto l23056C6A;
		}
		Eq_2 a3_99;
		word32 * s0_105;
		word32 a0_508;
		word32 a2_509;
		word32 a4_510;
		Eq_2 ra_104 = aos_lseek(ra_164, a0_51, 0x00, dwLoc20, dwArg24, out s0_105, out a0_508, out a2_509, out a3_99, out a4_510);
		*s0_105 = a0_82;
		Eq_2 a5_111;
		word32 a1_113;
		word32 s4_124;
		word32 a0_511;
		word32 a7_512;
		word32 s3_513;
		word32 s5_514;
		word32 s6_515;
		word32 s8_516;
		word32 s9_517;
		word32 t4_518;
		Eq_2 s1_119;
		struct Eq_7032 * s2_122;
		Eq_2 a4_116;
		Eq_2 a3_115;
		Eq_2 a2_114;
		Eq_2 ra_118 = printf(ra_104, &g_t23088B74, a3_99, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_119, out a0_511, out a1_113, out a2_114, out a3_115, out a4_116, out a5_111, out a7_512, out s2_122, out s3_513, out s4_124, out s5_514, out s6_515, out s7_127, out s8_516, out s9_517, out s10_120, out s11_121, out t4_518);
		if (a1_113 == s4_124)
		{
l23056CB8:
			Eq_2 a3_263;
			word32 a2_532;
			word32 a4_533;
			word32 a5_534;
			word32 s2_535;
			word32 s3_536;
			word32 s5_537;
			word32 s6_538;
			aos_close(ra_118, s1_119, a2_114, a3_115, a4_116, s2_122, mstatus_75, dwArg18, out a2_532, out a3_263, out a4_533, out a5_534, out s2_535, out s3_536, out s5_537, out s6_538);
			word32 a0_539;
			word32 a2_540;
			word32 a5_541;
			word32 a7_542;
			word32 s4_543;
			word32 s8_544;
			word32 s9_545;
			word32 t4_546;
			ra_164 = printf(ra_118, &g_t23078A44, a3_263, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_175, out a0_539, out a1_196, out a2_540, out a3_199, out a4_200, out a5_541, out a7_542, out s2_176, out s3_177, out s4_543, out s5_182, out s6_183, out s7_127, out s8_544, out s9_545, out s10_120, out s11_121, out t4_546);
			a5_206 = 0xFC000080;
			goto l23056C84;
		}
		word32 s0_526;
		word32 a1_527;
		word32 a5_528;
		word32 s3_529;
		word32 s4_530;
		word32 s8_531;
		ra_118 = mycalloc(ra_118, s1_119, 0x01, a1_113 + 0x01, a3_115, a4_116, a5_111, mstatus_75, dwArg00, dwArg04, dwArgF8, dwArg0138, out s0_526, out s1_119, out a1_527, out a2_114, out a3_115, out a4_116, out a5_528, out s2_122, out s3_529, out s4_530, out s8_531);
		s2_122->dw0000 = 0x01;
		if (false)
			goto l23056CB8;
		word32 a0_156;
		word32 a5_157;
		Eq_2 a2_159;
		Eq_2 a4_163;
		word32 s0_547;
		word32 a1_548;
		ra_164 = aos_read(ra_118, s1_119, 0x01, a4_116, dwLoc20, dwArg24, out s0_547, out a0_156, out a1_548, out a2_159, out a4_163, out a5_157);
		if (a0_156 == a5_157)
		{
			int32 a4_173;
			word32 a2_549;
			word32 a3_550;
			word32 a5_551;
			s1_175 = aos_close(ra_164, s1_119, a2_159, a3_115, a4_163, s2_122, mstatus_75, dwArg18, out a2_549, out a3_550, out a4_173, out a5_551, out s2_176, out s3_177, out s5_182, out s6_183);
			*((char *) *s2_176 + a4_173) = (union Eq_2 *) 0x00;
			a5_206 = 0x00;
			word32 a5_552;
			if (strstr(ra_164, *s2_176, 0x23088B88, out a1_196, out a3_199, out a4_200, out a5_552) != 0x00)
			{
				*(union Eq_2 *) 0x01 = null;
				a5_206 = 0x00;
			}
l23056C84:
			s1Out = s1_175;
			a0Out = a5_206;
			a1Out = a1_196;
			a2Out = dwArg48;
			a3Out = a3_199;
			a4Out = a4_200;
			a5Out = a5_206;
			s2Out = s2_176;
			s3Out = s3_177;
			s4Out = dwArg04;
			s5Out = s5_182;
			s6Out = s6_183;
			s7Out = s7_127;
			s8Out = s4;
			s10Out = s10_120;
			s11Out = s11_121;
			mstatusOut = mstatus_75;
			return ra_164;
		}
		Eq_2 a2_213;
		Eq_2 a5_214;
		union Eq_2 * s2_221;
		word32 a3_553;
		word32 a4_554;
		word32 s3_555;
		word32 s5_556;
		word32 s6_557;
		aos_close(ra_164, s1_119, a2_159, a3_115, a4_163, s2_122, mstatus_75, dwArg18, out a2_213, out a3_553, out a4_554, out a5_214, out s2_221, out s3_555, out s5_556, out s6_557);
		word32 s0_558;
		word32 s1_559;
		word32 a0_560;
		word32 a1_561;
		word32 a2_562;
		word32 a4_563;
		word32 a5_564;
		word32 a6_565;
		word32 s4_566;
		word32 t3_567;
		vPortFree(*s2_221, a2_213, a5_214, mstatus_75, dwArg0138, dwArg0178, out s0_558, out s1_559, out a0_560, out a1_561, out a2_562, out a3_236, out a4_563, out a5_564, out a6_565, out s4_566, out t3_567);
	}
l23056C6A:
	word32 a0_499;
	word32 a2_500;
	word32 a5_501;
	word32 a7_502;
	word32 s4_503;
	word32 s8_504;
	word32 s9_505;
	word32 t4_506;
	ra_164 = printf(ra_164, &g_t23078A44, a3_236, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_175, out a0_499, out a1_196, out a2_500, out a3_199, out a4_200, out a5_501, out a7_502, out s2_176, out s3_177, out s4_503, out s5_182, out s6_183, out s7_127, out s8_504, out s9_505, out s10_120, out s11_121, out t4_506);
	a5_206 = 0xFC000200;
	goto l23056C84;
}

// 23056D40: Register Eq_2 mbedtls_pk_parse_subpubkey(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 int32) a0, Register Eq_2 a1, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0198, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s5Out, Register out Eq_285836 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_x509_crt_parse_der
Eq_2 mbedtls_pk_parse_subpubkey(Eq_2 ra, Eq_2 s1, int32 * a0, Eq_2 a1, Eq_2 a5, Eq_2 s2, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0198, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s5Out, union Eq_285836 & s6Out, union Eq_2 & s7Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a5_108;
	Eq_2 s1_132;
	Eq_2 dwLoc38_351 = (uint32) nLoc38;
	word32 a5_35;
	word32 a4_587;
	word32 a2_585;
	word32 a3_586;
	ptr32 a1_104;
	Eq_2 a0_29 = mbedtls_asn1_get_tag(a1, fp + -52, 48, a5, out a1_104, out a2_585, out a3_586, out a4_587, out a5_35);
	byte bLoc35_354 = SLICE(dwLoc38_351, byte, 24);
	if (a0_29 != 0x00)
	{
		a5_108.u0 = 0xFC000300;
		goto l23056D6C;
	}
	Eq_2 a0_43;
	Eq_2 s0_51;
	word32 a4_590;
	word32 a3_589;
	word32 s1_588;
	union Eq_2 * s3_220;
	Eq_2 s4_116;
	ra = pk_get_pk_alg(ra, *a0 + a5_35, fp + -44, dwLoc38_351, dwArg44, dwArgB8, dwArgE8, out s0_51, out s1_588, out a0_43, out a1_104, out a3_589, out a4_590, out a5_108, out s2, out s3_220, out s4_116);
	s1_132 = a0_43;
	if (a0_43 != 0x00)
		goto l23056D70;
	word32 a4_69;
	word32 a3_592;
	word32 a2_591;
	word32 a5_593;
	Eq_2 s1_72 = mbedtls_asn1_get_bitstring_null(s2, fp + -52, a5_108, out a0_29, out a1_104, out a2_591, out a3_592, out a4_69, out a5_593);
	if (a0_29 != 0x00)
	{
		a5_108.u0 = 0xFC000500;
l23056D6C:
		s1_132 = a0_29 + a5_108;
		goto l23056D70;
	}
	a5_108 = (char *) *s3_220 + a4_69;
	if (s2 != a5_108)
	{
		s1_132.u0 = 0xFC00049A;
		goto l23056D70;
	}
	ptr32 a0_80 = mbedtls_pk_info_from_type((word32) bLoc35_354, out a5_108);
	a1_104 = a0_80;
	if (a0_80 == 0x00)
	{
		s1_132.u0 = 0xFC000380;
		goto l23056D70;
	}
	Eq_2 a0_86;
	Eq_2 a2_88;
	word32 s1_594;
	ra = mbedtls_pk_setup(ra, s0_51, s1_72, s4_116, a0_80, a5_108, out s1_594, out a0_86, out a1_104, out a2_88, out a5_108);
	s1_132 = a0_86;
	if (a0_86 == 0x00)
	{
		Eq_2 s0_117;
		Eq_2 a5_94 = (word32) bLoc35_354;
		if (a5_94 == 0x01)
		{
			Eq_2 s0_190 = *((word32) s4_116 + 4);
			word32 a4_196;
			word32 a3_596;
			word32 a2_595;
			Eq_2 a0_191 = mbedtls_asn1_get_tag(s2, fp + -48, 48, a5_94, out a1_104, out a2_595, out a3_596, out a4_196, out a5_108);
			if (a0_191 != 0x00)
			{
l23056DF6:
				s0_117 = (word32) a0_191 - 0x03FFFB00;
				if (s0_117 != 0x00)
					goto l23056E00;
				goto l23056E52;
			}
			a5_108 = (char *) *s3_220 + a4_196;
			if (s2 != a5_108)
				goto l23056E16;
			s5 = (word32) s0_190 + 8;
			word32 s0_599;
			word32 a2_600;
			word32 a4_601;
			ra = mbedtls_asn1_get_mpi(ra, s2, a5_108, mstatus, dwArg24, dwArg78, dwArg88, dwArgB8, dwArgC8, dwArgF8, dwArg0108, out s0_599, out s1_132, out a0_191, out a1_104, out a2_600, out a4_601, out a5_108, out s2, out s3_220, out s4_116);
			if (a0_191 != 0x00)
				goto l23056DF6;
			Eq_2 a2_232;
			Eq_2 a4_234;
			Eq_2 s0_237;
			ra = mbedtls_asn1_get_mpi(ra, s2, a5_108, mstatus, dwArg24, dwArg78, dwArg88, dwArgB8, dwArgC8, dwArgF8, dwArg0108, out s0_237, out s1_132, out a0_191, out a1_104, out a2_232, out a4_234, out a5_108, out s2, out s3_220, out s4_116);
			if (a0_191 != 0x00)
				goto l23056DF6;
			a5_108 = *s3_220;
			if (s2 != a5_108)
			{
l23056E16:
				s0_117.u0 = 0xFC00049A;
				goto l23056E00;
			}
			word32 a0_254;
			Eq_2 a4_256;
			Eq_2 a2_258;
			word32 a3_611;
			s1_132 = mbedtls_rsa_check_pubkey(a2_232, a4_234, a5_108, out a0_254, out a1_104, out a2_258, out a3_611, out a4_256, out a5_108);
			if (a0_254 == 0x00)
			{
				word32 a3_612;
				word32 a4_613;
				word32 a5_614;
				*((word32) mbedtls_mpi_size(a2_258, a4_256, a5_108, out a1_104, out a3_612, out a4_613, out a5_614) + 4) = s0_237;
l23056E52:
				a5_108 = *s3_220;
				if (a5_108 == s2)
					goto l23056D70;
				goto l23056E16;
			}
			s0_117.u0 = 0xFC000500;
			goto l23056E00;
		}
		a5_108 = (word32) a5_94 - 2 & 0x00FF;
		if (a5_108 > 0x01)
		{
			s0_117.u0 = 0xFC000380;
			goto l23056E00;
		}
		Eq_2 a0_103;
		Eq_2 a4_107;
		word32 a2_602;
		word32 a3_603;
		pk_use_ecparams(s0_51, *((word32) s4_116 + 4), a2_88, 0x01, mstatus, s2, dwLoc1C, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, out a0_103, out a1_104, out a2_602, out a3_603, out a4_107, out a5_108, out s2, out s4_116);
		s0_117 = a0_103;
		if (a0_103 != 0x00)
		{
l23056E00:
			word32 a0_597;
			word32 a2_598;
			ra = mbedtls_pk_free(ra, s4_116, a5_108, out a0_597, out a2_598, out a5_108);
			s1_132 = s0_117;
			goto l23056D70;
		}
		s5 = *((word32) s4_116 + 4);
		Eq_2 a2_119 = *s3_220;
		s6 = (word32) s5 + 0x0088;
		Eq_2 a0_124;
		Eq_2 a2_126;
		word32 s0_604;
		word32 a3_605;
		word32 a4_606;
		union Eq_2 * s3_134;
		ra = mbedtls_ecp_point_read_binary(ra, a0_103, (word32) s5 + 0x0088, a2_119, s2 - a2_119, a4_107, s2, mstatus, dwLoc40, dwLoc3C, s2, dwLoc18, dwLoc08, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, dwArg0138, out s0_604, out s1_132, out a0_124, out a1_104, out a2_126, out a3_605, out a4_606, out a5_108, out s2, out s3_134, out s4_116);
		s0_117 = a0_124;
		if (a0_124 == 0x00)
		{
			Eq_2 a0_152;
			word32 s0_607;
			word32 a2_608;
			word32 a3_609;
			word32 a4_610;
			ra = mbedtls_ecp_check_pubkey(ra, s1_132, s5, (word32) s5 + 0x0088, a2_126, s4_116, (word32) s5 + 0x0088, s7, s10, s11, mstatus, dwLoc3C, dwLoc38_351, s2, dwLoc18, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg48, s1, dwArg64, dwArg68, dwArg78, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArg0108, dwArg0118, out s0_607, out s1_132, out a0_152, out a1_104, out a2_608, out a3_609, out a4_610, out a5_108, out s2, out s3_134, out s4_116, out s5, out s6, out s7, out s10, out s11, out mstatus);
			s0_117 = a0_152;
		}
		*s3_134 = (union Eq_2 *) s2;
		if (s0_117 != 0x00)
			goto l23056E00;
	}
l23056D70:
	0x00 = (uint16) dwArg0198;
	s1Out = s1_132;
	a0Out = s1_132;
	a1Out = a1_104;
	a5Out = a5_108;
	s2Out = s2;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s10Out = s10;
	s11Out = s11;
	mstatusOut = mstatus;
	return ra;
}

