pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 23056EC4: Register Eq_2 mbedtls_pk_parse_key(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a1, Register ptr32 a2, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0198, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      iot_tls_connect
//      mbedtls_pk_parse_keyfile
Eq_2 mbedtls_pk_parse_key(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a1, ptr32 a2, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148, Eq_2 dwArg0198, union Eq_2 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, ptr32 & mstatusOut)
{
	ptr32 a3_103;
	ptr32 a4_113;
	ptr32 s3_11 = a2;
	Eq_2 s2_116 = a1;
	Eq_2 s6_119 = a4;
	Eq_2 a5_114;
	Eq_2 ra_105 = mbedtls_pem_init(ra, fp + -60, out a5_114);
	if (a2 == 0x00)
	{
l23056EEE:
		word32 a0_353;
		Eq_2 s0_360;
		Eq_2 s1_361;
		Eq_2 s2_367;
		Eq_2 s3_368;
		Eq_2 s10_373;
		Eq_2 s11_374;
		Eq_2 s6_376;
		Eq_2 s7_377;
		word32 a2_853;
		ra_105 = pk_parse_key_pkcs8_unencrypted_der(ra_105, s0, s2_116, s3_11, a5_114, s6_119, s7, s10, s11, mstatus, dwLoc3C, dwLoc38, s4, s2, dwLoc18, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg14, dwArg18, dwArg28, dwArg34, dwArg38, dwArg44, dwArg48, s1, dwArg68, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out s0_360, out s1_361, out a0_353, out a2_853, out a3_103, out a4_113, out a5_114, out s2_367, out s3_368, out s6_376, out s7_377, out s10_373, out s11_374, out mstatus);
		if (a0_353 != 0x00)
		{
			word32 a0_854;
			word32 a2_855;
			word32 a5_856;
			ra_105 = mbedtls_pk_free(ra_105, s1_361, a5_114, out a0_854, out a2_855, out a5_856);
			ptr32 a0_388 = mbedtls_pk_info_from_type(0x01, out a5_114);
			if (a0_388 == 0x00)
				goto l23056F92;
			Eq_2 a0_392;
			word32 s1_857;
			word32 a1_858;
			word32 a2_859;
			ra_105 = mbedtls_pk_setup(ra_105, s0_360, s1_361, s1_361, a0_388, a5_114, out s1_857, out a0_392, out a1_858, out a2_859, out a5_114);
			if (a0_392 != 0x00)
				goto l2305709A;
			word32 a0_402;
			Eq_2 s0_409;
			Eq_2 s1_410;
			Eq_2 s2_411;
			Eq_2 s3_418;
			Eq_2 s10_424;
			Eq_2 s11_425;
			Eq_2 s6_427;
			Eq_2 s7_428;
			word32 a2_860;
			ra_105 = pk_parse_key_pkcs1_der(ra_105, a0_392, s2_367, s3_368, a5_114, s2_367, s6_376, s7_377, s10_373, s11_374, mstatus, dwLoc38, s2, dwLoc1C, dwLoc18, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg34, dwArg48, s1, dwArg68, dwArg74, dwArg88, dwArg98, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, out s0_409, out s1_410, out a0_402, out a2_860, out a3_103, out a4_113, out a5_114, out s2_411, out s3_418, out s6_427, out s7_428, out s10_424, out s11_425);
			if (a0_402 != 0x00)
			{
				word32 a0_861;
				word32 a2_862;
				word32 a5_863;
				ra_105 = mbedtls_pk_free(ra_105, s1_410, a5_114, out a0_861, out a2_862, out a5_863);
				ptr32 a0_436 = mbedtls_pk_info_from_type(0x02, out a5_114);
				if (a0_436 != 0x00)
				{
					struct Eq_286294 * a0_442;
					word32 s1_864;
					word32 a1_865;
					word32 a2_866;
					ra_105 = mbedtls_pk_setup(ra_105, s0_409, s1_410, s1_410, a0_436, a5_114, out s1_864, out a0_442, out a1_865, out a2_866, out a5_114);
					if (a0_442 == null)
					{
						word32 a0_452;
						Eq_2 s1_460;
						word32 a2_867;
						word32 s2_868;
						word32 s3_869;
						word32 s6_870;
						word32 s7_871;
						word32 s10_872;
						word32 s11_873;
						ra_105 = pk_parse_key_sec1_der(ra_105, a0_442->t0004, s2_411, s3_418, a5_114, s2_411, s6_427, s7_428, s10_424, s11_425, mstatus, dwLoc38, s2, dwLoc18, dwLoc08, dwArg04, dwArg08, dwArg24, dwArg28, dwArg34, dwArg38, dwArg48, s3, s1, dwArg64, dwArg68, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s1_460, out a0_452, out a2_867, out a3_103, out a4_113, out a5_114, out s2_868, out s3_869, out s6_870, out s7_871, out s10_872, out s11_873, out mstatus);
						if (a0_452 != 0x00)
						{
							word32 a0_874;
							word32 a2_875;
							ra_105 = mbedtls_pk_free(ra_105, s1_460, a5_114, out a0_874, out a2_875, out a5_114);
							s0.u0 = 0xFC000300;
							goto l23056F98;
						}
					}
					goto l2305709A;
				}
				goto l23056F92;
			}
		}
l2305709A:
		s0.u0 = 0x00;
		goto l23056F98;
	}
	a5_114 = (word32) *((word32) a1 + (a2 + -1));
	if (a5_114 != 0x00)
		goto l23056EEE;
	Eq_2 a2_178;
	Eq_2 a5_181;
	Eq_2 s1_184;
	Eq_2 a0_176;
	Eq_2 a0_57;
	Eq_2 s1_63;
	byte * s4_64;
	Eq_2 s7_76;
	word32 s0_876;
	word32 a1_877;
	word32 a2_878;
	word32 a5_879;
	word32 s5_880;
	word32 s8_881;
	word32 s9_882;
	ra_105 = mbedtls_pem_read_buffer(ra_105, s0, fp + -60, 0x23088BB4, 587762580, a1, fp + -64, a1, mstatus, dwArg34, dwArg88, dwArgC8, dwArg0108, out s0_876, out s1_63, out a0_57, out a1_877, out a2_878, out a3_103, out a4_113, out a5_879, out s2_116, out s3_11, out s4_64, out s5_880, out s6_119, out s7_76, out s8_881, out s9_882, out s10, out s11);
	s0 = a0_57;
	if (a0_57 == 0x00)
	{
		ptr32 a0_255 = mbedtls_pk_info_from_type(0x01, out a5_114);
		if (a0_255 == 0x00)
			goto l23056F92;
		Eq_2 a0_259;
		Eq_2 a1_260;
		Eq_2 a2_261;
		ra_105 = mbedtls_pk_setup(ra_105, a0_57, s1_63, s1_63, a0_255, a5_114, out s1_184, out a0_259, out a1_260, out a2_261, out a5_181);
		s0 = a0_259;
		if (a0_259 == 0x00)
		{
			word32 s0_884;
			word32 a3_885;
			word32 a4_886;
			word32 s2_887;
			word32 s3_888;
			word32 s6_889;
			word32 s7_890;
			word32 s10_891;
			word32 s11_892;
			ra_105 = pk_parse_key_pkcs1_der(ra_105, a0_259, a1_260, a2_261, a5_181, s2_116, s6_119, s7_76, s10, s11, mstatus, dwLoc38, s2, dwLoc1C, dwLoc18, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg34, dwArg48, s1, dwArg68, dwArg74, dwArg88, dwArg98, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, out s0_884, out s1_184, out a0_176, out a2_178, out a3_885, out a4_886, out a5_181, out s2_887, out s3_888, out s6_889, out s7_890, out s10_891, out s11_892);
			goto l23056FC6;
		}
		goto l23056FCA;
	}
	a5_114.u0 = 0xFF000000;
	s7.u0 = ~0x0100037F;
	if (a0_57 == ~0x0100037F)
	{
l23056FE2:
		s0.u0 = 0xFC000480;
		goto l23056F98;
	}
	if (a0_57 == ~0x010002FF)
	{
l23056FF2:
		s0.u0 = 0xFC000400;
		goto l23056F98;
	}
	a5_114.u0 = ~0x0100007F;
	if (a0_57 != ~0x0100007F)
		goto l23056F98;
	a5_114 = (word32) *s4_64;
	if (a5_114 != 0x00)
		goto l23056EEE;
	Eq_2 a0_101;
	Eq_2 s1_107;
	byte * s4_108;
	Eq_2 s8_109;
	word32 s0_895;
	word32 a1_896;
	word32 a2_897;
	word32 s5_898;
	word32 s9_899;
	ra_105 = mbedtls_pem_read_buffer(ra_105, a0_57, fp + -60, 587762676, 587762644, s2_116, fp + -64, s2_116, mstatus, dwArg34, dwArg88, dwArgC8, dwArg0108, out s0_895, out s1_107, out a0_101, out a1_896, out a2_897, out a3_103, out a4_113, out a5_114, out s2_116, out s3_11, out s4_108, out s5_898, out s6_119, out s7, out s8_109, out s9_899, out s10, out s11);
	s0 = a0_101;
	if (a0_101 != 0x00)
	{
		if (a0_101 == s7)
			goto l23056FE2;
		if (a0_101 == s8_109)
			goto l23056FF2;
		if (a0_101 == ~0x0100007F)
		{
			a5_114 = (word32) *s4_108;
			if (a5_114 != 0x00)
				goto l23056EEE;
			Eq_2 a0_143;
			ptr32 a2_144;
			Eq_2 a1_154;
			Eq_2 s5_160;
			word32 s0_908;
			word32 s1_909;
			word32 s4_910;
			word32 s8_911;
			word32 s9_912;
			ra_105 = mbedtls_pem_read_buffer(ra_105, a0_101, fp + -60, 0x23088C30, 587762708, s2_116, fp + -64, s2_116, mstatus, dwArg34, dwArg88, dwArgC8, dwArg0108, out s0_908, out s1_909, out a0_143, out a1_154, out a2_144, out a3_103, out a4_113, out a5_114, out s2_116, out s3_11, out s4_910, out s5_160, out s6_119, out s7, out s8_911, out s9_912, out s10, out s11);
			s0 = a0_143;
			if (a0_143 == 0x00)
			{
				word32 s0_913;
				word32 a3_914;
				word32 a4_915;
				word32 s2_916;
				word32 s3_917;
				word32 s6_918;
				word32 s7_919;
				word32 s10_920;
				word32 s11_921;
				ra_105 = pk_parse_key_pkcs8_unencrypted_der(ra_105, dwArg44, a1_154, a2_144, a5_114, s6_119, s7, s10, s11, mstatus, dwLoc3C, dwLoc38, s4, s2, dwLoc18, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg14, dwArg18, dwArg28, dwArg34, dwArg38, dwArg44, dwArg48, s1, dwArg68, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out s0_913, out s1_184, out a0_176, out a2_178, out a3_914, out a4_915, out a5_181, out s2_916, out s3_917, out s6_918, out s7_919, out s10_920, out s11_921, out mstatus);
				goto l23056FC6;
			}
			if (a0_143 == s5_160)
				goto l23056EEE;
		}
l23056F98:
		0x00 = (uint16) dwArg0198;
		a0Out = s0;
		a2Out = dwArg0138;
		a3Out = a3_103;
		a4Out = a4_113;
		a5Out = a5_114;
		mstatusOut = mstatus;
		return ra_105;
	}
	else
	{
		ptr32 a0_206 = mbedtls_pk_info_from_type(0x02, out a5_114);
		if (a0_206 == 0x00)
		{
l23056F92:
			s0.u0 = 0xFC000380;
			goto l23056F98;
		}
		Eq_2 a0_210;
		Eq_2 a1_211;
		Eq_2 a2_212;
		ra_105 = mbedtls_pk_setup(ra_105, a0_101, s1_107, s1_107, a0_206, a5_114, out s1_184, out a0_210, out a1_211, out a2_212, out a5_181);
		s0 = a0_210;
		if (a0_210 != 0x00)
		{
l23056FCA:
			word32 a0_883;
			ra_105 = mbedtls_pk_free(ra_105, s1_184, a5_181, out a0_883, out a2_178, out a5_181);
			goto l23056FD0;
		}
		word32 a3_900;
		word32 a4_901;
		word32 s2_902;
		word32 s3_903;
		word32 s6_904;
		word32 s7_905;
		word32 s10_906;
		word32 s11_907;
		ra_105 = pk_parse_key_sec1_der(ra_105, *((word32) a0_210 + 4), a1_211, a2_212, a5_181, s2_116, s6_119, s7, s10, s11, mstatus, dwLoc38, s2, dwLoc18, dwLoc08, dwArg04, dwArg08, dwArg24, dwArg28, dwArg34, dwArg38, dwArg48, s3, s1, dwArg64, dwArg68, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s1_184, out a0_176, out a2_178, out a3_900, out a4_901, out a5_181, out s2_902, out s3_903, out s6_904, out s7_905, out s10_906, out s11_907, out mstatus);
l23056FC6:
		s0 = a0_176;
		if (a0_176 == 0x00)
		{
l23056FD0:
			word32 a1_893;
			word32 s4_894;
			mbedtls_pem_free(fp + -60, a2_178, a5_181, mstatus, dwArg0108, dwArg0148, out a1_893, out a3_103, out a4_113, out a5_114, out s4_894);
			goto l23056F98;
		}
		goto l23056FCA;
	}
}

// 2305709E: Register Eq_2 mbedtls_pk_parse_keyfile(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      iot_tls_connect
Eq_2 mbedtls_pk_parse_keyfile(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & mstatusOut)
{
	Eq_2 a0_24;
	ptr32 a2_26;
	Eq_2 s1_35;
	Eq_2 s10_36;
	Eq_2 s11_37;
	Eq_2 s2_38;
	Eq_2 s3_39;
	Eq_2 s4_40;
	Eq_2 s7_43;
	word32 a4_283;
	word32 a5_284;
	word32 s5_285;
	word32 s6_286;
	word32 s8_287;
	Eq_2 a1_25;
	ptr32 mstatus_116;
	ptr32 a3_132;
	Eq_2 ra_245 = mbedtls_pk_load_file(ra, a2, a3, a0, s3, s4, mstatus, dwLoc30, dwLoc2C, dwLoc28, dwLoc18, dwLoc0C, dwArg20, dwArg24, dwArg48, dwArg6C, dwArgA8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_35, out a0_24, out a1_25, out a2_26, out a3_132, out a4_283, out a5_284, out s2_38, out s3_39, out s4_40, out s5_285, out s6_286, out s7_43, out s8_287, out s10_36, out s11_37, out mstatus_116);
	Eq_2 s0_140 = a0_24;
	if (a0_24 == 0x00)
	{
		Eq_2 a4_66;
		if (s1_35 == 0x00)
			a4_66.u0 = 0x00;
		else
		{
			dwLoc2C = a1_25;
			word32 a2_288;
			word32 a3_289;
			word32 a4_290;
			word32 a5_291;
			a4_66 = strlen(s1_35, out a1_25, out a2_288, out a3_289, out a4_290, out a5_291);
			s0_140 = dwArg34;
		}
		Eq_2 a2_89;
		word32 a4_91;
		Eq_2 a0_115;
		word32 a3_301;
		Eq_2 a5_121;
		ra_245 = mbedtls_pk_parse_key(ra_245, s0_140, s1_35, a1_25, a2_26, a4_66, s2_38, s3_39, s4_40, s7_43, s10_36, s11_37, mstatus_116, dwLoc2C, dwLoc28, s0, dwLoc18, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg14, dwArg18, dwArg34, dwArg38, dwArg44, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0118, dwArg0168, out a0_115, out a2_89, out a3_301, out a4_91, out a5_121, out mstatus_116);
		Eq_2 a4_120 = (word32) a5_121 + a4_91;
		while (a5_121 != a4_120)
		{
			a5_121->u1 = 0x00;
			a5_121 = (word32) a5_121 + 1;
		}
		word32 s1_292;
		word32 a0_293;
		word32 a1_294;
		word32 a2_295;
		word32 a4_296;
		word32 a5_297;
		word32 a6_298;
		word32 s4_299;
		word32 t3_300;
		vPortFree(a0_115, a2_89, a5_121, mstatus_116, dwArg0128, dwArg0168, out s0_140, out s1_292, out a0_293, out a1_294, out a2_295, out a3_132, out a4_296, out a5_297, out a6_298, out s4_299, out t3_300);
	}
	0x00 = (uint16) dwArg0128;
	a0Out = s0_140;
	a3Out = a3_132;
	mstatusOut = mstatus_116;
	return ra_245;
}

// 23057106: void rsa_can_do(Register word32 a0)
void rsa_can_do(word32 a0)
{
	if (a0 == 0x01)
		;
}

