pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 230573EA: Register Eq_2 mbedtls_rsa_check_privkey(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_2) a5Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out)
// Called from:
//      pk_parse_key_pkcs1_der
//      mbedtls_rsa_check_pub_priv
Eq_2 mbedtls_rsa_check_privkey(Eq_2 ra, Eq_2 s1, Eq_2 a2, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArgA4, Eq_2 dwArgC8, Eq_2 dwArgD8, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, union Eq_2 & s3Out, union Eq_2 & s6Out, union Eq_2 & s7Out, union Eq_2 & s10Out, union Eq_2 & s11Out)
{
	word32 a0_23;
	Eq_2 a4_25;
	word32 a1_798;
	union Eq_2 * a5_24;
	ptr32 a2_27;
	Eq_2 a3_28;
	Eq_2 s1_29 = mbedtls_rsa_check_pubkey(a2, a4, a5, out a0_23, out a1_798, out a2_27, out a3_28, out a4_25, out a5_24);
	if (a0_23 == 0x00)
	{
		s1_29 = *((word32) a4_25 + 52);
		a5_24 = (union Eq_2 *) ~0x040001FF;
		if (a4_25 == 0x00)
			goto l230575E4;
		s1_29 = *((word32) a4_25 + 64);
		if (a4_25 != 0x00)
		{
			s1_29 = *((word32) a4_25 + 40);
			if (a4_25 == 0x00)
				goto l230575E4;
			mbedtls_mpi_init(fp + -188);
			mbedtls_mpi_init(fp + -0x00B0);
			mbedtls_mpi_init(fp + -0x00A4);
			mbedtls_mpi_init(fp + -0x0098);
			mbedtls_mpi_init(fp + -0x008C);
			mbedtls_mpi_init(fp + -0x0080);
			mbedtls_mpi_init(fp + -116);
			mbedtls_mpi_init(fp + -0x0068);
			mbedtls_mpi_init(fp + -92);
			mbedtls_mpi_init(fp + -80);
			mbedtls_mpi_init(fp + -0x0044);
			mbedtls_mpi_init(fp + -56);
			mbedtls_mpi_init(fp + -44);
			Eq_2 a3_74;
			word32 s1_81;
			Eq_2 s2_82;
			Eq_2 a0_94;
			Eq_2 s6_95;
			word32 s0_799;
			word32 s4_800;
			word32 s5_801;
			word32 s8_802;
			Eq_2 a5_106;
			Eq_2 a4_105;
			Eq_2 a2_103;
			ra = mbedtls_mpi_mul_mpi(ra, fp + -188, (word32) s1_29 + 44, (word32) s1_29 + 56, a3_28, a4_25, (word32) s1_29 + 56, s4, s6, mstatus, dwLoc18, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg48, dwArg68, dwArg78, dwArg88, dwArgD8, out s0_799, out s1_81, out a0_94, out a2_103, out a3_74, out a4_105, out a5_106, out s2_82, out s3, out s4_800, out s5_801, out s6_95, out s8_802);
			Eq_2 s0_126 = a0_94;
			if (a0_94 == 0x00)
			{
				Eq_2 a3_104;
				Eq_2 s2_112;
				Eq_2 a0_124;
				Eq_2 s6_125;
				word32 s0_869;
				word32 s1_870;
				word32 s4_871;
				word32 s5_872;
				word32 s8_873;
				ra = mbedtls_mpi_mul_mpi(ra, fp + -0x00B0, s1_81 + 32, s1_81 + 20, a3_74, a4_105, s2_82, s1_81 + 32, s6_95, mstatus, dwLoc18, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg48, dwArg68, dwArg78, dwArg88, dwArgD8, out s0_869, out s1_870, out a0_124, out a2_103, out a3_104, out a4_105, out a5_106, out s2_112, out s3, out s4_871, out s5_872, out s6_125, out s8_873);
				s0_126 = a0_124;
				if (a0_124 != 0x00)
					goto l23057588;
				Eq_2 a0_130;
				Eq_2 a3_133;
				Eq_2 s2_141;
				word32 s4_874;
				ra = mbedtls_mpi_sub_int(ra, a0_124, fp + -0x00A4, 0x01, a3_104, s2_112, mstatus, dwLoc48, dwLoc28, dwLoc08, s1, dwArg28, dwArg38, dwArg58, out a0_130, out a2_103, out a3_133, out a4_105, out a5_106, out s2_141, out s3, out s4_874);
				s0_126 = a0_130;
				if (a0_130 == 0x00)
				{
					Eq_2 a0_156;
					Eq_2 a3_159;
					Eq_2 s2_167;
					Eq_2 s4_169;
					ra = mbedtls_mpi_sub_int(ra, a0_130, fp + -0x0098, 0x01, a3_133, s2_141, mstatus, dwLoc48, dwLoc28, dwLoc08, s1, dwArg28, dwArg38, dwArg58, out a0_156, out a2_103, out a3_159, out a4_105, out a5_106, out s2_167, out s3, out s4_169);
					s0_126 = a0_156;
					if (a0_156 != 0x00)
						goto l23057588;
					Eq_2 a3_184;
					Eq_2 s5_195;
					Eq_2 a0_204;
					Eq_2 s6_205;
					word32 s0_875;
					word32 s1_876;
					word32 s2_877;
					word32 s4_878;
					word32 s8_879;
					ra = mbedtls_mpi_mul_mpi(ra, fp + -0x008C, fp + -0x00A4, fp + -0x0098, a3_159, a4_105, s2_167, s4_169, s6_125, mstatus, dwLoc18, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg48, dwArg68, dwArg78, dwArg88, dwArgD8, out s0_875, out s1_876, out a0_204, out a2_103, out a3_184, out a4_105, out a5_106, out s2_877, out s3, out s4_878, out s5_195, out s6_205, out s8_879);
					s0_126 = a0_204;
					if (a0_204 == 0x00)
					{
						Eq_2 a3_212;
						Eq_2 a0_231;
						word32 s1_880;
						word32 s2_881;
						word32 s4_882;
						word32 s8_883;
						ra = mbedtls_mpi_gcd(ra, s5_195, fp + -0x008C, a3_184, a4_105, mstatus, dwLoc58, dwLoc28, dwLoc18, dwArg08, s1, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, out s1_880, out a0_231, out a2_103, out a3_212, out a4_105, out a5_106, out s2_881, out s3, out s4_882, out s8_883);
						s0_126 = a0_231;
						if (a0_231 != 0x00)
							goto l23057588;
						Eq_2 a0_257;
						word32 s1_884;
						word32 a3_885;
						word32 s2_886;
						word32 s4_887;
						word32 s8_888;
						ra = mbedtls_mpi_gcd(ra, fp + -0x00A4, fp + -0x0098, a3_212, a4_105, mstatus, dwLoc58, dwLoc28, dwLoc18, dwArg08, s1, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, out s1_884, out a0_257, out a2_103, out a3_885, out a4_105, out a5_106, out s2_886, out s3, out s4_887, out s8_888);
						s0_126 = a0_257;
						if (a0_257 == 0x00)
						{
							Eq_2 a0_266;
							Eq_2 s5_279;
							Eq_2 s6_280;
							Eq_2 s10_291;
							word32 s0_889;
							word32 a3_890;
							word32 s2_891;
							word32 s4_892;
							word32 s8_893;
							word32 s9_894;
							ra = mbedtls_mpi_div_mpi(ra, fp + -92, fp + -80, fp + -0x008C, fp + -0x0068, s5_195, s6_205, s7, s10, s11, mstatus, dwLocA8, dwLoc88, dwLoc78, s4, s2, dwLoc58, dwLoc48, dwLoc38, dwLoc28, dwLoc18, dwLoc08, s1, dwArg28, dwArg38, dwArg64, dwArg84, out s0_889, out a0_266, out a2_103, out a3_890, out a4_105, out a5_106, out s2_891, out s3, out s4_892, out s5_279, out s6_280, out s7, out s8_893, out s9_894, out s10_291, out s11);
							s0_126 = a0_266;
							if (a0_266 != 0x00)
								goto l23057588;
							Eq_2 a0_298;
							Eq_2 s10_311;
							Eq_2 s4_314;
							Eq_2 s5_315;
							Eq_2 s6_316;
							word32 s1_895;
							word32 a3_896;
							word32 a7_897;
							word32 s2_898;
							word32 s8_899;
							word32 s9_900;
							ra = mbedtls_mpi_mod_mpi(ra, fp + -0x0080, fp + -0x00B0, fp + -92, s5_279, s6_280, s7, s10_291, s11, mstatus, dwLocB8, dwLoc98, dwLoc88, dwLoc7C, dwLoc78, s2, dwLoc58, dwLoc48, dwLoc38, dwLoc28, dwLoc18, dwArg08, s1, dwArg28, dwArg38, dwArg48, dwArg54, dwArg68, dwArg74, out s1_895, out a0_298, out a2_103, out a3_896, out a4_105, out a5_106, out a7_897, out s2_898, out s3, out s4_314, out s5_315, out s6_316, out s7, out s8_899, out s9_900, out s10_311, out s11);
							s0_126 = a0_298;
							if (a0_298 == 0x00)
							{
								Eq_2 a0_329;
								Eq_2 s10_342;
								Eq_2 s4_345;
								Eq_2 s5_346;
								Eq_2 s6_347;
								word32 s1_901;
								word32 a3_902;
								word32 a7_903;
								word32 s2_904;
								word32 s8_905;
								word32 s9_906;
								ra = mbedtls_mpi_mod_mpi(ra, fp + -0x0044, s4_314, fp + -0x00A4, s5_315, s6_316, s7, s10_311, s11, mstatus, dwLocB8, dwLoc98, dwLoc88, dwLoc7C, dwLoc78, s2, dwLoc58, dwLoc48, dwLoc38, dwLoc28, dwLoc18, dwArg08, s1, dwArg28, dwArg38, dwArg48, dwArg54, dwArg68, dwArg74, out s1_901, out a0_329, out a2_103, out a3_902, out a4_105, out a5_106, out a7_903, out s2_904, out s3, out s4_345, out s5_346, out s6_347, out s7, out s8_905, out s9_906, out s10_342, out s11);
								s0_126 = a0_329;
								if (a0_329 != 0x00)
									goto l23057588;
								Eq_2 a0_360;
								Eq_2 s2_368;
								Eq_2 s10_373;
								Eq_2 s5_377;
								Eq_2 s6_378;
								word32 s1_907;
								word32 a3_908;
								word32 a7_909;
								word32 s4_910;
								word32 s8_911;
								word32 s9_912;
								ra = mbedtls_mpi_mod_mpi(ra, fp + -56, s4_345, fp + -0x0098, s5_346, s6_347, s7, s10_342, s11, mstatus, dwLocB8, dwLoc98, dwLoc88, dwLoc7C, dwLoc78, s2, dwLoc58, dwLoc48, dwLoc38, dwLoc28, dwLoc18, dwArg08, s1, dwArg28, dwArg38, dwArg48, dwArg54, dwArg68, dwArg74, out s1_907, out a0_360, out a2_103, out a3_908, out a4_105, out a5_106, out a7_909, out s2_368, out s3, out s4_910, out s5_377, out s6_378, out s7, out s8_911, out s9_912, out s10_373, out s11);
								s0_126 = a0_360;
								if (a0_360 == 0x00)
								{
									Eq_2 a0_391;
									word32 s1_913;
									word32 a3_914;
									word32 s2_915;
									word32 s4_916;
									word32 s5_917;
									word32 s6_918;
									word32 s8_919;
									word32 s9_920;
									word32 s10_921;
									ra = mbedtls_mpi_inv_mod(ra, a0_360, s2_368, s3, s5_377, s6_378, s7, s10_373, s11, mstatus, dwLoc98, dwLoc88, dwLoc78, s2, dwLoc58, dwLoc48, dwLoc3C, dwLoc38, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, s1, dwArg28, dwArg38, dwArgA4, out s1_913, out a0_391, out a2_103, out a3_914, out a4_105, out a5_106, out s2_915, out s3, out s4_916, out s5_917, out s6_918, out s7, out s8_919, out s9_920, out s10_921, out s11);
									s0_126 = a0_391;
									if (a0_391 != 0x00)
										goto l23057588;
									word32 a1_922;
									word32 a3_923;
									word32 a6_924;
									if (mbedtls_mpi_cmp_mpi(a2_103, a4_105, a5_106, out a1_922, out a2_103, out a3_923, out a4_105, out a5_106, out a6_924) != 0x00)
									{
l2305753C:
										s0_126.u0 = ~0x040001FF;
										goto l23057588;
									}
									word32 a1_925;
									word32 a3_926;
									word32 a6_927;
									if (mbedtls_mpi_cmp_mpi(a2_103, a4_105, a5_106, out a1_925, out a2_103, out a3_926, out a4_105, out a5_106, out a6_927) != 0x00)
										goto l2305753C;
									word32 a1_928;
									word32 a3_929;
									word32 a6_930;
									if (mbedtls_mpi_cmp_mpi(a2_103, a4_105, a5_106, out a1_928, out a2_103, out a3_929, out a4_105, out a5_106, out a6_930) != 0x00)
										goto l2305753C;
									word32 a1_931;
									word32 a3_932;
									word32 a6_933;
									if (mbedtls_mpi_cmp_mpi(a2_103, a4_105, a5_106, out a1_931, out a2_103, out a3_932, out a4_105, out a5_106, out a6_933) != 0x00)
										goto l2305753C;
									word32 a1_934;
									word32 a3_935;
									word32 a6_936;
									if (mbedtls_mpi_cmp_int(0x00, a2_103, out a1_934, out a2_103, out a3_935, out a4_105, out a5_106, out a6_936) != 0x00)
										goto l2305753C;
									word32 a1_937;
									word32 a3_938;
									word32 a6_939;
									if (mbedtls_mpi_cmp_int(0x01, a2_103, out a1_937, out a2_103, out a3_938, out a4_105, out a5_106, out a6_939) != 0x00)
										goto l2305753C;
									word32 a1_940;
									word32 a3_941;
									word32 a6_942;
									Eq_2 a0_478 = mbedtls_mpi_cmp_int(0x01, a2_103, out a1_940, out a2_103, out a3_941, out a4_105, out a5_106, out a6_942);
									s0_126 = a0_478;
									if (a0_478 != 0x00)
										goto l2305753C;
								}
							}
						}
					}
				}
			}
l23057588:
			Eq_2 a2_503;
			Eq_2 a5_504;
			Eq_2 a4_507;
			word32 a0_803;
			word32 a1_804;
			word32 a3_805;
			word32 a6_806;
			word32 s4_807;
			mbedtls_mpi_free(fp + -188, a2_103, a4_105, a5_106, mstatus, dwArg88, dwArgC8, out a0_803, out a1_804, out a2_503, out a3_805, out a4_507, out a5_504, out a6_806, out s4_807);
			Eq_2 a2_515;
			Eq_2 a5_516;
			Eq_2 a4_519;
			word32 a0_808;
			word32 a1_809;
			word32 a3_810;
			word32 a6_811;
			word32 s4_812;
			mbedtls_mpi_free(fp + -0x00B0, a2_503, a4_507, a5_504, mstatus, dwArg88, dwArgC8, out a0_808, out a1_809, out a2_515, out a3_810, out a4_519, out a5_516, out a6_811, out s4_812);
			Eq_2 a2_527;
			Eq_2 a5_528;
			Eq_2 a4_531;
			word32 a0_813;
			word32 a1_814;
			word32 a3_815;
			word32 a6_816;
			word32 s4_817;
			mbedtls_mpi_free(fp + -0x00A4, a2_515, a4_519, a5_516, mstatus, dwArg88, dwArgC8, out a0_813, out a1_814, out a2_527, out a3_815, out a4_531, out a5_528, out a6_816, out s4_817);
			Eq_2 a2_539;
			Eq_2 a5_540;
			Eq_2 a4_543;
			word32 a0_818;
			word32 a1_819;
			word32 a3_820;
			word32 a6_821;
			word32 s4_822;
			mbedtls_mpi_free(fp + -0x0098, a2_527, a4_531, a5_528, mstatus, dwArg88, dwArgC8, out a0_818, out a1_819, out a2_539, out a3_820, out a4_543, out a5_540, out a6_821, out s4_822);
			Eq_2 a2_551;
			Eq_2 a5_552;
			Eq_2 a4_555;
			word32 a0_823;
			word32 a1_824;
			word32 a3_825;
			word32 a6_826;
			word32 s4_827;
			mbedtls_mpi_free(fp + -0x008C, a2_539, a4_543, a5_540, mstatus, dwArg88, dwArgC8, out a0_823, out a1_824, out a2_551, out a3_825, out a4_555, out a5_552, out a6_826, out s4_827);
			Eq_2 a2_563;
			Eq_2 a5_564;
			Eq_2 a4_567;
			word32 a0_828;
			word32 a1_829;
			word32 a3_830;
			word32 a6_831;
			word32 s4_832;
			mbedtls_mpi_free(fp + -0x0080, a2_551, a4_555, a5_552, mstatus, dwArg88, dwArgC8, out a0_828, out a1_829, out a2_563, out a3_830, out a4_567, out a5_564, out a6_831, out s4_832);
			Eq_2 a2_575;
			Eq_2 a5_576;
			Eq_2 a4_579;
			word32 a0_833;
			word32 a1_834;
			word32 a3_835;
			word32 a6_836;
			word32 s4_837;
			mbedtls_mpi_free(fp + -116, a2_563, a4_567, a5_564, mstatus, dwArg88, dwArgC8, out a0_833, out a1_834, out a2_575, out a3_835, out a4_579, out a5_576, out a6_836, out s4_837);
			Eq_2 a2_587;
			Eq_2 a5_588;
			Eq_2 a4_591;
			word32 a0_838;
			word32 a1_839;
			word32 a3_840;
			word32 a6_841;
			word32 s4_842;
			mbedtls_mpi_free(fp + -0x0068, a2_575, a4_579, a5_576, mstatus, dwArg88, dwArgC8, out a0_838, out a1_839, out a2_587, out a3_840, out a4_591, out a5_588, out a6_841, out s4_842);
			Eq_2 a2_599;
			Eq_2 a5_600;
			Eq_2 a4_603;
			word32 a0_843;
			word32 a1_844;
			word32 a3_845;
			word32 a6_846;
			word32 s4_847;
			mbedtls_mpi_free(fp + -92, a2_587, a4_591, a5_588, mstatus, dwArg88, dwArgC8, out a0_843, out a1_844, out a2_599, out a3_845, out a4_603, out a5_600, out a6_846, out s4_847);
			Eq_2 a2_611;
			Eq_2 a5_612;
			Eq_2 a4_615;
			word32 a0_848;
			word32 a1_849;
			word32 a3_850;
			word32 a6_851;
			word32 s4_852;
			mbedtls_mpi_free(fp + -80, a2_599, a4_603, a5_600, mstatus, dwArg88, dwArgC8, out a0_848, out a1_849, out a2_611, out a3_850, out a4_615, out a5_612, out a6_851, out s4_852);
			Eq_2 a2_623;
			Eq_2 a5_624;
			Eq_2 a4_627;
			word32 a0_853;
			word32 a1_854;
			word32 a3_855;
			word32 a6_856;
			word32 s4_857;
			mbedtls_mpi_free(fp + -0x0044, a2_611, a4_615, a5_612, mstatus, dwArg88, dwArgC8, out a0_853, out a1_854, out a2_623, out a3_855, out a4_627, out a5_624, out a6_856, out s4_857);
			Eq_2 a2_635;
			Eq_2 a5_636;
			Eq_2 a4_639;
			word32 a0_858;
			word32 a1_859;
			word32 a3_860;
			word32 a6_861;
			word32 s4_862;
			mbedtls_mpi_free(fp + -56, a2_623, a4_627, a5_624, mstatus, dwArg88, dwArgC8, out a0_858, out a1_859, out a2_635, out a3_860, out a4_639, out a5_636, out a6_861, out s4_862);
			word32 a0_863;
			word32 a1_864;
			word32 a4_865;
			word32 a5_866;
			word32 a6_867;
			word32 s4_868;
			s1_29 = mbedtls_mpi_free(fp + -44, a2_635, a4_639, a5_636, mstatus, dwArg88, dwArgC8, out a0_863, out a1_864, out a2_27, out a3_28, out a4_865, out a5_866, out a6_867, out s4_868);
			a5_24 = (union Eq_2 *) ~0x040001FF;
			goto l230575E4;
		}
	}
l230575E4:
	s1Out = s1_29;
	a0Out = dwArgD8;
	a2Out = a2_27;
	a3Out = a3_28;
	a4Out = dwArgB8;
	a5Out = a5_24;
	s2Out = dwArg98;
	s3Out = s3;
	s6Out = dwArg74;
	s7Out = s7;
	s10Out = dwArg54;
	s11Out = s11;
	return ra;
}

// 230575F8: void mbedtls_rsa_check_pub_priv(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8)
// Called from:
//      rsa_check_pair_wrap
void mbedtls_rsa_check_pub_priv(Eq_2 ra, Eq_2 a2, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgC8)
{
	word32 a0_17;
	Eq_2 a5_18;
	Eq_2 a4_19;
	Eq_2 a2_21;
	word32 a1_175;
	word32 a3_176;
	Eq_2 s1_23 = mbedtls_rsa_check_pubkey(a2, a4, a5, out a0_17, out a1_175, out a2_21, out a3_176, out a4_19, out a5_18);
	if (a0_17 == 0x00)
	{
		word32 a0_34;
		Eq_2 a2_36;
		Eq_2 a4_38;
		Eq_2 a5_39;
		word32 s1_177;
		word32 a3_178;
		word32 s2_179;
		word32 s3_180;
		word32 s6_181;
		word32 s7_182;
		word32 s10_183;
		word32 s11_184;
		mbedtls_rsa_check_privkey(ra, s1_23, a2_21, a4_19, a5_18, s2, s4, s6, s7, s10, s11, mstatus, dwLoc08, dwArg18, dwArg28, dwArg38, dwArg44, dwArg48, dwArg54, dwArg58, dwArg64, dwArg68, ra, dwArg78, dwArg94, dwArgB8, dwArgC8, out s1_177, out a0_34, out a2_36, out a3_178, out a4_38, out a5_39, out s2_179, out s3_180, out s6_181, out s7_182, out s10_183, out s11_184);
		if (a0_34 == 0x00)
		{
			Eq_2 a2_66;
			Eq_2 a4_68;
			Eq_2 a5_69;
			word32 a1_185;
			word32 a3_186;
			word32 a6_187;
			if (mbedtls_mpi_cmp_mpi(a2_36, a4_38, a5_39, out a1_185, out a2_66, out a3_186, out a4_68, out a5_69, out a6_187) == 0x00)
			{
				word32 a1_188;
				word32 a2_189;
				word32 a3_190;
				word32 a4_191;
				word32 a5_192;
				word32 a6_193;
				if (mbedtls_mpi_cmp_mpi(a2_66, a4_68, a5_69, out a1_188, out a2_189, out a3_190, out a4_191, out a5_192, out a6_193) == 0x00)
					;
			}
		}
	}
}

// 2305763E: Register Eq_2 mbedtls_rsa_public(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg64, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out Eq_288791 a4Out, Register out Eq_288792 a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out)
// Called from:
//      mbedtls_rsa_rsaes_oaep_encrypt
//      mbedtls_rsa_pkcs1_encrypt
//      mbedtls_rsa_rsaes_oaep_decrypt
//      mbedtls_rsa_pkcs1_decrypt
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
//      mbedtls_rsa_pkcs1_verify
Eq_2 mbedtls_rsa_public(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg64, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a2Out, union Eq_288791 & a4Out, union Eq_288792 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	mbedtls_mpi_init(fp + -44);
	Eq_2 a0_28;
	struct Eq_288803 * s1_38;
	word32 s0_207;
	word32 a1_208;
	word32 s4_210;
	word32 a3_209;
	word32 s8_211;
	Eq_2 a5_109;
	Eq_2 a4_110;
	Eq_2 a2_112;
	Eq_2 s2_103;
	ptr32 a7_178;
	Eq_2 s3_185;
	Eq_2 ra_102 = mbedtls_mpi_read_binary(ra, a1, dwArg24, a3, a4, mstatus, dwLoc38, s2, dwArg98, dwArgA8, dwArgD8, dwArgE8, dwArg0118, dwArg0128, out s0_207, out s1_38, out a0_28, out a1_208, out a2_112, out a3_209, out a4_110, out a5_109, out a7_178, out s2_103, out s3_185, out s4_210, out s8_211);
	Eq_2 s0_106 = a0_28;
	if (a0_28 == 0x00)
	{
		s0_106.u0 = ~0x03;
		a2_112 = dwArg64;
		Eq_2 a3_58;
		word32 a1_218;
		word32 a2_219;
		word32 a6_220;
		if (mbedtls_mpi_cmp_mpi(a2_112, a4_110, a5_109, out a1_218, out a2_219, out a3_58, out a4_110, out a5_109, out a6_220) < 0x00)
		{
			s3_185 = s1_38->t0004;
			word32 a3_221;
			Eq_2 a0_70 = mbedtls_mpi_exp_mod(ra_102, (char *) &s1_38->t0004 + 16, a3_58, (char *) &s1_38->t0004 + 100, s11, mstatus, out a2_112, out a3_221, out a4_110, out a5_109, out a7_178);
			s0_106 = a0_70;
			if (a0_70 == 0x00)
			{
				Eq_2 a0_89;
				ra_102 = mbedtls_mpi_write_binary(ra_102, s2_103, s3_185, a4_110, a5_109, out a0_89, out a2_112, out a4_110, out a5_109, out s2_103, out s3_185);
				s0_106 = a0_89;
			}
		}
	}
	Eq_288791 a4_119;
	word32 a0_212;
	word32 a1_213;
	word32 a2_214;
	word32 a3_215;
	word32 a6_216;
	word32 s4_217;
	Eq_288792 a5_116;
	Eq_2 s1_121 = mbedtls_mpi_free(fp + -44, a2_112, a4_110, a5_109, mstatus, dwArg0108, dwArg0148, out a0_212, out a1_213, out a2_214, out a3_215, out a4_119, out a5_116, out a6_216, out s4_217);
	if (s0_106 != 0x00)
	{
		a5_116.u0 = ~0x0400027F;
		s0_106 = (word16) s0_106.u0 - 0x04000280;
	}
	s0Out = s0_106;
	s1Out = s1_121;
	a0Out = s0_106;
	a2Out = dwArg0138;
	a4Out = a4_119;
	a5Out = a5_116;
	a7Out = a7_178;
	s2Out = s2_103;
	s3Out = s3_185;
	s4Out = dwArgF4;
	return ra_102;
}

