pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 230576BE: Register Eq_2 mbedtls_rsa_private(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out (ptr32 byte) s4Out, Register out (ptr32 byte) s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s9Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_rsa_rsaes_oaep_encrypt
//      mbedtls_rsa_pkcs1_encrypt
//      mbedtls_rsa_rsaes_oaep_decrypt
//      mbedtls_rsa_pkcs1_decrypt
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
//      mbedtls_rsa_pkcs1_verify
Eq_2 mbedtls_rsa_private(Eq_2 ra, Eq_2 s1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, byte & s4Out, byte & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s9Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	byte * s4_736;
	Eq_2 s0_101;
	if (a5 == 0x00 || (a5 == 0x00 || a5 == 0x00))
	{
		s0_101.u0 = ~0x0400007F;
		s4_736 = s4;
		goto l2305783A;
	}
	mbedtls_mpi_init(fp + -84);
	mbedtls_mpi_init(fp + -72);
	mbedtls_mpi_init(fp + -60);
	Eq_2 a0_49;
	word32 a3_1022;
	word32 a7_1023;
	word32 a1_1021;
	word32 s0_1020;
	Eq_2 s8_143;
	Eq_2 s4_142;
	struct Eq_289012 * s1_392;
	Eq_2 a5_106;
	Eq_2 a4_104;
	Eq_2 a2_108;
	Eq_2 ra_102 = mbedtls_mpi_read_binary(ra, a3, a2, a3, a4, mstatus, dwLoc58, dwLoc48, dwArg78, dwArg88, dwArgB8, dwArgC8, dwArgF8, dwArg0108, out s0_1020, out s1_392, out a0_49, out a1_1021, out a2_108, out a3_1022, out a4_104, out a5_106, out a7_1023, out s2, out s3, out s4_142, out s8_143);
	s0_101 = a0_49;
	if (a0_49 == 0x00)
	{
		s2 = (char *) s1_392 + 8;
		s0_101.u0 = ~0x03;
		Eq_2 a3_78;
		word32 a6_1038;
		struct Eq_289099 * a1_156;
		if (mbedtls_mpi_cmp_mpi(a2_108, a4_104, a5_106, out a1_156, out a2_108, out a3_78, out a4_104, out a5_106, out a6_1038) >= 0x00)
			goto l2305781E;
		if (s4_142 == 0x00)
		{
l23057728:
			s6 = (char *) s1_392 + 44;
			word32 a3_1039;
			word32 a7_1040;
			Eq_2 a0_424 = mbedtls_mpi_exp_mod(ra_102, (char *) s1_392 + 0x0044, s6, (char *) s1_392 + 116, s11, mstatus, out a2_108, out a3_1039, out a4_104, out a5_106, out a7_1040);
			s0_101 = a0_424;
			if (a0_424 != 0x00)
				goto l2305781E;
			s3 = (char *) s1_392 + 56;
			Eq_2 a3_449;
			word32 a7_1041;
			Eq_2 a0_446 = mbedtls_mpi_exp_mod(ra_102, (char *) s1_392 + 80, s3, (char *) s1_392 + 0x0080, s11, mstatus, out a2_108, out a3_449, out a4_104, out a5_106, out a7_1041);
			s0_101 = a0_446;
			if (a0_446 == 0x00)
			{
				Eq_2 a0_467;
				Eq_2 a3_470;
				word32 s1_477;
				Eq_2 s4_480;
				word32 s8_1043;
				word32 s0_1042;
				Eq_2 ra_475 = mbedtls_mpi_sub_mpi(ra_102, a0_446, fp + -84, a3_449, a4_104, a5_106, s2, mstatus, dwArg38, dwArg58, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, out s0_1042, out s1_477, out a0_467, out a2_108, out a3_470, out a4_104, out a5_106, out s2, out s3, out s4_480, out s8_1043);
				s0_101 = a0_467;
				if (a0_467 != 0x00)
					goto l2305781E;
				Eq_2 s5_506;
				Eq_2 a0_515;
				word32 s8_1048;
				word32 s1_1045;
				word32 a3_1046;
				word32 s4_1047;
				word32 s0_1044;
				Eq_2 ra_500 = mbedtls_mpi_mul_mpi(ra_475, fp + -72, fp + -84, s1_477 + 92, a3_470, a4_104, s2, s4_480, s6, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_1044, out s1_1045, out a0_515, out a2_108, out a3_1046, out a4_104, out a5_106, out s2, out s3, out s4_1047, out s5_506, out s6, out s8_1048);
				s0_101 = a0_515;
				if (a0_515 == 0x00)
				{
					Eq_2 a0_523;
					Eq_2 a3_526;
					Eq_2 s4_539;
					word32 s9_1053;
					word32 s8_1052;
					word32 s5_1051;
					word32 a7_1050;
					word32 s1_1049;
					Eq_2 ra_535 = mbedtls_mpi_mod_mpi(ra_500, fp + -84, fp + -72, s6, s5_506, s6, s7, s10, s11, mstatus, dwLoc58, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_1049, out a0_523, out a2_108, out a3_526, out a4_104, out a5_106, out a7_1050, out s2, out s3, out s4_539, out s5_1051, out s6, out s7, out s8_1052, out s9_1053, out s10, out s11);
					s0_101 = a0_523;
					if (a0_523 != 0x00)
						goto l2305781E;
					Eq_2 a3_556;
					Eq_2 a0_576;
					word32 s8_1057;
					word32 s4_1056;
					word32 s1_1055;
					word32 s0_1054;
					Eq_2 s5_567;
					Eq_2 ra_561 = mbedtls_mpi_mul_mpi(ra_535, fp + -72, fp + -84, s3, a3_526, a4_104, s2, s4_539, s6, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_1054, out s1_1055, out a0_576, out a2_108, out a3_556, out a4_104, out a5_106, out s2, out s3, out s4_1056, out s5_567, out s6, out s8_1057);
					s0_101 = a0_576;
					if (a0_576 == 0x00)
					{
						Eq_2 a0_582;
						Eq_2 a3_585;
						word32 s1_592;
						Eq_2 s4_595;
						word32 s8_1061;
						word32 a7_1060;
						word32 a1_1059;
						word32 s0_1058;
						Eq_2 ra_590 = mbedtls_mpi_add_mpi(ra_561, a0_576, fp + -84, a3_556, a4_104, a5_106, s2, mstatus, dwArg38, dwArg58, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, out s0_1058, out s1_592, out a0_582, out a1_1059, out a2_108, out a3_585, out a4_104, out a5_106, out a7_1060, out s2, out s3, out s4_595, out s8_1061);
						s0_101 = a0_582;
						if (a0_582 != 0x00)
							goto l2305781E;
						if (s4_595 == 0x00)
						{
l230577AA:
							Eq_2 a0_674;
							mbedtls_mpi_write_binary(ra_590, s5_567, a2_108, a4_104, a5_106, out a0_674, out a2_108, out a4_104, out a5_106, out s2, out s3);
							s0_101 = a0_674;
							goto l2305781E;
						}
						Eq_2 s5_621;
						Eq_2 a0_630;
						word32 s8_1066;
						word32 s4_1065;
						word32 s1_1063;
						word32 a3_1064;
						word32 s0_1062;
						Eq_2 ra_615 = mbedtls_mpi_mul_mpi(ra_590, fp + -84, fp + -84, s1_592 + 0x0098, a3_585, a4_104, s2, s4_595, s6, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_1062, out s1_1063, out a0_630, out a2_108, out a3_1064, out a4_104, out a5_106, out s2, out s3, out s4_1065, out s5_621, out s6, out s8_1066);
						s0_101 = a0_630;
						if (a0_630 != 0x00)
							goto l2305781E;
						Eq_2 a0_636;
						word32 s1_1096;
						word32 a3_1097;
						word32 a7_1098;
						word32 s4_1099;
						word32 s8_1100;
						word32 s9_1101;
						ra_590 = mbedtls_mpi_mod_mpi(ra_615, fp + -84, fp + -84, s2, s5_621, s6, s7, s10, s11, mstatus, dwLoc58, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_1096, out a0_636, out a2_108, out a3_1097, out a4_104, out a5_106, out a7_1098, out s2, out s3, out s4_1099, out s5_567, out s6, out s7, out s8_1100, out s9_1101, out s10, out s11);
						s0_101 = a0_636;
						if (a0_636 == 0x00)
							goto l230577AA;
					}
				}
			}
			goto l2305781E;
		}
		Eq_2 a3_208;
		Eq_2 ra_186;
		Eq_2 s4_187;
		word32 s1_179;
		Eq_2 a0_205;
		a5_106 = s1_392->t00A0;
		if (a5_106 != 0x00)
		{
			Eq_2 s5_237;
			Eq_2 a0_246;
			word32 s4_1070;
			word32 s8_1071;
			word32 s1_1068;
			word32 a3_1069;
			word32 s0_1067;
			Eq_2 ra_231 = mbedtls_mpi_mul_mpi(ra_102, (char *) s1_392 + 0x008C, (char *) s1_392 + 0x008C, (char *) s1_392 + 0x008C, a3_78, a4_104, (char *) s1_392 + 8, s4_142, s6, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_1067, out s1_1068, out a0_246, out a2_108, out a3_1069, out a4_104, out a5_106, out s2, out s3, out s4_1070, out s5_237, out s6, out s8_1071);
			s0_101 = a0_246;
			if (a0_246 != 0x00)
				goto l2305781E;
			Eq_2 a0_252;
			Eq_2 a3_255;
			word32 s1_259;
			Eq_2 s4_268;
			word32 s9_1075;
			word32 s8_1074;
			word32 s5_1073;
			word32 a7_1072;
			Eq_2 ra_264 = mbedtls_mpi_mod_mpi(ra_231, s3, s3, s2, s5_237, s6, s7, s10, s11, mstatus, dwLoc58, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_259, out a0_252, out a2_108, out a3_255, out a4_104, out a5_106, out a7_1072, out s2, out s3, out s4_268, out s5_1073, out s6, out s7, out s8_1074, out s9_1075, out s10, out s11);
			s0_101 = a0_252;
			if (a0_252 != 0x00)
				goto l2305781E;
			Eq_2 s5_297;
			Eq_2 a0_306;
			word32 s8_1080;
			word32 s4_1079;
			word32 s1_1077;
			word32 a3_1078;
			word32 s0_1076;
			Eq_2 ra_291 = mbedtls_mpi_mul_mpi(ra_264, s1_259 + 0x0098, s1_259 + 0x0098, s1_259 + 0x0098, a3_255, a4_104, s2, s4_268, s6, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_1076, out s1_1077, out a0_306, out a2_108, out a3_1078, out a4_104, out a5_106, out s2, out s3, out s4_1079, out s5_297, out s6, out s8_1080);
			s0_101 = a0_306;
			if (a0_306 != 0x00)
				goto l2305781E;
			word32 s9_1084;
			word32 s8_1083;
			word32 s5_1082;
			word32 a7_1081;
			ra_186 = mbedtls_mpi_mod_mpi(ra_291, s3, s3, s2, s5_297, s6, s7, s10, s11, mstatus, dwLoc58, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_179, out a0_205, out a2_108, out a3_208, out a4_104, out a5_106, out a7_1081, out s2, out s3, out s4_187, out s5_1082, out s6, out s7, out s8_1083, out s9_1084, out s10, out s11);
		}
		else
		{
			s7.u0 = 0x0C;
			s6 = (char *) s1_392 + 0x0098;
			s3 = (char *) s1_392 + 0x008C;
			do
			{
				s7 = (word16) s7.u0 - 1;
				if (s7 == 0x00)
				{
					s0_101.u0 = ~0x0400047F;
					goto l2305781E;
				}
				Eq_2 a3_109;
				word32 s4_1102;
				word32 s8_1103;
				Eq_2 a0_105 = mbedtls_mpi_fill_random(ra_102, s0_101, a1_156->t0004, (char *) s1_392 + 0x0098, (char *) a1_156 - 1, s4_142, s8_143, a4_104, mstatus, out a2_108, out a3_109, out a4_104, out a5_106, out s2, out s3, out s4_1102, out s8_1103, out mstatus);
				s0_101 = a0_105;
				if (a0_105 != 0x00)
					goto l2305781E;
				Eq_2 a0_151;
				word32 s1_1104;
				word32 a3_1105;
				ra_102 = mbedtls_mpi_gcd(ra_102, (char *) s1_392 + 0x0098, s2, a3_109, a4_104, mstatus, dwArg08, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, out s1_1104, out a0_151, out a2_108, out a3_1105, out a4_104, out a5_106, out s2, out s3, out s4_142, out s8_143);
				s0_101 = a0_151;
				if (a0_151 != 0x00)
					goto l2305781E;
				word32 a3_1106;
				word32 a6_1107;
			} while (mbedtls_mpi_cmp_int(0x01, a2_108, out a1_156, out a2_108, out a3_1106, out a4_104, out a5_106, out a6_1107) != 0x00);
			Eq_2 a0_171;
			word32 a3_1108;
			word32 s5_1109;
			word32 s8_1110;
			word32 s9_1111;
			ra_186 = mbedtls_mpi_inv_mod(ra_102, a0_151, (char *) s1_392 + 0x0098, s2, a4, (char *) s1_392 + 0x0098, s7, s10, s11, mstatus, s2, dwLoc28, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg24, dwArg28, dwArg38, s3, s1, dwArg58, dwArg78, dwArg88, dwArg98, dwArg0104, out s1_179, out a0_171, out a2_108, out a3_1108, out a4_104, out a5_106, out s2, out s3, out s4_187, out s5_1109, out s6, out s7, out s8_1110, out s9_1111, out s10, out s11);
			s0_101 = a0_171;
			if (a0_171 != 0x00)
				goto l2305781E;
			word32 a7_1112;
			a0_205 = mbedtls_mpi_exp_mod(ra_186, s1_179 + 20, s2, s1_179 + 0x0068, s11, mstatus, out a2_108, out a3_208, out a4_104, out a5_106, out a7_1112);
		}
		s0_101 = a0_205;
		if (a0_205 != 0x00)
			goto l2305781E;
		Eq_2 s5_367;
		Eq_2 a0_376;
		word32 s8_1089;
		word32 s4_1088;
		word32 a3_1087;
		word32 s1_1086;
		word32 s0_1085;
		Eq_2 ra_361 = mbedtls_mpi_mul_mpi(ra_186, fp + -84, fp + -84, s1_179 + 0x008C, a3_208, a4_104, s2, s4_187, s6, mstatus, s1, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0138, out s0_1085, out s1_1086, out a0_376, out a2_108, out a3_1087, out a4_104, out a5_106, out s2, out s3, out s4_1088, out s5_367, out s6, out s8_1089);
		s0_101 = a0_376;
		if (a0_376 != 0x00)
			goto l2305781E;
		Eq_2 a0_385;
		word32 a7_1091;
		word32 a3_1090;
		word32 s4_1092;
		word32 s5_1093;
		word32 s8_1094;
		word32 s9_1095;
		ra_102 = mbedtls_mpi_mod_mpi(ra_361, fp + -84, fp + -84, s2, s5_367, s6, s7, s10, s11, mstatus, dwLoc58, s2, dwLoc28, dwLoc1C, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgC8, dwArgD4, out s1_392, out a0_385, out a2_108, out a3_1090, out a4_104, out a5_106, out a7_1091, out s2, out s3, out s4_1092, out s5_1093, out s6, out s7, out s8_1094, out s9_1095, out s10, out s11);
		s0_101 = a0_385;
		if (a0_385 == 0x00)
			goto l23057728;
	}
l2305781E:
	Eq_2 a2_705;
	Eq_2 a5_706;
	Eq_2 a4_709;
	word32 s4_1028;
	word32 a1_1025;
	word32 a3_1026;
	word32 a6_1027;
	word32 a0_1024;
	mbedtls_mpi_free(fp + -84, a2_108, a4_104, a5_106, mstatus, dwArgE8, dwArg0128, out a0_1024, out a1_1025, out a2_705, out a3_1026, out a4_709, out a5_706, out a6_1027, out s4_1028);
	Eq_2 a2_717;
	Eq_2 a5_718;
	Eq_2 a4_721;
	word32 a0_1029;
	word32 a1_1030;
	word32 a6_1032;
	word32 s4_1033;
	word32 a3_1031;
	mbedtls_mpi_free(fp + -72, a2_705, a4_709, a5_706, mstatus, dwArgE8, dwArg0128, out a0_1029, out a1_1030, out a2_717, out a3_1031, out a4_721, out a5_718, out a6_1032, out s4_1033);
	word32 a3_1036;
	word32 a6_1037;
	word32 a1_1035;
	word32 a0_1034;
	mbedtls_mpi_free(fp + -60, a2_717, a4_721, a5_718, mstatus, dwArgE8, dwArg0128, out a0_1034, out a1_1035, out a2, out a3_1036, out a4, out a5, out a6_1037, out s4_736);
	if (s0_101 != 0x00)
	{
		a5.u0 = ~0x040002FF;
		s0_101 = (word16) s0_101.u0 - 0x04000300;
	}
l2305783A:
	s0Out = s0_101;
	s1Out = dwArg28;
	a0Out = s0_101;
	a2Out = a2;
	a3Out = dwArg08;
	a4Out = a4;
	a5Out = a5;
	a7Out = dwLoc18;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4_736;
	s5Out = s4;
	s6Out = s6;
	s7Out = s7;
	s9Out = dwLoc5C;
	s10Out = s10;
	s11Out = s11;
	mstatusOut = mstatus;
	return dwArg68;
}

// 230578E2: void mbedtls_rsa_rsaes_oaep_encrypt(Register (ptr32 Eq_286954) a0, Register (ptr32 code) a1, Register Eq_2 a2, Register int32 a3, Register word32 a4, Register word32 a5, Register Eq_2 a6, Register Eq_2 a7, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg0118)
// Called from:
//      mbedtls_rsa_pkcs1_encrypt
void mbedtls_rsa_rsaes_oaep_encrypt(struct Eq_286954 * a0, <anonymous> * a1, Eq_2 a2, int32 a3, word32 a4, word32 a5, Eq_2 a6, Eq_2 a7, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg0118)
{
	if (a3 == 0x01 && a0->dw00A4 != a3 || a1 == null)
		return;
	word32 a5_474;
	Eq_2 a0_60 = mbedtls_md_info_from_type((word32) a0->b00A8, out a5_474);
	if (a0_60 == 0x00)
		return;
	Eq_2 s0_63 = a0->t0004;
	Eq_2 a0_64 = mbedtls_md_get_size(a0_60);
	Eq_2 a5_67 = (word32) a6 + 2 + (a0_64 << 0x01);
	if (a5_67 < a6 || s0_63 < a5_67)
		return;
	word32 a3_77;
	word32 a4_78;
	word32 a5_79;
	word32 a2_478;
	word32 a0_476;
	word32 a1_477;
	word32 t1_475;
	Eq_2 ra_80 = memset(dwArg0118, s3, 0x00, s0_63, out t1_475, out a0_476, out a1_477, out a2_478, out a3_77, out a4_78, out a5_79);
	s3->u1 = 0x00;
	struct Eq_289804 * sp_88;
	Eq_2 ra_90;
	word32 s0_91;
	Eq_2 s1_92;
	Eq_2 s2_93;
	Eq_2 s4_94;
	Eq_2 s7_97;
	Eq_2 s8_98;
	word32 s9_99;
	Eq_2 s10_100;
	Eq_2 s11_101;
	word32 a0_104;
	word32 tp_114;
	word32 t5_351;
	word32 t6_352;
	a1();
	if (a0_104 == 0x00)
	{
		word32 a5_115 = s7_97 + s1_92;
		sp_88->ptr0084 = a5_115;
		word32 a5_122;
		Eq_2 a1_123;
		Eq_2 ra_126 = mbedtls_md(ra_90, s8_98, s10_100, s11_101, a5_115, out a1_123, out a5_122);
		Eq_2 s0_131 = sp_88->t0064;
		byte * a0_133 = (word32) s1_92 + ((s0_91 - s4_94) + ~0x01) - s9_99 + a5_122;
		*a0_133 = 0x01;
		word32 a4_482;
		word32 a6_484;
		word32 a7_485;
		word32 a5_483;
		word32 a2_480;
		word32 a3_481;
		word32 a1_479;
		memcpy(a0_133 + 1, a1_123, s4_94, out a1_479, out a2_480, out a3_481, out a4_482, out a5_483, out a6_484, out a7_485);
		Eq_2 a3_155;
		Eq_2 a4_156;
		Eq_2 a5_157;
		word32 a0_166;
		Eq_2 a2_168;
		Eq_2 a4_170;
		Eq_2 a5_171;
		ptr32 mstatus_173;
		word32 s1_175;
		word32 s3_177;
		word32 a3_486;
		word32 s4_488;
		word32 s8_489;
		word32 s2_487;
		Eq_2 ra_174 = mbedtls_md_setup(mbedtls_md_init(ra_126, &sp_88->t0014, out a3_155, out a4_156, out a5_157), s0_131, s1_92, &sp_88->t0014, s8_98, 0x00, a3_155, a4_156, a5_157, s2_93, mstatus, sp_88->t0010, sp_88->t0014, sp_88->t0038, sp_88->t0108, sp_88->t0148, out s1_175, out a0_166, out a2_168, out a3_486, out a4_170, out a5_171, out s2_487, out s3_177, out s4_488, out s8_489, out mstatus_173);
		if (a0_166 != 0x00)
		{
			word32 a5_503;
			mbedtls_md_free(ra_174, &sp_88->t0014, a2_168, a4_170, a5_171, mstatus_173, out a5_503);
		}
		else
		{
			Eq_2 s1_203;
			Eq_2 a2_220;
			Eq_2 a3_221;
			Eq_2 a4_222;
			Eq_2 a5_223;
			Eq_2 s1_227;
			Eq_2 s2_228;
			Eq_2 s3_229;
			Eq_2 s6_232;
			word32 s5_502;
			word32 s5_498;
			word32 s0_500;
			word32 s4_501;
			word32 s6_499;
			word32 a5_494;
			word32 s3_496;
			word32 s4_497;
			word32 s2_495;
			word32 s0_490;
			word32 a3_492;
			word32 a4_493;
			word32 a2_491;
			Eq_2 ra_225 = mgf_mask(mgf_mask(ra_174, s1_175 + 1 + s3_177, (word32) s0_131 - 1 - s1_175, out s0_490, out s1_203, out a2_491, out a3_492, out a4_493, out a5_494, out s2_495, out s3_496, out s4_497, out s5_498, out s6_499), s7_97, s1_203, out s0_500, out s1_227, out a2_220, out a3_221, out a4_222, out a5_223, out s2_228, out s3_229, out s4_501, out s5_502, out s6_232);
			Eq_2 a5_240;
			mbedtls_md_free(ra_225, &sp_88->t0014, a2_220, a4_222, a5_223, mstatus_173, out a5_240);
			if (a5_240 == 0x00)
			{
				word32 s1_523;
				word32 s0_522;
				word32 a0_524;
				word32 a2_525;
				word32 a4_526;
				word32 a5_527;
				word32 a7_528;
				word32 s2_529;
				word32 s3_530;
				word32 s4_531;
				mbedtls_rsa_public(ra_225, s3_229, a3_221, a4_222, s2_228, s11_101, mstatus_173, sp_88->t0024, sp_88->t0064, sp_88->t0098, sp_88->t00A8, sp_88->t00D8, sp_88->t00E8, sp_88->t0108, sp_88->t0118, sp_88->t0128, sp_88->t0148, out s0_522, out s1_523, out a0_524, out a2_525, out a4_526, out a5_527, out a7_528, out s2_529, out s3_530, out s4_531);
			}
			else
			{
				word32 s3_513;
				word32 s2_512;
				word32 a5_510;
				word32 s5_515;
				word32 s7_517;
				word32 s6_516;
				word32 s4_514;
				word32 s9_518;
				word32 s10_519;
				word32 mstatus_521;
				word32 s11_520;
				word32 a7_511;
				word32 a0_506;
				word32 a3_508;
				word32 a4_509;
				word32 a2_507;
				word32 s0_504;
				word32 s1_505;
				mbedtls_rsa_private(ra_225, s1_227, s6_232, s3_229, s3_229, a5_240, s2_228, s3_229, s6_232, s7_97, s10_100, s11_101, mstatus_173, sp_88->t0008, sp_88->t0018, sp_88->t0024, sp_88->t0028, sp_88->t0038, sp_88->t0058, sp_88->t0068, sp_88->t0078, sp_88->t0088, sp_88->t0098, sp_88->t00A8, sp_88->t00B4, sp_88->t00B8, sp_88->t00C8, sp_88->t00D4, sp_88->t00D8, sp_88->t00E8, sp_88->t00F8, sp_88->t0104, sp_88->t0108, sp_88->t0128, sp_88->t0138, out s0_504, out s1_505, out a0_506, out a2_507, out a3_508, out a4_509, out a5_510, out a7_511, out s2_512, out s3_513, out s4_514, out s5_515, out s6_516, out s7_517, out s9_518, out s10_519, out s11_520, out mstatus_521);
			}
		}
	}
}

