pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 23057A30: void mbedtls_rsa_rsaes_pkcs1_v15_encrypt(Register Eq_2 ra, Register (ptr32 Eq_286953) s0, Register (ptr32 Eq_286954) a0, Register (ptr32 code) a1, Register Eq_2 a2, Register int32 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 s5, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148)
// Called from:
//      mbedtls_rsa_pkcs1_encrypt
void mbedtls_rsa_rsaes_pkcs1_v15_encrypt(Eq_2 ra, struct Eq_286953 * s0, struct Eq_286954 * a0, <anonymous> * a1, Eq_2 a2, int32 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 s5, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148)
{
	if (a3 == 0x01 && a0->dw00A4 != 0x00 || (a1 == null || (a5 == 0x00 || a6 == 0x00)))
		return;
	Eq_2 a0_52 = s0->t0004;
	if (a4 <= ~0x0B && s0 >= (word32) a4 + 11)
	{
		Eq_2 ra_101;
		Eq_2 s0_102;
		a6->u1 = 0x00;
		struct Eq_290264 * s0_58 = s0 - a4;
		Eq_2 s1_103 = a6;
		Eq_2 s9_108 = a5;
		Eq_2 s8_107 = a4;
		int32 s5_105 = a3;
		Eq_2 s6_125 = a2;
		<anonymous> * s4_123 = a1;
		Eq_2 s3_104 = a0_52;
		word32 s2_121 = a6 + 2;
		if (a3 != 0x00)
		{
			((word32) a6 + 1)->u1 = 0x01;
			struct Eq_290405 * a3_74;
			word32 a5_75 = s0_58 + ~0x02 + a6;
			for (a3_74 = (word32) a6 + 2; a5_75 != a3_74; ++a3_74)
				a3_74->b0000 = ~0x00;
			s0_102 = s0_58 + ~0x02 + (a6 + 2);
			ra_101 = ra;
			goto l23057A9C;
		}
		((word32) a6 + 1)->u1 = 0x02;
		word32 a5_134 = 0x02;
		s0_102 = s0_58 + ~0x00 + a6;
		ra_101 = ra;
l23057A98:
		if (s2_121 == s0_102)
		{
l23057A9C:
			s0_102->u1 = 0x00;
			Eq_2 a4_169;
			Eq_2 a5_170;
			Eq_2 a3_174;
			word32 a1_666;
			word32 a7_669;
			word32 a2_667;
			word32 a6_668;
			memcpy((word32) s0_102 + 1, s9_108, s8_107, out a1_666, out a2_667, out a3_174, out a4_169, out a5_170, out a6_668, out a7_669);
			if (s5_105 != 0x00)
			{
				0x00 = (uint16) dwArg0128;
				word32 s10_695;
				word32 s11_696;
				word32 mstatus_697;
				word32 s4_690;
				word32 s7_693;
				word32 s9_694;
				word32 s5_691;
				word32 s6_692;
				word32 a4_685;
				word32 s2_688;
				word32 s3_689;
				word32 a5_686;
				word32 a7_687;
				word32 s0_680;
				word32 a2_683;
				word32 a3_684;
				word32 s1_681;
				word32 a0_682;
				mbedtls_rsa_private(ra_101, s1_103, s6_125, s1_103, s1_103, a5_170, s2_121, s3_104, s6_125, s7, s10, s11, mstatus, dwArg08, dwArg18, dwArg24, dwArg28, dwArg38, s5, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD4, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0108, dwArg0128, dwArg0138, out s0_680, out s1_681, out a0_682, out a2_683, out a3_684, out a4_685, out a5_686, out a7_687, out s2_688, out s3_689, out s4_690, out s5_691, out s6_692, out s7_693, out s9_694, out s10_695, out s11_696, out mstatus_697);
				return;
			}
			else
			{
				0x00 = (uint16) dwArg0128;
				word32 a5_675;
				word32 s3_678;
				word32 s4_679;
				word32 a7_676;
				word32 s2_677;
				word32 s1_671;
				word32 a4_674;
				word32 a0_672;
				word32 a2_673;
				word32 s0_670;
				mbedtls_rsa_public(ra_101, s1_103, a3_174, a4_169, s2_121, s11, mstatus, dwArg24, ra, dwArg98, dwArgA8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s0_670, out s1_671, out a0_672, out a2_673, out a4_674, out a5_675, out a7_676, out s2_677, out s3_678, out s4_679);
				return;
			}
		}
		int32 s7_106 = 100;
		do
		{
			word32 a0_114;
			word32 tp_131;
			word32 t3_132;
			word32 t5_323;
			word32 t6_324;
			word32 t1_321;
			word32 t4_322;
			word32 t0_320;
			s4_123();
			a5_134 = (word32) *s2_121;
			if (a5_134 != 0x00)
			{
				if (a0_114 != 0x00)
					break;
				s2_121 = (word32) s2_121 + 1;
				goto l23057A98;
			}
			s7_106 = (word32) s7 - 1;
		} while (s7 != ~0x00 && a0_114 == 0x00);
	}
	0x00 = (uint16) dwArg0128;
}

// 23057B68: void mbedtls_rsa_pkcs1_encrypt(Register Eq_2 ra, Register (ptr32 Eq_286953) s0, Register (ptr32 Eq_286954) a0, Register (ptr32 code) a1, Register Eq_2 a2, Register int32 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148)
// Called from:
//      rsa_encrypt_wrap
void mbedtls_rsa_pkcs1_encrypt(Eq_2 ra, struct Eq_286953 * s0, struct Eq_286954 * a0, <anonymous> * a1, Eq_2 a2, int32 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 s3, Eq_2 s5, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148)
{
	int32 t4_5 = a0->dw00A4;
	if (t4_5 == 0x00)
		mbedtls_rsa_rsaes_pkcs1_v15_encrypt(ra, s0, a0, a1, a2, a3, a4, a5, a6, s5, s7, s10, s11, mstatus, dwArg08, dwArg18, dwArg24, dwArg28, dwArg38, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD4, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148);
	else
	{
		if (t4_5 != 0x01)
			return;
		mbedtls_rsa_rsaes_oaep_encrypt(a0, a1, a2, a3, 0x00, 0x00, a4, a5, s3, mstatus, dwArgF8);
	}
}

