pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305828C: void mbedtls_rsa_pkcs1_sign(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 a7, Register Eq_2 s2, Register word32 s8, Register Eq_2 s9, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack word32 dwArg0198)
// Called from:
//      rsa_sign_wrap
void mbedtls_rsa_pkcs1_sign(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 a7, Eq_2 s2, word32 s8, Eq_2 s9, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0158, word32 dwArg0198)
{
	Eq_2 t1_5 = *((word32) a0 + 0x00A4);
	if (t1_5 == 0x00)
		mbedtls_rsa_rsassa_pkcs1_v15_sign(ra, s1, a0, a1, a2, a3, a4, a5, a6, a7, s2, s9, s10, s11, mstatus, dwArg04, dwArg18, dwArg24, dwArg28, dwArg38, dwArg68, dwArg74, dwArg78, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0158, dwArg0198);
	else
	{
		if (t1_5 != 0x01)
			return;
		mbedtls_rsa_rsassa_pss_sign(ra, a0, a1, a2, a3, a4, a5, a6, a7, s8, mstatus);
	}
}

// 230582AA: Register Eq_2 mbedtls_rsa_rsassa_pss_verify_ext(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a7, Register Eq_2 s3, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 a7Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_pk_verify_ext
//      mbedtls_rsa_pkcs1_verify
Eq_2 mbedtls_rsa_rsassa_pss_verify_ext(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a7, Eq_2 s3, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & a7Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a4_100;
	Eq_2 s0_120;
	Eq_2 s5_129 = a4;
	Eq_2 s9_137 = a7;
	Eq_2 s7_287 = dwArg00;
	Eq_2 a5_101 = dwArg04;
	if (a3 == 0x01)
	{
		a4_100 = *((word32) a0 + 0x00A4);
		if (a4_100 != a3)
			goto l230582FA;
	}
	Eq_2 s2_43 = *((word32) a0 + 4);
	a4_100.u0 = 1008;
	if (s2_43 > -0x0400)
		goto l230582FA;
	Eq_2 s2_107;
	Eq_2 s4_109;
	Eq_2 ra_104;
	Eq_2 a0_118;
	if (a3 == 0x00)
	{
		word32 s3_791;
		word32 a2_790;
		word32 s1_789;
		word32 s0_788;
		ra_104 = mbedtls_rsa_public(ra, dwArg04, a3, 1008, s2_43, s11, mstatus, dwLoc044C, dwLoc040C, dwLoc03D8, dwLoc03C8, dwLoc0398, dwLoc0388, dwLoc0368, dwLoc0358, dwLoc0348, dwLoc0328, out s0_788, out s1_789, out a0_118, out a2_790, out a4_100, out a5_101, out a7, out s2_107, out s3_791, out s4_109);
	}
	else
	{
		word32 a2_784;
		word32 a3_785;
		word32 s3_786;
		word32 s6_787;
		word32 s1_783;
		word32 s0_782;
		ra_104 = mbedtls_rsa_private(ra, a0, a2, dwArg04, fp + -0x0430, dwArg04, s2_43, s3, a5, dwArg00, s10, s11, mstatus, dwLoc0468, dwLoc0458, dwLoc044C, dwLoc0448, dwLoc0438, dwLoc0418, dwLoc0408, dwLoc03F8, dwLoc03E8, dwLoc03D8, dwLoc03C8, dwLoc03BC, dwLoc03B8, dwLoc03A8, dwLoc039C, dwLoc0398, dwLoc0388, dwLoc0378, dwLoc036C, dwLoc0368, dwLoc0348, dwLoc0338, out s0_782, out s1_783, out a0_118, out a2_784, out a3_785, out a4_100, out a5_101, out a7, out s2_107, out s3_786, out s4_109, out s5_129, out s6_787, out s7_287, out s9_137, out s10, out s11, out mstatus);
	}
	s0_120 = a0_118;
	if (a0_118 != 0x00)
	{
l23058300:
		a4Out = a4_100;
		a5Out = a5_101;
		a7Out = a7;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return s0_120;
	}
	Eq_2 s3_122 = (word32) s2_107 - 1;
	a4_100 = (word32) ((word32) s3_122 + (fp + -48) + -0x0400);
	a5_101.u0 = 188;
	if (a4_100 != 188)
	{
l230584AC:
		s0_120.u0 = ~0x040000FF;
		goto l23058300;
	}
	if (s5_129 != 0x00)
	{
		Eq_2 a0_132 = mbedtls_md_info_from_type(s5_129, out a5_101);
		if (a0_132 == 0x00)
		{
l230582FA:
			s0_120.u0 = ~0x0400007F;
			goto l23058300;
		}
		mbedtls_md_get_size(a0_132);
	}
	Eq_2 a0_140 = mbedtls_md_info_from_type(s9_137, out a5_101);
	if (a0_140 != 0x00)
	{
		Eq_2 a0_143 = mbedtls_md_get_size(a0_140);
		word32 a1_794;
		word32 a0_793;
		word32 t1_792;
		word32 a3_795;
		Eq_2 a2_153;
		Eq_2 a4_155;
		Eq_2 a5_156;
		Eq_2 ra_157 = memset(ra_104, fp + -0x0464, 0x00, 0x08, out t1_792, out a0_793, out a1_794, out a2_153, out a3_795, out a4_155, out a5_156);
		word32 a4_799;
		word32 a1_796;
		word32 a2_797;
		word32 a3_798;
		word32 a5_800;
		struct Eq_287564 * a0_163 = mbedtls_mpi_bitlen(a2_153, a4_155, a5_156, out a1_796, out a2_797, out a3_798, out a4_799, out a5_800);
		Eq_2 s1_173 = s4_109;
		if (((char *) a0_163 - 1 & 7) == 0x00)
		{
			s2_107 = s3_122;
			s1_173 = fp + -1071;
		}
		a5_101 = (word32) bLoc0430;
		a4_100 = a5_101 >> ((char *) a0_163 + 7) + ((word32) s2_107 - 8);
		if (a4_100 == 0x00)
		{
			Eq_2 a3_194;
			Eq_2 a4_195;
			Eq_2 a5_196;
			Eq_2 a0_208;
			Eq_2 a2_210;
			Eq_2 a5_213;
			Eq_2 s1_217;
			word32 s2_218;
			word32 a3_801;
			word32 s3_802;
			word32 s4_803;
			word32 s8_804;
			Eq_2 ra_216 = mbedtls_md_setup(mbedtls_md_init(ra_157, fp + -1116, out a3_194, out a4_195, out a5_196), a0_140, s1_173, fp + -1116, a0_140, 0x00, a3_194, a4_195, a5_196, s2_107, mstatus, dwLoc0460, dwLoc045C, dwLoc0438, dwLoc0368, dwLoc0328, out s1_217, out a0_208, out a2_210, out a3_801, out a4_100, out a5_213, out s2_218, out s3_802, out s4_803, out s8_804, out mstatus);
			s0_120 = a0_208;
			if (a0_208 != 0x00)
			{
				mbedtls_md_free(ra_216, fp + -1116, a2_210, a4_100, a5_213, mstatus, out a5_101);
				goto l23058300;
			}
			a4_100 = (word32) bLoc0430;
			Eq_2 a2_236;
			ui32 s2_244;
			word32 s3_245;
			byte * s4_246;
			Eq_2 s5_247;
			word32 s0_805;
			word32 a3_806;
			word32 a5_808;
			word32 s6_809;
			word32 a4_807;
			Eq_2 s1_243;
			Eq_2 ra_241 = mgf_mask(ra_216, s1_217, ~a0_143 + s2_218, out s0_805, out s1_243, out a2_236, out a3_806, out a4_807, out a5_808, out s2_244, out s3_245, out s4_246, out s5_247, out s6_809);
			Eq_2 a5_259 = 0x00FF >> (s2_244 << 0x03) - ((char *) a0_163 - 1) & a4_100;
			Eq_2 s2_261 = s4_246 + s2_244;
			while (s1_243 < s2_261)
			{
				a5_259 = (word32) *s1_243;
				a4_100 = (word32) s1_243 + 1;
				if (a5_259 != 0x00)
					goto l2305842E;
				s1_243 = a4_100;
			}
			if (s2_261 == s1_243)
			{
l230584A6:
				mbedtls_md_free(ra_241, fp + -1116, a2_236, a4_100, a5_259, mstatus, out a5_101);
				goto l230584AC;
			}
l2305842E:
			a4_100 = (word32) *s1_243;
			a5_259.u0 = 0x01;
			word32 s0_272 = s1_243 + 1;
			if (a4_100 != 0x01)
				goto l230584A6;
			a5_259.u0 = ~0x00;
			Eq_2 s3_282 = s3_245 - s5_247 - (s0_272 - s4_246);
			if (s7_287 != ~0x00 && s7_287 != s3_282)
				goto l230584A6;
			struct Eq_287420 * a5_317;
			struct Eq_287420 * a5_324;
			struct Eq_287420 * a5_337;
			struct Eq_287422 * a5_346;
			Eq_2 a2_351;
			Eq_2 a5_352;
			word32 a5_810;
			mbedtls_md_free(mbedtls_md_finish(mbedtls_md_update(mbedtls_md_update(mbedtls_md_update(mbedtls_md_starts(ra_241, fp + -1116, ~0x00, dwLoc0460, out a5_317), fp + -1116, a5_317, dwLoc0460, out a5_324), fp + -1116, a5_324, dwLoc0460, out a5_337), fp + -1116, a5_337, dwLoc0460, out a5_346), fp + -1116, a5_346, dwLoc0460, out a2_351, out a5_352), fp + -1116, a2_351, a4_100, a5_352, mstatus, out a5_810);
			word32 a1_811;
			word32 a2_812;
			word32 a3_813;
			word32 a0_364 = memcmp(s0_272 + s3_282, fp + -1104, s5_247, out a1_811, out a2_812, out a3_813, out a4_100, out a5_101);
			s0_120 = a0_364;
			if (a0_364 != 0x00)
				s0_120.u0 = ~0x0400037F;
			goto l23058300;
		}
	}
	goto l230582FA;
}

// 230584B4: Register Eq_2 mbedtls_rsa_rsassa_pss_verify(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Register out ptr32 a5Out)
// Called from:
//      mbedtls_rsa_pkcs1_verify
Eq_2 mbedtls_rsa_rsassa_pss_verify(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, Eq_2 s10, Eq_2 s11, ptr32 mstatus, ptr32 & a5Out)
{
	Eq_2 t1_7 = *((word32) a0 + 0x00A8);
	Eq_2 a7_10 = t1_7 & 0x00FF;
	if (t1_7 == 0x00)
		a7_10 = a4;
	word32 mstatus_68;
	word32 s11_67;
	word32 s10_66;
	word32 a7_65;
	word32 a4_64;
	ptr32 a5_38;
	Eq_2 a0_36 = mbedtls_rsa_rsassa_pss_verify_ext(ra, a0, a2, a3, a4, a5, a7_10, s3, s10, s11, mstatus, ~0x00, dwLoc1C, out a4_64, out a5_38, out a7_65, out s10_66, out s11_67, out mstatus_68);
	a5Out = a5_38;
	return a0_36;
}

// 230584D8: Register Eq_2 mbedtls_rsa_rsassa_pkcs1_v15_verify(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 a7, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_rsa_pkcs1_verify
Eq_2 mbedtls_rsa_rsassa_pkcs1_v15_verify(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 a7, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, union Eq_2 & a5Out)
{
	if (a3 == 0x01 && *((word32) a0 + 0x00A4) != 0x00)
	{
		a5Out = a5;
		return ~0x0400007F;
	}
	Eq_2 a0_111;
	if (*((word32) a0 + 4) <= -0x0400)
	{
		Eq_2 s3_101;
		Eq_2 s2_100;
		Eq_2 s1_141;
		Eq_292413 s0_122;
		ui32 s4_102;
		if (a3 == 0x00)
		{
			word32 a4_611;
			word32 a7_612;
			word32 a2_610;
			mbedtls_rsa_public(ra, a7, a3, a4, a4, s11, mstatus, dwLoc041C, dwLoc03DC, dwLoc03A8, dwLoc0398, dwLoc0368, dwLoc0358, dwLoc0338, dwLoc0328, dwLoc0318, dwLoc02F8, out s0_122, out s1_141, out a0_111, out a2_610, out a4_611, out a5, out a7_612, out s2_100, out s3_101, out s4_102);
		}
		else
		{
			word32 s11_648;
			word32 mstatus_649;
			word32 s10_647;
			word32 s9_646;
			word32 s5_643;
			word32 s7_645;
			word32 s6_644;
			word32 a7_642;
			word32 a4_641;
			word32 a2_639;
			word32 a3_640;
			mbedtls_rsa_private(ra, a5, a2, a7, fp + -0x0420, a5, a4, a6, s6, s7, s10, s11, mstatus, dwLoc0438, dwLoc0428, dwLoc041C, dwLoc0418, dwLoc0408, dwLoc03E8, dwLoc03D8, dwLoc03C8, dwLoc03B8, dwLoc03A8, dwLoc0398, dwLoc038C, dwLoc0388, dwLoc0378, dwLoc036C, dwLoc0368, dwLoc0358, dwLoc0348, dwLoc033C, dwLoc0338, dwLoc0318, dwLoc0308, out s0_122, out s1_141, out a0_111, out a2_639, out a3_640, out a4_641, out a5, out a7_642, out s2_100, out s3_101, out s4_102, out s5_643, out s6_644, out s7_645, out s9_646, out s10_647, out s11_648, out mstatus_649);
		}
		if (a0_111 != 0x00)
		{
l230584F4:
			a5Out = a5;
			return a0_111;
		}
		a5 = (word32) bLoc0420;
		if (a5 != 0x00)
		{
l23058558:
			a0_111.u0 = ~0x040000FF;
			goto l230584F4;
		}
		a5.u0 = 0x01;
		if ((word32) bLoc041F != 0x01)
			goto l23058558;
		a5 = (word32) s0_122 + (s4_102 + -1);
		while (true)
		{
			int32 a4_129 = (word32) *a0_111.u0;
			if (a4_129 == 0x00)
				break;
			if (a0_111 >= a5 || a4_129 != 0x00FF)
				goto l23058558;
			a0_111 = (word16) a0_111.u0 + 1;
		}
		Eq_2 a0_134 = (word16) a0_111.u0 + 1;
		Eq_2 s0_139 = s4_102 - (a0_134 - s0_122);
		if (s0_139 == s1_141 && s2_100 == 0x00)
		{
			word32 a4_616;
			word32 a3_615;
			word32 a2_614;
			word32 a1_613;
			a0_111 = memcmp(a0_134, s3_101, s1_141, out a1_613, out a2_614, out a3_615, out a4_616, out a5);
			if (a0_111 == 0x00)
				goto l230584F4;
			goto l230585AA;
		}
		Eq_2 a0_146 = mbedtls_md_info_from_type(s2_100, out a5);
		if (a0_146 != 0x00)
		{
			Eq_2 a0_150 = mbedtls_md_get_size(a0_146);
			word32 s1_158 = s1_141 + s0_139;
			word32 a4_620;
			word32 a3_619;
			word32 a2_618;
			word32 a1_617;
			if (mbedtls_asn1_get_tag(s1_158, fp + -0x0434, 48, a5, out a1_617, out a2_618, out a3_619, out a4_620, out a5) == 0x00)
			{
				a5 = (word32) a5 + 2;
				if ((word32) a5 + 2 == s0_139)
				{
					word32 a4_624;
					word32 a3_623;
					word32 a1_621;
					word32 a2_622;
					if (mbedtls_asn1_get_tag(s1_158, fp + -0x0434, 48, (word32) a5 + 2, out a1_621, out a2_622, out a3_623, out a4_624, out a5) == 0x00)
					{
						a5 = (word32) a0_150 + ((word32) a5 + 6);
						if (a5 == s0_139)
						{
							Eq_2 a2_192;
							word32 a4_194;
							word32 a3_626;
							word32 a1_625;
							if (mbedtls_asn1_get_tag(s1_158, fp + -0x0428, 0x06, a5, out a1_625, out a2_192, out a3_626, out a4_194, out a5) == 0x00)
							{
								Eq_2 a5_201 = (word32) a5 + a4_194;
								byte bLoc0435_363 = SLICE(a5_201, byte, 24);
								word32 a0_203;
								Eq_2 s2_210;
								Eq_2 s1_209 = mbedtls_oid_get_md_alg(fp + -0x042C, fp + -1077, a2_192, a5_201, dwLoc0408, out a0_203, out s2_210);
								if (a0_203 == 0x00)
								{
									a5 = (word32) bLoc0435_363;
									if (a5 == s2_210)
									{
										word32 a4_630;
										word32 a3_629;
										word32 a2_628;
										word32 a1_627;
										if (mbedtls_asn1_get_tag(s1_209, fp + -0x0434, 0x05, a5, out a1_627, out a2_628, out a3_629, out a4_630, out a5) == 0x00)
										{
											word32 a4_634;
											word32 a3_633;
											word32 a2_632;
											word32 a1_631;
											Eq_2 a0_228 = mbedtls_asn1_get_tag(s1_209, fp + -0x0434, 0x04, a5, out a1_631, out a2_632, out a3_633, out a4_634, out a5);
											if (a0_228 == 0x00 && a5 == a0_150)
											{
												word32 a4_638;
												word32 a3_637;
												word32 a2_636;
												word32 a1_635;
												a0_111 = memcmp(a0_228, s3_101, a0_150, out a1_635, out a2_636, out a3_637, out a4_638, out a5);
												if (a0_111 == 0x00 && s1_209 == a0_150 + a5)
													goto l230584F4;
											}
										}
									}
								}
							}
						}
					}
				}
			}
l230585AA:
			a0_111.u0 = ~0x0400037F;
			goto l230584F4;
		}
	}
	a0_111.u0 = ~0x0400007F;
	goto l230584F4;
}

// 23058668: Register Eq_2 mbedtls_rsa_pkcs1_verify(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 a7, Register Eq_2 s3, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Register out Eq_2 a5Out)
// Called from:
//      rsa_verify_wrap
Eq_2 mbedtls_rsa_pkcs1_verify(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 a7, Eq_2 s3, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, union Eq_2 & a5Out)
{
	Eq_2 t1_5 = *((word32) a0 + 0x00A4);
	if (t1_5 == 0x00)
	{
		Eq_2 a5_25;
		Eq_2 a0_18 = mbedtls_rsa_rsassa_pkcs1_v15_verify(ra, a0, a2, a3, a4, a5, a6, a7, s6, s7, s10, s11, mstatus, out a5_25);
		a5Out = a5_25;
		return a0_18;
	}
	else if (t1_5 == 0x01)
	{
		Eq_2 a5_48;
		Eq_2 a0_43 = mbedtls_rsa_rsassa_pss_verify(ra, a0, a2, a3, a4, a5, s3, s10, s11, mstatus, out a5_48);
		a5Out = a5_48;
		return a0_43;
	}
	else
	{
		a5Out = a5;
		return ~0x040000FF;
	}
}

// 23058686: Register Eq_2 mbedtls_rsa_free(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0188, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_2) a5Out)
// Called from:
//      pk_parse_key_pkcs1_der
//      rsa_free_wrap
Eq_2 mbedtls_rsa_free(Eq_2 a0, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0178, Eq_2 dwArg0188, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a2_16;
	Eq_2 a5_17;
	Eq_2 a4_20;
	word32 a0_183;
	word32 a1_184;
	word32 a3_185;
	word32 a6_186;
	word32 s4_187;
	mbedtls_mpi_free((word32) a0 + 0x008C, a2, a4, a5, mstatus, dwArg0138, dwArg0178, out a0_183, out a1_184, out a2_16, out a3_185, out a4_20, out a5_17, out a6_186, out s4_187);
	Eq_2 a2_28;
	Eq_2 a5_29;
	Eq_2 a4_32;
	word32 a0_188;
	word32 a1_189;
	word32 a3_190;
	word32 a6_191;
	word32 s4_192;
	mbedtls_mpi_free((word32) a0 + 0x0098, a2_16, a4_20, a5_17, mstatus, dwArg0138, dwArg0178, out a0_188, out a1_189, out a2_28, out a3_190, out a4_32, out a5_29, out a6_191, out s4_192);
	Eq_2 a2_40;
	Eq_2 a5_41;
	Eq_2 a4_44;
	word32 a0_193;
	word32 a1_194;
	word32 a3_195;
	word32 a6_196;
	word32 s4_197;
	mbedtls_mpi_free((word32) a0 + 0x0080, a2_28, a4_32, a5_29, mstatus, dwArg0138, dwArg0178, out a0_193, out a1_194, out a2_40, out a3_195, out a4_44, out a5_41, out a6_196, out s4_197);
	Eq_2 a2_52;
	Eq_2 a5_53;
	Eq_2 a4_56;
	word32 a0_198;
	word32 a1_199;
	word32 a3_200;
	word32 a6_201;
	word32 s4_202;
	mbedtls_mpi_free((word32) a0 + 116, a2_40, a4_44, a5_41, mstatus, dwArg0138, dwArg0178, out a0_198, out a1_199, out a2_52, out a3_200, out a4_56, out a5_53, out a6_201, out s4_202);
	Eq_2 a2_64;
	Eq_2 a5_65;
	Eq_2 a4_68;
	word32 a0_203;
	word32 a1_204;
	word32 a3_205;
	word32 a6_206;
	word32 s4_207;
	mbedtls_mpi_free((word32) a0 + 0x0068, a2_52, a4_56, a5_53, mstatus, dwArg0138, dwArg0178, out a0_203, out a1_204, out a2_64, out a3_205, out a4_68, out a5_65, out a6_206, out s4_207);
	Eq_2 a2_76;
	Eq_2 a5_77;
	Eq_2 a4_80;
	word32 a0_208;
	word32 a1_209;
	word32 a3_210;
	word32 a6_211;
	word32 s4_212;
	mbedtls_mpi_free((word32) a0 + 92, a2_64, a4_68, a5_65, mstatus, dwArg0138, dwArg0178, out a0_208, out a1_209, out a2_76, out a3_210, out a4_80, out a5_77, out a6_211, out s4_212);
	Eq_2 a2_88;
	Eq_2 a5_89;
	Eq_2 a4_92;
	word32 a0_213;
	word32 a1_214;
	word32 a3_215;
	word32 a6_216;
	word32 s4_217;
	mbedtls_mpi_free((word32) a0 + 80, a2_76, a4_80, a5_77, mstatus, dwArg0138, dwArg0178, out a0_213, out a1_214, out a2_88, out a3_215, out a4_92, out a5_89, out a6_216, out s4_217);
	Eq_2 a2_100;
	Eq_2 a5_101;
	Eq_2 a4_104;
	word32 a0_218;
	word32 a1_219;
	word32 a3_220;
	word32 a6_221;
	word32 s4_222;
	mbedtls_mpi_free((word32) a0 + 0x0044, a2_88, a4_92, a5_89, mstatus, dwArg0138, dwArg0178, out a0_218, out a1_219, out a2_100, out a3_220, out a4_104, out a5_101, out a6_221, out s4_222);
	Eq_2 a2_112;
	Eq_2 a5_113;
	Eq_2 a4_116;
	word32 a0_223;
	word32 a1_224;
	word32 a3_225;
	word32 a6_226;
	word32 s4_227;
	mbedtls_mpi_free((word32) a0 + 56, a2_100, a4_104, a5_101, mstatus, dwArg0138, dwArg0178, out a0_223, out a1_224, out a2_112, out a3_225, out a4_116, out a5_113, out a6_226, out s4_227);
	Eq_2 a2_124;
	Eq_2 a5_125;
	Eq_2 a4_128;
	word32 a0_228;
	word32 a1_229;
	word32 a3_230;
	word32 a6_231;
	word32 s4_232;
	mbedtls_mpi_free((word32) a0 + 44, a2_112, a4_116, a5_113, mstatus, dwArg0138, dwArg0178, out a0_228, out a1_229, out a2_124, out a3_230, out a4_128, out a5_125, out a6_231, out s4_232);
	Eq_2 a2_136;
	Eq_2 a5_137;
	Eq_2 a4_140;
	word32 a0_233;
	word32 a1_234;
	word32 a3_235;
	word32 a6_236;
	word32 s4_237;
	mbedtls_mpi_free((word32) a0 + 32, a2_124, a4_128, a5_125, mstatus, dwArg0138, dwArg0178, out a0_233, out a1_234, out a2_136, out a3_235, out a4_140, out a5_137, out a6_236, out s4_237);
	Eq_2 a5_149;
	Eq_2 a4_152;
	word32 a0_238;
	word32 a1_239;
	word32 a2_240;
	word32 a3_241;
	word32 a6_242;
	word32 s4_243;
	mbedtls_mpi_free((word32) a0 + 20, a2_136, a4_140, a5_137, mstatus, dwArg0138, dwArg0178, out a0_238, out a1_239, out a2_240, out a3_241, out a4_152, out a5_149, out a6_242, out s4_243);
	union Eq_2 * a5_164;
	ptr32 a3_166;
	ptr32 a4_167;
	word32 a0_244;
	word32 a1_245;
	word32 a2_246;
	word32 a6_247;
	word32 s4_248;
	Eq_2 s1_169 = mbedtls_mpi_free((word32) a0 + 8, dwArg10, a4_152, a5_149, mstatus, dwArg0148, dwArg0188, out a0_244, out a1_245, out a2_246, out a3_166, out a4_167, out a5_164, out a6_247, out s4_248);
	a3Out = a3_166;
	a4Out = a4_167;
	a5Out = a5_164;
	return s1_169;
}

