pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 230586FC: Register Eq_2 mbedtls_sha256_init(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      ssl_calc_finished_tls_sha256
//      ssl_calc_verify_tls_sha256
//      mbedtls_ssl_setup
//      sha224_ctx_alloc
//      sha256_wrap
Eq_2 mbedtls_sha256_init(Eq_2 ra, Eq_2 a0, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a3_10;
	ptr32 a4_11;
	ptr32 a5_12;
	word32 t1_19;
	word32 a0_20;
	word32 a1_21;
	word32 a2_22;
	Eq_2 ra_13 = memset(ra, a0, 0x00, 116, out t1_19, out a0_20, out a1_21, out a2_22, out a3_10, out a4_11, out a5_12);
	a3Out = a3_10;
	a4Out = a4_11;
	a5Out = a5_12;
	return ra_13;
}

// 23058706: Register Eq_2 mbedtls_sha256_free(Register Eq_2 a0, Register out ptr32 a5Out)
// Called from:
//      ssl_calc_finished_tls_sha256
//      ssl_calc_verify_tls_sha256
//      mbedtls_ssl_handshake_free
//      sha224_ctx_free
//      sha256_wrap
Eq_2 mbedtls_sha256_free(Eq_2 a0, ptr32 & a5Out)
{
	Eq_2 a0_5;
	a0_5 = a0;
	a0_5 = a0;
	if (a0 != 0x00)
	{
		while (a0_5 != (word32) a0 + 116)
		{
			a0_5->u1 = 0x00;
			a0_5 = (word32) a0_5 + 1;
		}
	}
	a5Out = (word32) a0 + 116;
	return a0_5;
}

// 2305871A: Register word32 mbedtls_sha256_clone(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      ssl_calc_finished_tls_sha256
//      ssl_calc_verify_tls_sha256
//      sha224_clone_wrap
word32 mbedtls_sha256_clone(Eq_2 a0, Eq_2 a1)
{
	word32 a1_26;
	word32 a2_27;
	word32 a3_28;
	word32 a4_29;
	word32 a5_30;
	word32 a6_31;
	word32 a7_32;
	memcpy(a0, a1, 116, out a1_26, out a2_27, out a3_28, out a4_29, out a5_30, out a6_31, out a7_32);
	return dwArg10;
}

// 2305872C: Register (ptr32 Eq_293029) mbedtls_sha256_starts(Register Eq_2 a0, Register (ptr32 Eq_283222) a1)
// Called from:
//      mbedtls_entropy_init
//      mbedtls_entropy_func
//      mbedtls_ssl_reset_checksum
//      mbedtls_ssl_setup
//      sha256_wrap
//      sha224_starts_wrap
//      sha256_starts_wrap
struct Eq_293029 * mbedtls_sha256_starts(Eq_2 a0, struct Eq_283222 * a1)
{
	struct Eq_293029 * a5_29;
	*a0 = 0x00;
	*((word32) a0 + 4) = 0x00;
	if (a1 == null)
	{
		*(union Eq_2 *) 1779033711 = a0;
		*(union Eq_2 *) 3144134289 = a0;
		*(union Eq_2 *) 0x3C6EF382 = a0;
		*(union Eq_2 *) 2773480782 = a0;
		*(union Eq_2 *) 1359893143 = a0;
		*(union Eq_2 *) 2600822952 = a0;
		*(union Eq_2 *) 528734667 = a0;
		a5_29 = (struct Eq_293029 *) 1541459225;
	}
	else
	{
		*(union Eq_2 *) 0xC1059EE0 = a0;
		*(union Eq_2 *) 914150675 = a0;
		*(union Eq_2 *) 0x3070DD27 = a0;
		*(union Eq_2 *) 4144912717 = a0;
		*(union Eq_2 *) 0xFFC00B49 = a0;
		*(union Eq_2 *) 1750603053 = a0;
		*(union Eq_2 *) 1694076871 = a0;
		a5_29 = (struct Eq_293029 *) ~0x4105B05B;
	}
	a5_29->t0024 = a0;
	a1->t0068 = a0;
	return a5_29;
}

// 230587DA: void mbedtls_sha256_process(Register word32 a0, Register Eq_2 a1, Register (ptr32 word32) a3)
// Called from:
//      sha224_process_wrap
//      sha224_update_wrap
void mbedtls_sha256_process(word32 a0, Eq_2 a1, word32 * a3)
{
	struct Eq_293080 * s2_9 = a0 + 8;
	int32 * s3_10 = fp + -336;
	struct Eq_293087 * a4_26 = fp + -336;
	do
	{
		word32 a5_30 = *a3;
		++a4_26;
		a4_26[0x03FF] = (struct Eq_293087) a3;
	} while (a0 + 40 != a5_30 + 0x04);
	struct Eq_293103 * a4_41 = fp + -304;
	a1_42 = a1;
	do
	{
		Eq_2 a1_42;
		a1_42 = (word32) a1_42 + 4;
		++a4_41;
		a4_41[0x03FF] = (struct Eq_293103) ((word32) *a1_42 << 24 | (word32) (*((word32) a1_42 + 1)) << 16 | (word32) (*((word32) a1_42 - 1)) | (word32) (*((word32) a1_42 - 2)) << 8);
	} while ((word32) a1 + 64 != a1_42);
	0x00 = dwLocCC;
	struct Eq_293144 * t3_401 = dwLoc0148;
	word32 t4_71;
	for (t4_71 = 0x23088D04; t4_71 != 0x23088D44; t4_71 += 32)
		;
	do
	{
		Eq_293152 s5_403 = t3_401->dw0038;
		Eq_293156 t5_404 = t3_401->dw0004;
		Eq_293160 s6_405 = t3_401->dw003C;
		Eq_293164 t6_486 = t3_401->dw0008;
		uint32 t4_429 = ((s5_403 << 0x0F | s5_403 >> 0x11) ^ (s5_403 << 0x0D | s5_403 >> 0x13) ^ s5_403 >> 0x0A) + (t3_401->dw0024 + t3_401->dw0000) + (((t5_404 >> 0x07 | t5_404 << 0x19) ^ (t5_404 << 0x0E | t5_404 >> 0x12)) ^ t5_404 >> 0x03);
		Eq_293206 s7_452 = t3_401->dw000C;
		word32 s0_498 = ((s6_405 << 0x0F | s6_405 >>u 0x11) ^ (s6_405 << 0x0D | s6_405 >>u 0x13) ^ s6_405 >>u 0x0A) + (t5_404 + Mem402[t3_401 + 40:int32]) + (((t6_486 >>u 0x07 | t6_486 << 0x19) ^ (t6_486 << 0x0E | t6_486 >>u 0x12)) ^ t6_486 >>u 0x03);
		word32 t2_558 = ((t4_429 << 0x0F | t4_429 >>u 0x11) ^ (t4_429 << 0x0D | t4_429 >>u 0x13) ^ t4_429 >>u 0x0A) + (t6_486 + Mem402[t3_401 + 44:int32]) + (((s7_452 >>u 0x07 | s7_452 << 0x19) ^ (s7_452 << 0x0E | s7_452 >>u 0x12)) ^ s7_452 >>u 0x03);
		t3_401->dw0044 = s0_498;
		Eq_293283 t5_606 = t3_401->dw0010;
		word32 t0_619 = ((s0_498 << 0x0F | s0_498 >>u 0x11) ^ (s0_498 << 0x0D | s0_498 >>u 0x13) ^ s0_498 >>u 0x0A) + (s7_452 + Mem600[t3_401 + 48:int32]) + (((t5_606 >>u 0x07 | t5_606 << 0x19) ^ (t5_606 << 0x0E | t5_606 >>u 0x12)) ^ t5_606 >>u 0x03);
		t3_401->dw0048 = t2_558;
		Eq_293325 s7_667 = t3_401->dw0014;
		word32 t6_681 = ((t2_558 << 0x0F | t2_558 >>u 0x11) ^ (t2_558 << 0x0D | t2_558 >>u 0x13) ^ t2_558 >>u 0x0A) + (t5_606 + Mem663[t3_401 + 52:int32]) + (((s7_667 >>u 0x07 | s7_667 << 0x19) ^ (s7_667 << 0x0E | s7_667 >>u 0x12)) ^ s7_667 >>u 0x03);
		Eq_293364 s0_720 = t3_401->dw0018;
		t3_401->dw004C = t0_619;
		Eq_293371 t0_783 = t3_401->dw001C;
		t3_401->dw0050 = t6_681;
		word32 t5_740 = ((t0_619 << 0x0F | t0_619 >>u 0x11) ^ (t0_619 << 0x0D | t0_619 >>u 0x13) ^ t0_619 >>u 0x0A) + (s5_403 + s7_667) + (((s0_720 >>u 0x07 | s0_720 << 0x19) ^ (s0_720 << 0x0E | s0_720 >>u 0x12)) ^ s0_720 >>u 0x03);
		Eq_293410 t2_842 = t3_401[1];
		t3_401->dw0054 = t5_740;
		t3_401[2] = (struct Eq_293144) t4_429;
		t3_401->dw005C = (word32) t0_783 + t4_429 + (((t5_740 << 0x0F | t5_740 >> 0x11) ^ (t5_740 << 0x0D | t5_740 >> 0x13)) ^ t5_740 >> 0x0A) + (((t2_842 >> 0x07 | t2_842 << 0x19) ^ (t2_842 << 0x0E | t2_842 >> 0x12)) ^ t2_842 >> 0x03);
		Mem896[t3_401 + 88:word32] = s6_405 + s0_720 + (((t6_681 << 0x0F | t6_681 >>u 0x11) ^ (t6_681 << 0x0D | t6_681 >>u 0x13)) ^ t6_681 >>u 0x0A) + (((t0_783 >>u 0x07 | t0_783 << 0x19) ^ (t0_783 << 0x0E | t0_783 >>u 0x12)) ^ t0_783 >>u 0x03);
		++t3_401;
	} while (dwLoc0148 + 6 != t3_401);
	do
	{
		++s2_9;
		s2_9[0x03FF] = (struct Eq_293080) (s2_9->dw0000 + *s3_10);
		++s3_10;
	} while (a0 + 40 != s2_9);
}

// 2305943E: Register Eq_2 mbedtls_sha256_update.part.0(Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 word32) a5, Stack Eq_2 dwArg48, Stack Eq_2 dwArgA8, Register out Eq_2 s1Out, Register out Eq_2 a1Out, Register out ptr32 a4Out, Register out Eq_293518 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out)
// Called from:
//      mbedtls_sha256_update
//      sha224_finish_wrap
Eq_2 mbedtls_sha256_update.part.0(Eq_2 a1, Eq_2 a2, word32 * a5, Eq_2 dwArg48, Eq_2 dwArgA8, union Eq_2 & s1Out, union Eq_2 & a1Out, ptr32 & a4Out, union Eq_293518 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out)
{
	word32 a0_21 = *a5;
	word32 a5_27 = a5 + a2;
	*a5_27 = a0_21;
	Eq_2 s2_24 = a1;
	ui32 s3_104 = a5 & 63;
	Eq_2 s0_29 = a2;
	if (a5_27 < a2)
		*((word32) a5_27 + 5) = *((word32) a5_27 + 4);
	if ((a5 & 63) != 0x00)
	{
		Eq_2 s4_35 = 64 - (a5 & 63);
		if (a2 >= s4_35)
		{
			word32 a7_232;
			word32 a6_231;
			word32 a5_230;
			word32 a3_229;
			word32 a1_227;
			word32 a2_228;
			memcpy(a0_21 + 40 + (a5 & 63), a1, s4_35, out a1_227, out a2_228, out a3_229, out a4, out a5_230, out a6_231, out a7_232);
			mbedtls_sha256_process(a0, a1, a3);
			s0_29 = (word32) (a5 & 63) + ((word32) a2 - 64);
			s2_24 = a1 + s4_35;
			s3_104 = 0x00;
		}
	}
	Eq_2 s4_63 = s0_29;
	while (s4_63 > 63)
	{
		mbedtls_sha256_process(a0, a1, a3);
		s4_63 = (word32) s4_63 - 64;
	}
	uint32 a2_75 = s0_29 >> 0x06;
	Eq_2 a1_80 = (word32) s2_24 + (a2_75 << 0x06);
	if ((word32) s0_29 + (a2_75 + -64) == 0x00)
	{
		0x00 = (uint16) dwArgA8;
		s1Out.u0 = <invalid>;
		a1Out = a1_80;
		a4Out = a4;
		a5Out.u0 = -64;
		s2Out.u0 = <invalid>;
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		s5Out.u0 = <invalid>;
		return <invalid>;
	}
	else
	{
		0x00 = (uint16) dwArgA8;
		Eq_2 a0_105 = a0_21 + 40 + s3_104;
		word32 a2_234;
		word32 a3_235;
		ptr32 a4_108;
		Eq_293518 a5_109;
		Eq_2 a1_111;
		word32 a6_236;
		word32 a7_237;
		memcpy(a0_105, a1_80, dwArg48, out a1_111, out a2_234, out a3_235, out a4_108, out a5_109, out a6_236, out a7_237);
		s1Out.u0 = <invalid>;
		a1Out = a1_111;
		a4Out = a4_108;
		a5Out = a5_109;
		s2Out.u0 = <invalid>;
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		s5Out.u0 = <invalid>;
		return <invalid>;
	}
}

