pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 23059500: Register (ptr32 Eq_293625) mbedtls_sha256_update(Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 word32) a5, Stack Eq_2 dwArg48, Stack Eq_2 dwArgA8, Register out ptr32 s1Out, Register out Eq_2 a1Out, Register out ptr32 a4Out, Register out (ptr32 word32) a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      entropy_update
//      mbedtls_entropy_func
//      ssl_update_checksum_sha256
//      sha256_wrap
//      sha224_finish_wrap
//      sha224_update_wrap
struct Eq_293625 * mbedtls_sha256_update(Eq_2 a1, Eq_2 a2, word32 * a5, Eq_2 dwArg48, Eq_2 dwArgA8, ptr32 & s1Out, union Eq_2 & a1Out, ptr32 & a4Out, word32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	if (a2 == 0x00)
	{
		s1Out = s1;
		a1Out = a1;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		return s0;
	}
	else
	{
		Eq_2 a1_8;
		word32 * a5_10;
		ptr32 s1_13;
		ptr32 s2_14;
		ptr32 s3_15;
		ptr32 s4_16;
		ptr32 s5_17;
		ptr32 a4_23;
		struct Eq_293625 * s0_12 = mbedtls_sha256_update.part.0(a1, a2, a5, dwArg48, dwArgA8, out s1_13, out a1_8, out a4_23, out a5_10, out s2_14, out s3_15, out s4_16, out s5_17);
		s1Out = s1_13;
		a1Out = a1_8;
		a4Out = a4_23;
		a5Out = a5_10;
		s2Out = s2_14;
		s3Out = s3_15;
		s4Out = s4_16;
		s5Out = s5_17;
		return s0_12;
	}
}

// 23059508: Register (ptr32 Eq_293654) mbedtls_sha256_finish(Register Eq_2 a2, Stack Eq_2 dwArg28, Stack Eq_2 dwArg88, Register out (ptr32 Eq_283343) s1Out, Register out Eq_283344 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      mbedtls_entropy_func
//      ssl_calc_finished_tls_sha256
//      ssl_calc_verify_tls_sha256
//      sha256_wrap
//      sha224_finish_wrap
struct Eq_293654 * mbedtls_sha256_finish(Eq_2 a2, Eq_2 dwArg28, Eq_2 dwArg88, struct Eq_283343 & s1Out, union Eq_283344 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	word32 * a5_43;
	if ((a2 & 63) <= 55)
		a5_43 = (word32 *) 56;
	else
		a5_43 = (word32 *) 0x0078;
	word32 * a5_59;
	word32 s4_235;
	word32 s5_236;
	word32 s3_234;
	word32 s2_233;
	word32 a4_232;
	word32 a1_231;
	word32 s1_230;
	mbedtls_sha256_update(0x23088E04, a5_43 - (a2 & 63), a5_43, dwArg28, dwArg88, out s1_230, out a1_231, out a4_232, out a5_59, out s2_233, out s3_234, out s4_235, out s5_236);
	struct Eq_283343 * s1_86;
	ptr32 s2_87;
	ptr32 s3_88;
	ptr32 s5_90;
	word32 a1_237;
	word32 a5_239;
	word32 a4_238;
	word32 s4_240;
	struct Eq_293625 * s0_85 = mbedtls_sha256_update.part.0(fp + ~0x17, 0x08, a5_59, dwArg28, dwArg88, out s1_86, out a1_237, out a4_238, out a5_239, out s2_87, out s3_88, out s4_240, out s5_90);
	s1_86->b0000 = (byte) (word32) s0_85->b000B;
	uint32 a5_105 = (word32) s0_85->w000A;
	s1_86->b0001 = (byte) a5_105;
	s1_86->b0002 = (byte) (a5_105 >> 8);
	struct Eq_293728 * s0_110 = (a5_105 >> 8)->ptr0008;
	s1_86->b0003 = (byte) (a5_105 >> 8);
	s1_86->b0004 = (byte) (word32) s0_110->b000F;
	uint32 a5_114 = (word32) s0_110->w000E;
	s1_86->b0005 = (byte) a5_114;
	s1_86->b0006 = (byte) (a5_114 >> 8);
	struct Eq_293761 * s0_119 = (a5_114 >> 8)->ptr000C;
	s1_86->b0007 = (byte) (a5_114 >> 8);
	s1_86->b0008 = (byte) (word32) s0_119->b0013;
	uint32 a5_123 = (word32) s0_119->w0012;
	s1_86->b0009 = (byte) a5_123;
	s1_86->b000A = (byte) (a5_123 >> 8);
	struct Eq_293794 * s0_128 = (a5_123 >> 8)->ptr0010;
	s1_86->b000B = (byte) (a5_123 >> 8);
	s1_86->b000C = (byte) (word32) s0_128->b0017;
	uint32 a5_132 = (word32) s0_128->w0016;
	s1_86->b000D = (byte) a5_132;
	s1_86->b000E = (byte) (a5_132 >> 8);
	struct Eq_293827 * s0_137 = (a5_132 >> 8)->ptr0014;
	s1_86->b000F = (byte) (a5_132 >> 8);
	s1_86->b0010 = (byte) (word32) s0_137->b001B;
	uint32 a5_141 = (word32) s0_137->w001A;
	s1_86->b0011 = (byte) a5_141;
	s1_86->b0012 = (byte) (a5_141 >> 8);
	struct Eq_293860 * s0_146 = (a5_141 >> 8)->ptr0018;
	s1_86->b0013 = (byte) (a5_141 >> 8);
	s1_86->b0014 = (byte) (word32) s0_146->b001F;
	uint32 a5_150 = (word32) s0_146->w001E;
	s1_86->b0015 = (byte) a5_150;
	s1_86->b0016 = (byte) (a5_150 >> 8);
	struct Eq_293893 * s0_155 = (a5_150 >> 8)->ptr001C;
	s1_86->b0017 = (byte) (a5_150 >> 8);
	s1_86->b0018 = (byte) (word32) s0_155->b0023;
	uint32 a5_159 = (word32) s0_155->w0022;
	s1_86->b0019 = (byte) a5_159;
	s1_86->b001A = (byte) (a5_159 >> 8);
	s1_86->b001B = (byte) (a5_159 >> 8);
	Eq_283344 a5_162 = a5_159 >> 8;
	struct Eq_293654 * s0_166 = (a5_159 >> 8)->ptr0068;
	if (a5_159 >> 8 == 0x00)
	{
		s1_86->b001C = (byte) (word32) s0_166->b0027;
		uint32 a5_169 = (word32) s0_166->w0026;
		s1_86->b001D = (byte) a5_169;
		s1_86->b001E = (byte) (a5_169 >> 8);
		s0_166 = (a5_169 >> 8)->ptr0024;
		s1_86->b001F = (byte) (a5_169 >> 8);
		a5_162 = a5_169 >> 8;
	}
	s1Out = s1_86;
	a5Out = a5_162;
	s2Out = s2_87;
	s3Out = s3_88;
	s4Out = dwArg04;
	s5Out = s5_90;
	return s0_166;
}

// 23059694: Register word32 mbedtls_sha256(Register Eq_2 ra, Register out Eq_283111 a5Out)
// Called from:
//      entropy_update
//      mbedtls_entropy_func
//      sha224_wrap
//      sha256_wrap
word32 mbedtls_sha256(Eq_2 ra, union Eq_283111 & a5Out)
{
	struct Eq_283222 * a3_24;
	word32 a4_25;
	word32 a5_57;
	mbedtls_sha256_init(ra, fp + -0x0084, out a3_24, out a4_25, out a5_57);
	mbedtls_sha256_starts(fp + -0x0084, a3_24);
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg72 = <invalid>;
	Eq_2 stackArg168 = <invalid>;
	word32 s1_61;
	word32 a1_62;
	word32 a4_63;
	word32 a5_64;
	word32 s2_65;
	word32 s3_66;
	word32 s4_67;
	word32 s5_68;
	mbedtls_sha256_update(a1, a2, a5, stackArg72, stackArg168, out s1_61, out a1_62, out a4_63, out a5_64, out s2_65, out s3_66, out s4_67, out s5_68);
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg40 = <invalid>;
	Eq_2 stackArg136 = <invalid>;
	word32 s1_71;
	word32 a5_72;
	word32 s2_73;
	word32 s3_74;
	word32 s4_75;
	word32 s5_76;
	mbedtls_sha256_finish(a2, stackArg40, stackArg136, out s1_71, out a5_72, out s2_73, out s3_74, out s4_75, out s5_76);
	Eq_283111 a5_41;
	mbedtls_sha256_free(fp + -0x0084, out a5_41);
	a5Out = a5_41;
	return a4_25;
}

// 230596DA: Register Eq_2 mbedtls_ssl_own_cert(Register Eq_2 a5, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_ssl_write_certificate
Eq_2 mbedtls_ssl_own_cert(Eq_2 a5, union Eq_2 & a5Out)
{
	if (a5 != 0x00)
	{
		a5 = *((word32) a5 + 8);
		if (a5 != 0x00)
		{
l230596E8:
			a5 = *a5;
l230596EA:
			a5Out = a5;
			return a5;
		}
	}
	a5 = *((word32) a5 + 76);
	if (a5 == 0x00)
		goto l230596EA;
	goto l230596E8;
}

// 230596EE: Register Eq_2 mbedtls_zeroize(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 a1Out)
// Called from:
//      ssl_calc_finished_tls_sha256
//      tls_prf_sha256
//      mbedtls_ssl_derive_keys
//      mbedtls_ssl_transform_free
//      mbedtls_ssl_handshake_free
//      mbedtls_ssl_session_free
//      mbedtls_ssl_free
//      mbedtls_ssl_config_free
Eq_2 mbedtls_zeroize(Eq_2 a0, Eq_2 a1, union Eq_2 & a1Out)
{
	word32 a1_5 = a1 + a0;
	while (a0 != a1_5)
	{
		a0->u1 = 0x00;
		a0 = (word32) a0 + 1;
	}
	a1Out = a1_5;
	return a0;
}

// 230596FE: Register (ptr32 Eq_294069) ssl_swap_epochs(Register Eq_2 ra, Register Eq_2 a4, Register Eq_2 a5, Register out (ptr32 Eq_294073) a1Out, Register out (ptr32 Eq_294074) a2Out, Register out (ptr32 Eq_294075) a3Out, Register out Eq_294076 a4Out, Register out Eq_294077 a5Out)
// Called from:
//      mbedtls_ssl_resend
struct Eq_294069 * ssl_swap_epochs(Eq_2 ra, Eq_2 a4, Eq_2 a5, struct Eq_294073 & a1Out, struct Eq_294074 & a2Out, struct Eq_294075 & a3Out, union Eq_294076 & a4Out, union Eq_294077 & a5Out)
{
	Eq_294077 a5_102;
	Eq_294076 a4_101;
	struct Eq_294075 * a3_100;
	struct Eq_294074 * a2_115;
	struct Eq_294073 * a1_114;
	Eq_2 a0_11 = *((word32) a4 + 56);
	Eq_2 a5_13 = *((word32) a5 + 0x0044);
	if (a4 == a5_13)
	{
		word32 a7_222;
		word32 s4_223;
		word32 s5_224;
		word32 s6_225;
		word32 s7_226;
		word32 s8_227;
		word32 s9_228;
		word32 s10_229;
		word32 s11_230;
		word32 t4_231;
		mbedtls_debug_print_msg(ra, a0_11, 0x03, &g_t2308A364, a5_13, out a1_114, out a2_115, out a3_100, out a4_101, out a5_102, out a7_222, out s4_223, out s5_224, out s6_225, out s7_226, out s8_227, out s9_228, out s10_229, out s11_230, out t4_231);
	}
	else
	{
		struct Eq_294092 * a3_25;
		struct Eq_294093 * a4_26;
		word32 s10_203;
		word32 s11_204;
		word32 s9_202;
		word32 s8_201;
		word32 s7_200;
		word32 s6_199;
		word32 s5_198;
		word32 s4_197;
		word32 a7_196;
		word32 a5_195;
		word32 a2_194;
		word32 a1_193;
		word32 t4_205;
		mbedtls_debug_print_msg(ra, a0_11, 0x03, &g_t2308A380, a5_13, out a1_193, out a2_194, out a3_25, out a4_26, out a5_195, out a7_196, out s4_197, out s5_198, out s6_199, out s7_200, out s8_201, out s9_202, out s10_203, out s11_204, out t4_205);
		struct Eq_294147 * s0_41 = a4_26->ptr0038;
		word32 a5_43 = a3_25->dw0044;
		a3_25->ptr0038 = s0_41;
		a4_26->dw0044 = a5_43;
		struct Eq_294161 * a1_51;
		word32 a2_206;
		word32 a3_207;
		word32 a4_208;
		word32 a5_209;
		word32 a6_210;
		word32 a7_211;
		memcpy(fp + ~0x17, s0_41->t0090, 0x08, out a1_51, out a2_206, out a3_207, out a4_208, out a5_209, out a6_210, out a7_211);
		Eq_2 a0_62 = a1_51->ptr0030->t0090;
		word32 a1_212;
		word32 a2_213;
		word32 a3_214;
		word32 a4_215;
		word32 a5_216;
		word32 a6_217;
		word32 a7_218;
		memcpy(a0_62, (char *) &a1_51->ptr0030 + 24, 0x08, out a1_212, out a2_213, out a3_214, out a4_215, out a5_216, out a6_217, out a7_218);
		word32 a5_219;
		word32 a6_220;
		word32 a7_221;
		memcpy((word32) a0_62 + 72, fp + ~0x17, 0x08, out a1_114, out a2_115, out a3_100, out a4_101, out a5_219, out a6_220, out a7_221);
		s0 = a3_100->ptr0038;
		a5_102 = s0->t009C;
		if (a3_100 != null)
		{
			s0 = a2_115->ptr000C;
			a4_101.u0 = 0x01;
			if (a2_115 > (struct Eq_294074 *) 0x01)
			{
				a3_100 = (struct Eq_294075 *) *((word32) *(union Eq_2 *) 0x0D + 16);
				a4_101 = 0x01 - a3_100;
				a5_102 += a4_101;
			}
		}
		s0->t00A0 = a5_102;
	}
	a1Out = a1_114;
	a2Out = a2_115;
	a3Out = a3_100;
	a4Out = a4_101;
	a5Out = a5_102;
	return s0;
}

// 2305979E: void ssl_calc_finished_tls_sha256(Register Eq_2 ra, Register (ptr32 Eq_294282) s1)
void ssl_calc_finished_tls_sha256(Eq_2 ra, struct Eq_294282 * s1)
{
	Eq_2 a0_18 = s1->t002C;
	Eq_2 a2_102;
	Eq_2 a5_33;
	word32 a3_270;
	word32 a4_271;
	Eq_2 ra_34 = mbedtls_sha256_init(ra, fp + -0x0094, out a3_270, out a4_271, out a5_33);
	word32 a1_48;
	word32 s5_56;
	word32 s11_283;
	word32 s10_282;
	word32 s8_280;
	word32 s9_281;
	word32 s6_278;
	word32 s7_279;
	word32 a7_276;
	word32 s4_277;
	word32 a4_274;
	word32 a5_275;
	word32 a2_272;
	word32 a3_273;
	word32 t4_284;
	mbedtls_debug_print_msg(ra_34, a0_18, 0x02, &g_t2308A238, a5_33, out a1_48, out a2_272, out a3_273, out a4_274, out a5_275, out a7_276, out s4_277, out s5_56, out s6_278, out s7_279, out s8_280, out s9_281, out s10_282, out s11_283, out t4_284);
	mbedtls_sha256_clone(fp + -0x0094, a1_48 + 80);
	word32 a1_285;
	word32 a2_286;
	word32 a3_287;
	word32 a4_288;
	word32 a5_289;
	word32 a7_290;
	mbedtls_debug_print_buf(ra_34, 0x04, fp + -0x008C, out a1_285, out a2_286, out a3_287, out a4_288, out a5_289, out a7_290);
	if (s5_56 != 0x00)
		a2_102.u0 = 0x2308A228;
	else
		a2_102.u0 = 0x2308A218;
	struct Eq_294374 * a5_115;
	word32 s1_119;
	word32 s2_120;
	word32 s3_121;
	word32 s4_122;
	word32 s5_123;
	mbedtls_sha256_finish(a2_102, dwLocA8, dwLoc48, out s1_119, out a5_115, out s2_120, out s3_121, out s4_122, out s5_123);
	Eq_2 s0_144;
	Eq_2 s3_145;
	Eq_2 ra_147;
	a5_115->ptr00D0();
	word32 a1_291;
	word32 a2_292;
	word32 a3_293;
	word32 a4_294;
	word32 a5_295;
	word32 a7_296;
	mbedtls_debug_print_buf(ra_147, 0x03, s3_145, out a1_291, out a2_292, out a3_293, out a4_294, out a5_295, out a7_296);
	Eq_2 a5_196;
	mbedtls_sha256_free(fp - 0x0094, out a5_196);
	word32 a1_297;
	mbedtls_zeroize(fp - 0x00B4, 32, out a1_297);
	word32 a1_298;
	word32 a2_299;
	word32 a3_300;
	word32 a4_301;
	word32 a5_302;
	word32 a7_303;
	word32 s4_304;
	word32 s5_305;
	word32 s6_306;
	word32 s7_307;
	word32 s8_308;
	word32 s9_309;
	word32 s10_310;
	word32 s11_311;
	word32 t4_312;
	mbedtls_debug_print_msg(ra_147, s0_144, 0x02, &g_t2308A284, a5_196, out a1_298, out a2_299, out a3_300, out a4_301, out a5_302, out a7_303, out s4_304, out s5_305, out s6_306, out s7_307, out s8_308, out s9_309, out s10_310, out s11_311, out t4_312);
}

// 2305989C: void ssl_calc_verify_tls_sha256(Register Eq_2 ra, Register Eq_2 a0)
void ssl_calc_verify_tls_sha256(Eq_2 ra, Eq_2 a0)
{
	Eq_2 a5_22;
	word32 a3_155;
	word32 a4_156;
	Eq_2 ra_23 = mbedtls_sha256_init(ra, fp + -0x0084, out a3_155, out a4_156, out a5_22);
	word32 a1_35;
	word32 a2_157;
	word32 a3_158;
	word32 a4_159;
	word32 a5_160;
	word32 a7_161;
	word32 s4_162;
	word32 s5_163;
	word32 s6_164;
	word32 s7_165;
	word32 s8_166;
	word32 s9_167;
	word32 s10_168;
	word32 s11_169;
	word32 t4_170;
	mbedtls_debug_print_msg(ra_23, a0, 0x02, &g_t2308A298, a5_22, out a1_35, out a2_157, out a3_158, out a4_159, out a5_160, out a7_161, out s4_162, out s5_163, out s6_164, out s7_165, out s8_166, out s9_167, out s10_168, out s11_169, out t4_170);
	Eq_2 s2_80;
	word32 s1_171;
	word32 a5_172;
	word32 s3_173;
	word32 s4_174;
	word32 s5_175;
	Eq_2 s0_78 = mbedtls_sha256_finish(mbedtls_sha256_clone(fp + -0x0084, a1_35 + 80), dwLoc68, dwLoc08, out s1_171, out a5_172, out s2_80, out s3_173, out s4_174, out s5_175);
	Eq_2 a5_102;
	word32 a1_176;
	word32 a2_177;
	word32 a3_178;
	word32 a4_179;
	word32 a7_180;
	mbedtls_debug_print_buf(ra_23, 0x03, s2_80, out a1_176, out a2_177, out a3_178, out a4_179, out a5_102, out a7_180);
	word32 a1_181;
	word32 a2_182;
	word32 a3_183;
	word32 a4_184;
	word32 a5_185;
	word32 a7_186;
	word32 s4_187;
	word32 s5_188;
	word32 s6_189;
	word32 s7_190;
	word32 s8_191;
	word32 s9_192;
	word32 s10_193;
	word32 s11_194;
	word32 t4_195;
	mbedtls_debug_print_msg(ra_23, s0_78, 0x02, &g_t2308A2CC, a5_102, out a1_181, out a2_182, out a3_183, out a4_184, out a5_185, out a7_186, out s4_187, out s5_188, out s6_189, out s7_190, out s8_191, out s9_192, out s10_193, out s11_194, out t4_195);
	word32 a5_196;
	mbedtls_sha256_free(fp + -0x0084, out a5_196);
}

// 23059928: Register Eq_2 ssl_flight_free(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_ssl_recv_flight_completed
//      mbedtls_ssl_handshake_free
Eq_2 ssl_flight_free(Eq_2 a0, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 s0_11 = a0;
	while (s0_11 != 0x00)
	{
		Eq_2 a2_22;
		Eq_2 a5_25;
		Eq_2 s0_31;
		word32 s1_82;
		word32 a0_83;
		word32 a1_84;
		word32 a3_85;
		word32 a4_86;
		word32 a6_87;
		word32 s4_88;
		word32 t3_89;
		vPortFree(a0, a2, a5, mstatus, dwArg0148, dwArg0188, out s0_31, out s1_82, out a0_83, out a1_84, out a2_22, out a3_85, out a4_86, out a5_25, out a6_87, out s4_88, out t3_89);
		word32 s0_90;
		word32 a1_91;
		word32 a6_92;
		word32 s4_93;
		word32 t3_94;
		vPortFree(s0_31, a2_22, a5_25, mstatus, dwArg0148, dwArg0188, out s0_90, out s1, out a0, out a1_91, out a2, out a3, out a4, out a5, out a6_92, out s4_93, out t3_94);
		s0_11 = s1;
	}
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	return s1;
}

// 23059950: Register Eq_2 ssl_append_key_cert(Register Eq_2 ra, Register Eq_2 a1, Register (ptr32 Eq_267910) a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out (ptr32 word32) s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out)
// Called from:
//      mbedtls_ssl_conf_own_cert
Eq_2 ssl_append_key_cert(Eq_2 ra, Eq_2 a1, struct Eq_267910 * a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArgF8, Eq_2 dwArg0138, word32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out)
{
	ptr32 a0_40;
	ptr32 a3_24;
	struct Eq_294659 * a4_25;
	union Eq_2 * a5_26;
	word32 * s1_30;
	ptr32 s2_31;
	word32 s8_131;
	word32 a2_128;
	word32 s3_129;
	word32 s4_130;
	word32 s0_126;
	word32 a1_127;
	Eq_2 ra_28 = mycalloc(ra, a1, 0x01, 0x0C, a3, a4, a5, mstatus, dwArg00, dwArg04, dwArgF8, dwArg0138, out s0_126, out s1_30, out a1_127, out a2_128, out a3_24, out a4_25, out a5_26, out s2_31, out s3_129, out s4_130, out s8_131);
	if (true)
	{
		*s1_30 = 0x01;
		((union Eq_2 *) 0x09)->u0 = 0x00;
		a2->dw0004 = 0x01;
		Eq_2 s0_45 = *a5_26;
		if (a5_26 == null)
			*(union Eq_2 *) 0x01 = s0_45;
		else
		{
			do
			{
				Eq_2 a5_48 = a4_25->t0008;
			} while (a4_25 != null);
			*(union Eq_2 *) 0x09 = a5_48;
		}
		a0_40 = 0x00;
	}
	else
		a0_40 = 0xF8000100;
	s1Out = s1_30;
	a0Out = a0_40;
	a3Out = a3_24;
	s2Out = s2_31;
	return ra_28;
}

// 23059996: void ssl_update_checksum_start(Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 word32) a5, Stack Eq_2 dwArg48, Stack Eq_2 dwArgA8)
// Called from:
//      ssl_update_checksum_sha256
void ssl_update_checksum_start(Eq_2 a1, Eq_2 a2, word32 * a5, Eq_2 dwArg48, Eq_2 dwArgA8)
{
	word32 s1_35;
	word32 a1_36;
	word32 a4_37;
	word32 a5_38;
	word32 s2_39;
	word32 s3_40;
	word32 s4_41;
	word32 s5_42;
	mbedtls_sha256_update(a1, a2, a5, dwArg48, dwArgA8, out s1_35, out a1_36, out a4_37, out a5_38, out s2_39, out s3_40, out s4_41, out s5_42);
}

// 230599A0: void ssl_update_checksum_sha256(Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 word32) a5, Stack Eq_2 dwArg48, Stack Eq_2 dwArgA8)
void ssl_update_checksum_sha256(Eq_2 a1, Eq_2 a2, word32 * a5, Eq_2 dwArg48, Eq_2 dwArgA8)
{
	ssl_update_checksum_start(a1, a2, a5, dwArg48, dwArgA8);
}

// 230599A4: Register Eq_2 mbedtls_ssl_hdr_len.isra.1(Register Eq_2 a0, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_ssl_flush_output
//      mbedtls_ssl_get_record_expansion
//      mbedtls_ssl_write_record
//      mbedtls_ssl_read_record_layer
Eq_2 mbedtls_ssl_hdr_len.isra.1(Eq_2 a0, union Eq_2 & a5Out)
{
	if (((word32) *((word32) a0 + 116) & 0x02) == 0x00)
	{
		a5Out.u0 = <invalid>;
		return 0x05;
	}
	else
	{
		a5Out.u0 = <invalid>;
		return 0x0D;
	}
}

// 230599B4: Register Eq_2 ssl_set_timer(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a5, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out (ptr32 Eq_294768) a4Out, Register out Eq_2 a5Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      mbedtls_ssl_recv_flight_completed
//      mbedtls_ssl_send_flight_completed
//      mbedtls_ssl_handshake_wrapup
//      mbedtls_ssl_setup
//      mbedtls_ssl_resend
//      mbedtls_ssl_fetch_input
//      mbedtls_ssl_read
Eq_2 ssl_set_timer(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a5, Eq_2 dwArg10, Eq_2 dwArg14, union Eq_2 & s0Out, ptr32 & s1Out, union Eq_2 & a1Out, ptr32 & a3Out, struct Eq_294768 & a4Out, union Eq_2 & a5Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	Eq_2 a0_5 = *((word32) a5 + 72);
	if (a5 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		return ra;
	}
	else
	{
		word32 a5_24;
		word32 a1_134;
		word32 a2_135;
		word32 a3_136;
		word32 a4_137;
		word32 a7_138;
		word32 s4_139;
		word32 s5_140;
		word32 s6_141;
		word32 s7_142;
		word32 s8_143;
		word32 s9_144;
		word32 s10_145;
		word32 s11_146;
		word32 t4_147;
		mbedtls_debug_print_msg(ra, a0_5, 0x03, &g_t2308A350, a1, out a1_134, out a2_135, out a3_136, out a4_137, out a5_24, out a7_138, out s4_139, out s5_140, out s6_141, out s7_142, out s8_143, out s9_144, out s10_145, out s11_146, out t4_147);
		Eq_2 a5_52;
		struct Eq_294768 * a4_53;
		ptr32 s1_55;
		Eq_2 a1_56;
		ptr32 a3_57;
		Eq_2 s0_58;
		Eq_2 ra_59;
		word32 t1_60;
		word32 a7_62;
		ptr32 s10_63;
		ptr32 s11_64;
		ptr32 s4_65;
		ptr32 s5_66;
		ptr32 s6_67;
		ptr32 s7_68;
		word32 s8_69;
		ptr32 s9_70;
		word32 t0_71;
		word32 t3_72;
		word32 t4_73;
		(*((word32) a0_5 + 72))();
		s0Out = s0_58;
		s1Out = s1_55;
		a1Out = a1_56;
		a3Out = a3_57;
		a4Out = a4_53;
		a5Out = a5_52;
		s4Out = s4_65;
		s5Out = s5_66;
		s6Out = s6_67;
		s7Out = s7_68;
		s9Out = s9_70;
		s10Out = s10_63;
		s11Out = s11_64;
		return ra_59;
	}
}

// 230599F8: Register Eq_2 ssl_check_timer(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a5, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out ptr32 s6Out, Register out ptr32 s7Out)
// Called from:
//      mbedtls_ssl_fetch_input
Eq_2 ssl_check_timer(Eq_2 ra, Eq_2 s0, Eq_2 a5, ptr32 & a0Out, ptr32 & a4Out, union Eq_2 & a5Out, ptr32 & s6Out, ptr32 & s7Out)
{
	Eq_2 a0_5 = *((word32) a5 + 76);
	if (a5 != 0x00)
	{
		ptr32 a0_23;
		word32 a0_14;
		Eq_2 s0_16;
		Eq_2 ra_17;
		word32 a2_19;
		word32 a3_20;
		word32 a1_21;
		word32 a7_59;
		word32 s10_60;
		word32 s11_61;
		word32 s4_62;
		word32 s5_63;
		word32 s8_66;
		word32 s9_67;
		word32 t0_68;
		word32 t1_69;
		word32 t3_70;
		word32 t4_71;
		ptr32 a4_18;
		ptr32 s6_107;
		ptr32 s7_110;
		a5();
		Eq_2 a5_22 = 0x02;
		if (a0_14 == 0x02)
		{
			word32 a1_139;
			word32 a2_140;
			word32 a3_141;
			word32 a7_142;
			word32 s4_143;
			word32 s5_144;
			word32 s8_145;
			word32 s9_146;
			word32 s10_147;
			word32 s11_148;
			word32 t4_149;
			mbedtls_debug_print_msg(ra_17, s0_16, 0x03, &g_t2308A2DC, 0x02, out a1_139, out a2_140, out a3_141, out a4_18, out a5_22, out a7_142, out s4_143, out s5_144, out s6_107, out s7_110, out s8_145, out s9_146, out s10_147, out s11_148, out t4_149);
			a0_23 = ~0x00;
		}
		else
			a0_23 = 0x00;
		a0Out = a0_23;
		a4Out = a4_18;
		a5Out = a5_22;
		s6Out = s6_107;
		s7Out = s7_110;
		return ra_17;
	}
	else
	{
		a0Out = 0x00;
		a4Out = a4;
		a5Out = a5;
		s6Out = s6;
		s7Out = s7;
		return ra;
	}
}

