pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 23059A3C: void tls_prf_sha256(Register Eq_2 ra, Register (ptr32 Eq_294927) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register word32 a5, Register ptr32 mstatus, Stack ptr32 dwArg20, Stack word32 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68)
void tls_prf_sha256(Eq_2 ra, struct Eq_294927 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, word32 a5, ptr32 mstatus, ptr32 dwArg20, word32 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg68)
{
	word32 a3_465;
	word32 a4_466;
	word32 a5_467;
	Eq_2 ra_49 = mbedtls_md_init(ra, fp + -220, out a3_465, out a4_466, out a5_467);
	word32 a5_468;
	Eq_2 a0_53 = mbedtls_md_info_from_type(0x06, out a5_468);
	if (a0_53 != 0x00)
	{
		Eq_2 a0_58 = mbedtls_md_get_size(a0_53);
		word32 a1_469;
		word32 a2_470;
		word32 a3_471;
		word32 a5_473;
		word32 a4_472;
		if (strlen(a2, out a1_469, out a2_470, out a3_471, out a4_472, out a5_473) + a4 + a0_58 <=u 0x0080)
		{
			word32 a1_474;
			word32 a3_476;
			word32 a4_477;
			word32 a2_475;
			word32 a5_478;
			Eq_2 a0_73 = strlen(a2, out a1_474, out a2_475, out a3_476, out a4_477, out a5_478);
			word32 a6_484;
			word32 a1_479;
			word32 a2_480;
			word32 a3_481;
			word32 a4_482;
			word32 a5_483;
			word32 a7_485;
			memcpy(fp + -0x00B0 + a0_58, a2, a0_73, out a1_479, out a2_480, out a3_481, out a4_482, out a5_483, out a6_484, out a7_485);
			Eq_2 a4_103;
			Eq_2 a5_104;
			Eq_2 a3_108;
			word32 a6_488;
			word32 a1_486;
			word32 a7_489;
			word32 a2_487;
			memcpy(a0_58 + a0_73 + (fp + -0x00B0), a3, a4, out a1_486, out a2_487, out a3_108, out a4_103, out a5_104, out a6_488, out a7_489);
			word32 a0_120;
			Eq_2 a4_124;
			Eq_2 a5_125;
			ptr32 mstatus_127;
			Eq_2 s2_130;
			Eq_295034 s4_132;
			Eq_2 s8_133;
			word32 s3_493;
			word32 s1_490;
			word32 a2_491;
			word32 a3_492;
			word32 ra_128 = mbedtls_md_setup(ra_49, a2, a0_58, fp + -220, a0_53, 0x01, a3_108, a4_103, a5_104, a4, mstatus, dwLocD0, dwLocCC, dwLocA8, dwArg28, dwArg68, out s1_490, out a0_120, out a2_491, out a3_492, out a4_124, out a5_125, out s2_130, out s3_493, out s4_132, out s8_133, out mstatus_127);
			if (a0_120 == 0x00)
			{
				word32 s0_145;
				Eq_2 s4_146;
				struct Eq_295064 * a4_151;
				Eq_2 a5_152;
				Eq_2 s1_154;
				word32 s2_155;
				word32 s3_156;
				ptr32 a4_165;
				struct Eq_295070 * a5_166;
				word32 s2_178;
				word32 a0_497;
				word32 a2_494;
				word32 s8_495;
				word32 a0_496;
				Eq_2 s1_177;
				Eq_2 a5_174;
				Eq_2 a4_173;
				Eq_2 a2_172;
				struct Eq_295080 * a1_171;
				word32 ra_175 = mbedtls_md_hmac_finish(mbedtls_md_hmac_update(mbedtls_md_hmac_starts(ra_128, fp + -220, a0, s8_133, a4_124, a5_125, s2_130, s4_132, out s0_145, out s1_154, out a2_494, out a4_151, out a5_152, out s2_155, out s3_156, out s4_146, out s8_495), fp + -220, a4_151, a5_152, dwLocD0, out a0_496, out a4_165, out a5_166), s0_145, s1_154, fp + -220, fp + -0x00B0, a4_165, a5_166, s2_155 + s3_156, dwArg20, dwArg24, dwArg48, out s1_177, out a0_497, out a1_171, out a2_172, out a4_173, out a5_174, out s2_178);
				Eq_2 s3_180 = 0x00;
				Eq_2 s2_181 = (word32) s1_177 + s2_178;
				while (s3_180 < s4_146)
				{
					struct Eq_295064 * a4_194;
					Eq_2 a5_195;
					word32 s0_197;
					ptr32 a4_205;
					struct Eq_295070 * a5_206;
					struct Eq_295080 * a1_212;
					Eq_2 a5_215;
					Eq_2 s1_218;
					Eq_2 s2_219;
					struct Eq_295064 * a4_227;
					Eq_2 a5_228;
					word32 s0_230;
					ptr32 a4_236;
					struct Eq_295070 * a5_237;
					word32 a2_500;
					word32 a0_499;
					word32 a0_498;
					word32 a4_501;
					word32 a0_502;
					word32 a0_503;
					word32 a4_504;
					word32 a5_505;
					ra_175 = mbedtls_md_hmac_finish(mbedtls_md_hmac_update(mbedtls_md_hmac_reset(mbedtls_md_hmac_finish(mbedtls_md_hmac_update(mbedtls_md_hmac_reset(ra_175, fp + -220, a1_171, a5_174, out s0_197, out a4_194, out a5_195), fp + -220, a4_194, a5_195, dwLocD0, out a0_498, out a4_205, out a5_206), s0_197, s1_177, fp + -220, fp + -0x00D0, a4_205, a5_206, s2_181, dwArg20, dwArg24, dwArg48, out s1_218, out a0_499, out a1_212, out a2_500, out a4_501, out a5_215, out s2_219), fp + -220, a1_212, a5_215, out s0_230, out a4_227, out a5_228), fp + -220, a4_227, a5_228, dwLocD0, out a0_502, out a4_236, out a5_237), s0_230, s1_218, fp + -220, fp + -0x00B0, a4_236, a5_237, s2_219, dwArg20, dwArg24, dwArg48, out s1_177, out a0_503, out a1_171, out a2_172, out a4_504, out a5_505, out s2_181);
					a4_173 = s1_177 + s3_180;
					Eq_2 a3_252 = s1_177;
					if (s4_146 < a4_173)
						a3_252 = s4_146 & s1_177;
					a5_174.u0 = 0x00;
					word32 s3_258 = (word32) s3_180 + a5;
					for (; a5_174 != a3_252; ++a5_174)
					{
						a1_171 = CONVERT(Mem264[fp + -0x00D0 + a5_174:byte], byte, word32);
						a2_172 = (word16) a5_174.u0 + s3_258;
						a2_172->u1 = (byte) a1_171;
					}
					s3_180 = a4_173;
				}
				word32 a5_506;
				mbedtls_md_free(ra_175, fp + -220, a2_172, a4_173, a5_174, mstatus_127, out a5_506);
				word32 a1_507;
				mbedtls_zeroize(fp + -0x00B0, 0x0080, out a1_507);
				word32 a1_508;
				mbedtls_zeroize(fp + -0x00D0, 32, out a1_508);
			}
		}
	}
}

// 23059B8E: void mbedtls_ssl_derive_keys(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_295293) s1, Register Eq_2 a5, Register ptr32 mstatus)
void mbedtls_ssl_derive_keys(Eq_2 ra, Eq_2 s0, struct Eq_295293 * s1, Eq_2 a5, ptr32 mstatus)
{
	struct Eq_274 * a4_936;
	Eq_2 a5_937;
	Eq_2 a0_30 = s1->t0040;
	struct Eq_295302 * a5_42;
	struct Eq_295303 * a4_46;
	word32 s11_49;
	struct Eq_295305 * s4_50;
	word32 s6_52;
	word32 a1_1286;
	word32 s5_1290;
	word32 s7_1291;
	word32 s8_1292;
	word32 s10_1294;
	word32 t4_1295;
	word32 s9_1293;
	word32 a3_1288;
	word32 a7_1289;
	word32 a2_1287;
	mbedtls_debug_print_msg(ra, a0_30, 0x02, &g_t23088EC0, a5, out a1_1286, out a2_1287, out a3_1288, out a4_46, out a5_42, out a7_1289, out s4_50, out s5_1290, out s6_52, out s7_1291, out s8_1292, out s9_1293, out s10_1294, out s11_49, out t4_1295);
	struct Eq_295336 * a5_64;
	word32 a0_62 = mbedtls_cipher_info_from_type((word32) a5_42->b0008, a4_46, out a5_64);
	ptr32 sp_119 = fp + -400;
	Eq_2 s2_121 = a0_30;
	word32 s1_124 = a5_64->dw0000;
	if (a0_62 == 0x00)
	{
		a5_937 = (word32) a5_64->b0008;
		a4_936 = (struct Eq_274 *) &g_t23088ED0;
		goto l23059C08;
	}
	struct Eq_295360 * a5_69;
	Eq_2 a0_68 = mbedtls_md_info_from_type((word32) a5_64->b0009, out a5_69);
	if (a0_68 == 0x00)
	{
		a4_936 = (struct Eq_274 *) &g_t23088EF0;
		a5_937 = (word32) a5_69->b0009;
l23059C08:
		word32 a7_1301;
		word32 s7_1305;
		word32 s8_1306;
		word32 s9_1307;
		word32 s11_1309;
		word32 t4_1310;
		word32 s10_1308;
		word32 s5_1303;
		word32 s6_1304;
		word32 s4_1302;
		word32 a5_1300;
		word32 a4_1299;
		word32 a3_1298;
		word32 a1_1296;
		word32 a2_1297;
		mbedtls_debug_print_msg(ra, a0_30, 0x01, a4_936, a5_937, out a1_1296, out a2_1297, out a3_1298, out a4_1299, out a5_1300, out a7_1301, out s4_1302, out s5_1303, out s6_1304, out s7_1305, out s8_1306, out s9_1307, out s10_1308, out s11_1309, out t4_1310);
		return;
	}
	Eq_2 a5_431 = 0x03;
	if (*((word32) a0_30 + 0x0C) != 0x03)
	{
l23059CDE:
		word32 s4_1451;
		word32 s8_1455;
		word32 s9_1456;
		word32 s10_1457;
		word32 t4_1459;
		word32 s11_1458;
		word32 s6_1453;
		word32 s7_1454;
		word32 s5_1452;
		word32 a7_1450;
		word32 a5_1449;
		word32 a4_1448;
		word32 a1_1445;
		word32 a2_1446;
		word32 a3_1447;
		mbedtls_debug_print_msg(ra, s2_121, 0x01, &g_t23088F14, a5_431, out a1_1445, out a2_1446, out a3_1447, out a4_1448, out a5_1449, out a7_1450, out s4_1451, out s5_1452, out s6_1453, out s7_1454, out s8_1455, out s9_1456, out s10_1457, out s11_1458, out t4_1459);
		return;
	}
	Eq_2 a5_151;
	Eq_2 a3_153;
	word32 s11_132;
	Eq_2 s10_131;
	word32 s8_129;
	word32 s5_127;
	word32 s6_122;
	word32 s9_130;
	struct Eq_295429 * s4_126;
	Eq_2 s7_128;
	s4_50->ptr00D0 = &g_t23059A3C;
	s4_50->dw00C8 = 0x2305989C;
	s4_50->dw00CC = 587569054;
	Eq_2 a5_86 = s4_50->t0148;
	word32 s3_125 = s6_52;
	if (a5_86 != 0x00)
	{
		word32 a4_1320;
		word32 a5_1321;
		word32 a7_1322;
		word32 t4_1323;
		word32 a2_1318;
		word32 a3_1319;
		word32 a1_1317;
		mbedtls_debug_print_msg(ra, a0_30, 0x03, &g_t23088F50, a5_86, out a1_1317, out a2_1318, out a3_1319, out a4_1320, out a5_1321, out a7_1322, out s4_126, out s5_127, out s6_122, out s7_128, out s8_129, out s9_130, out s10_131, out s11_132, out t4_1323);
	}
	else
	{
		word32 a7_1316;
		word32 a5_1315;
		word32 a4_1314;
		word32 a3_1313;
		word32 a1_1311;
		word32 a2_1312;
		mbedtls_debug_print_buf(ra, 0x03, (char *) &s4_50->ptr00D0 + 72, out a1_1311, out a2_1312, out a3_1313, out a4_1314, out a5_1315, out a7_1316);
		Eq_2 a0_133;
		word32 tp_1022;
		word32 t6_1020;
		word32 t5_1019;
		s4_50->ptr00D0();
		s0 = a0_133;
		if (a0_133 != 0x00)
		{
			a5_151 = a0_133;
			a3_153.u0 = 629;
			goto l23059D46;
		}
		word32 a1_1387;
		mbedtls_zeroize(s10_131, 48, out a1_1387);
	}
	word32 a7_1330;
	word32 a6_1329;
	word32 a5_1328;
	word32 a1_1324;
	word32 a2_1325;
	word32 a3_1326;
	word32 a4_1327;
	memcpy(sp_119 + 16, s7_128, 64, out a1_1324, out a2_1325, out a3_1326, out a4_1327, out a5_1328, out a6_1329, out a7_1330);
	word32 a1_1331;
	word32 a5_1335;
	word32 a6_1336;
	word32 a7_1337;
	word32 a3_1333;
	word32 a4_1334;
	word32 a2_1332;
	memcpy(s7_128, sp_119 + 48, 32, out a1_1331, out a2_1332, out a3_1333, out a4_1334, out a5_1335, out a6_1336, out a7_1337);
	word32 a7_1344;
	word32 a6_1343;
	word32 a2_1339;
	word32 a3_1340;
	word32 a4_1341;
	word32 a5_1342;
	word32 a1_1338;
	memcpy((char *) &s4_126->ptr00D0 + 40, sp_119 + 16, 32, out a1_1338, out a2_1339, out a3_1340, out a4_1341, out a5_1342, out a6_1343, out a7_1344);
	word32 a1_1345;
	mbedtls_zeroize(sp_119 + 16, 64, out a1_1345);
	struct Eq_295568 * sp_256;
	Eq_2 s1_261;
	struct Eq_268327 ** s11_269;
	Eq_2 a0_270;
	struct Eq_268327 * a4_271;
	word32 t5_282;
	word32 t6_283;
	word32 tp_1024;
	s4_126->ptr00D0();
	Eq_2 s0_284 = a0_270;
	if (a0_270 != 0x00)
	{
		a5_151 = a0_270;
		a3_153.u0 = 662;
		goto l23059DBC;
	}
	int32 a4_432;
	Eq_2 s1_418;
	struct Eq_295584 * s5_306;
	Eq_2 s7_308;
	Eq_2 s8_309;
	Eq_2 s9_310;
	word32 a1_1346;
	word32 a5_1350;
	word32 a7_1351;
	word32 s4_1352;
	word32 s10_1354;
	word32 s11_1355;
	word32 t4_1356;
	word32 s6_1353;
	word32 a3_1348;
	word32 a4_1349;
	word32 a2_1347;
	mbedtls_debug_print_msg(ra, s2_121, 0x03, &g_t23088F80, mbedtls_ssl_get_ciphersuite_name(*s11_269, a4_271), out a1_1346, out a2_1347, out a3_1348, out a4_1349, out a5_1350, out a7_1351, out s4_1352, out s5_306, out s6_1353, out s7_308, out s8_309, out s9_310, out s10_1354, out s11_1355, out t4_1356);
	word32 a5_1361;
	word32 a7_1362;
	word32 a4_1360;
	word32 a3_1359;
	word32 a2_1358;
	word32 a1_1357;
	mbedtls_debug_print_buf(ra, 0x03, s9_310, out a1_1357, out a2_1358, out a3_1359, out a4_1360, out a5_1361, out a7_1362);
	word32 a3_1365;
	word32 a4_1366;
	word32 a5_1367;
	word32 a7_1368;
	word32 a1_1363;
	word32 a2_1364;
	mbedtls_debug_print_buf(ra, 0x04, s7_308, out a1_1363, out a2_1364, out a3_1365, out a4_1366, out a5_1367, out a7_1368);
	Eq_2 a3_365;
	Eq_2 a4_366;
	word32 a1_1369;
	word32 a2_1370;
	word32 a5_1371;
	word32 a7_1372;
	mbedtls_debug_print_buf(ra, 0x04, (char *) &sp_256->t0038 + 24, out a1_1369, out a2_1370, out a3_365, out a4_366, out a5_1371, out a7_1372);
	word32 a1_1373;
	mbedtls_zeroize(s7_308, 64, out a1_1373);
	(s5_306->t0004 >> 3)->t0004 = s1_261;
	Eq_2 a5_381 = (word32) s5_306->b0001 + ~0x05 & 0x00FD;
	if (a5_381 != 0x00)
	{
		Eq_2 a0_387;
		Eq_2 a3_390;
		Eq_2 a4_391;
		Eq_2 a5_392;
		ptr32 mstatus_394;
		Eq_2 s1_396;
		Eq_2 s2_397;
		Eq_2 s8_400;
		word32 s4_1390;
		word32 s3_1389;
		word32 a2_1388;
		ra = mbedtls_md_setup(ra, a0_270, s1_261, (word32) s1_261 + 56, s8_309, 0x01, a3_365, a4_366, a5_381, s2_121, mstatus, sp_256->t0010, sp_256->t0014, sp_256->t0038, sp_256->t0108, sp_256->t0148, out s1_396, out a0_387, out a2_1388, out a3_390, out a4_391, out a5_392, out s2_397, out s3_1389, out s4_1390, out s8_400, out mstatus_394);
		s0_284 = a0_387;
		if (a0_387 == 0x00)
		{
			Eq_2 a0_409;
			Eq_2 s8_422;
			word32 mstatus_1421;
			word32 s4_1420;
			word32 s3_1419;
			word32 a5_1418;
			word32 a2_1415;
			word32 a3_1416;
			word32 a4_1417;
			ra = mbedtls_md_setup(ra, a0_387, s1_396, (word32) s1_396 + 0x0044, s8_400, 0x01, a3_390, a4_391, a5_392, s2_397, mstatus_394, sp_256->t0010, sp_256->t0014, sp_256->t0038, sp_256->t0108, sp_256->t0148, out s1_418, out a0_409, out a2_1415, out a3_1416, out a4_1417, out a5_1418, out s2_121, out s3_1419, out s4_1420, out s8_422, out mstatus_1421);
			s0_284 = a0_409;
			if (a0_409 == 0x00)
			{
				Eq_2 a0_429 = mbedtls_md_get_size(s8_422);
				*((word32) a0_429 + 20) = s1_418;
				a5_431 = s5_306->t000C;
				*((word32) a5_431 + 0x0C) = s1_418;
				a4_432 = 0x07;
				if ((word32) s5_306->b0001 == 0x07)
				{
					*((word32) a0_429 + 8) = s1_418;
					goto l23059EC6;
				}
				int32 a3_435 = s5_306->dw0014;
				struct Eq_296037 * a0_439 = (word32) a0_429 + a3_435 - (a0_429 & a3_435);
				a0_439->t0008 = s1_418;
				Eq_2 a4_441 = *((word32) s2_121 + 0x0C);
				a4_432 = (word32) a4_441 - 2;
				if (a4_441 > ~0x02)
					goto l23059FA6;
				a5_431 += a0_439;
l23059E78:
				*((word32) a5_431 + 8) = s1_418;
l23059EC6:
				Eq_2 a4_561;
				Eq_295034 s4_531;
				struct Eq_294927 * s7_532;
				Eq_2 a2_565;
				sp_256->dw0000 = a4_432;
				word32 a1_499;
				struct Eq_295827 * s5_507;
				word32 a2_1391;
				word32 a7_1395;
				word32 s4_1396;
				word32 t4_1403;
				word32 s6_1397;
				word32 s8_1399;
				word32 s9_1400;
				word32 s10_1401;
				word32 s11_1402;
				word32 s7_1398;
				word32 a4_1393;
				word32 a5_1394;
				word32 a3_1392;
				mbedtls_debug_print_msg(ra, s2_121, 0x03, &g_t23088FC4, a5_431, out a1_499, out a2_1391, out a3_1392, out a4_1393, out a5_1394, out a7_1395, out s4_1396, out s5_507, out s6_1397, out s7_1398, out s8_1399, out s9_1400, out s10_1401, out s11_1402, out t4_1403);
				struct Eq_295860 * a5_516 = *s2_121;
				word32 s1_523 = a5_516->dw0014;
				if (((word32) a5_516->w0074 & 0x01) == 0x00)
				{
					s4_531 = (a5_516 << 0x01) + a1_499 + (sp_256 + 80);
					word32 a1_592;
					word32 a4_1406;
					word32 a6_1408;
					word32 a7_1409;
					word32 a5_1407;
					word32 a3_1405;
					word32 a2_1404;
					memcpy(s1_523 + 24, (word32) s4_531.u0 + a1_499, s0_284, out a1_592, out a2_1404, out a3_1405, out a4_1406, out a5_1407, out a6_1408, out a7_1409);
					word32 a1_1410;
					word32 a3_1411;
					word32 a5_1412;
					word32 a7_1414;
					word32 a6_1413;
					memcpy(s1_523 + 40, (word32) s4_531.u0 + ((word32) s0_284 + a1_592), s0_284, out a1_1410, out a2_565, out a3_1411, out a4_561, out a5_1412, out a6_1413, out a7_1414);
					s7_532 = sp_256 + 80;
				}
				else
				{
					word32 s6_530 = (a5_516 << 0x01) + a1_499 + (sp_256 + 80);
					s4_531 = (a5_516 << 0x01) + (sp_256 + 80);
					s7_532 = sp_256 + 80 + a5_516;
					word32 a1_544;
					word32 a5_1425;
					word32 a6_1426;
					word32 a7_1427;
					word32 a3_1423;
					word32 a4_1424;
					word32 a2_1422;
					memcpy(s1_523 + 40, a1_499 + s6_530, s0_284, out a1_544, out a2_1422, out a3_1423, out a4_1424, out a5_1425, out a6_1426, out a7_1427);
					word32 a3_1429;
					word32 a5_1430;
					word32 a6_1431;
					word32 a7_1432;
					word32 a1_1428;
					memcpy(s1_523 + 24, (word32) s0_284 + a1_544 + s6_530, s0_284, out a1_1428, out a2_565, out a3_1429, out a4_561, out a5_1430, out a6_1431, out a7_1432);
				}
				a5_431 = *((word32) s2_121 + 0x0C);
				if (a5_431 > 0x00)
				{
					Eq_2 a2_681;
					Eq_295034 s4_684;
					struct Eq_294927 * s8_685;
					Eq_2 a4_689;
					Eq_2 a5_690;
					Eq_2 s2_693;
					word32 s1_712;
					Eq_2 s2_713;
					Eq_2 a0_723;
					word32 s1_731;
					word32 s0_1436;
					word32 s3_1440;
					word32 s4_1441;
					word32 s8_1442;
					word32 a5_1444;
					word32 a4_1443;
					word32 a4_1438;
					word32 a5_1439;
					word32 a2_1437;
					word32 s3_1435;
					word32 s1_1434;
					word32 s0_1433;
					ra = mbedtls_cipher_setup(mbedtls_md_hmac_starts(mbedtls_md_hmac_starts(ra, (word32) *((word32) a2_565 + 20) + 56, s7_532, a2_565, a4_561, a5_431, s2_121, s4_531, out s0_1433, out s1_1434, out a2_681, out a4_689, out a5_690, out s2_693, out s3_1435, out s4_684, out s8_685), (word32) *((word32) a2_681 + 20) + 0x0044, s8_685, a2_681, a4_689, a5_690, s2_693, s4_684, out s0_1436, out s1_712, out a2_1437, out a4_1438, out a5_1439, out s2_713, out s3_1440, out s4_1441, out s8_1442), s1_712 + 80, s5_507, out s1_731, out a0_723, out a4_1443, out a5_1444);
					if (a0_723 != 0x00)
					{
						a5_151 = a0_723;
						a3_153.u0 = 877;
					}
					else
					{
						Eq_2 a0_738;
						struct Eq_296137 * a4_743;
						struct Eq_296138 * a5_744;
						Eq_2 s1_746;
						ra = mbedtls_cipher_setup(ra, s1_731 + 144, s5_507, out s1_746, out a0_738, out a4_743, out a5_744);
						if (a0_738 != 0x00)
						{
							a5_151 = a0_738;
							a3_153.u0 = 884;
						}
						else
						{
							struct Eq_296137 * a4_759;
							struct Eq_296138 * a5_760;
							Eq_2 a0_756 = mbedtls_cipher_setkey(s1_712 + 80, s5_507->ptr0004, 0x01, a4_743, a5_744, out a4_759, out a5_760);
							if (a0_756 != 0x00)
							{
								a5_151 = a0_756;
								a3_153.u0 = 892;
							}
							else
							{
								word32 a4_1460;
								word32 a5_1461;
								Eq_2 a0_767 = mbedtls_cipher_setkey(s1_746, s5_507->ptr0004, 0x00, a4_759, a5_760, out a4_1460, out a5_1461);
								if (a0_767 == 0x00)
								{
									Eq_2 a5_775 = 0x02;
									if ((word32) s5_507->b0001 == 0x02)
									{
										struct Eq_296094 * a5_780;
										word32 a4_1478;
										Eq_2 a0_778 = mbedtls_cipher_set_padding_mode(s1_712 + 80, 0x04, (struct Eq_296094 *) 0x02, out a4_1478, out a5_780);
										if (a0_778 != 0x00)
										{
											word32 a1_1480;
											word32 a2_1481;
											word32 a3_1482;
											word32 a4_1483;
											word32 a5_1484;
											word32 s4_1485;
											word32 s5_1486;
											word32 s6_1487;
											word32 s7_1488;
											word32 s8_1489;
											word32 s9_1490;
											word32 s10_1491;
											word32 s11_1492;
											mbedtls_debug_print_ret(ra, 0x01, 910, a0_778, out a1_1480, out a2_1481, out a3_1482, out a4_1483, out a5_1484, out s4_1485, out s5_1486, out s6_1487, out s7_1488, out s8_1489, out s9_1490, out s10_1491, out s11_1492);
											return;
										}
										word32 a4_1479;
										Eq_2 a0_784 = mbedtls_cipher_set_padding_mode(s1_746, 0x04, a5_780, out a4_1479, out a5_775);
										if (a0_784 != 0x00)
										{
											word32 a1_1493;
											word32 a2_1494;
											word32 a3_1495;
											word32 a4_1496;
											word32 a5_1497;
											word32 s4_1498;
											word32 s5_1499;
											word32 s6_1500;
											word32 s7_1501;
											word32 s8_1502;
											word32 s9_1503;
											word32 s10_1504;
											word32 s11_1505;
											mbedtls_debug_print_ret(ra, 0x01, 917, a0_784, out a1_1493, out a2_1494, out a3_1495, out a4_1496, out a5_1497, out s4_1498, out s5_1499, out s6_1500, out s7_1501, out s8_1502, out s9_1503, out s10_1504, out s11_1505);
											return;
										}
									}
									word32 a1_1462;
									mbedtls_zeroize(sp_256 + 80, 0x0100, out a1_1462);
									word32 t4_1477;
									word32 s8_1473;
									word32 a7_1468;
									word32 a5_1467;
									word32 a3_1465;
									word32 s4_1469;
									word32 a2_1464;
									word32 s11_1476;
									word32 s10_1475;
									word32 s9_1474;
									word32 s7_1472;
									word32 s6_1471;
									word32 s5_1470;
									word32 a4_1466;
									word32 a1_1463;
									mbedtls_debug_print_msg(ra, s2_713, 0x02, &g_t23089044, a5_775, out a1_1463, out a2_1464, out a3_1465, out a4_1466, out a5_1467, out a7_1468, out s4_1469, out s5_1470, out s6_1471, out s7_1472, out s8_1473, out s9_1474, out s10_1475, out s11_1476, out t4_1477);
									return;
								}
								a5_151 = a0_767;
								a3_153.u0 = 900;
							}
						}
					}
l23059D46:
					word32 a3_1376;
					word32 s5_1380;
					word32 s6_1381;
					word32 s7_1382;
					word32 s9_1384;
					word32 s10_1385;
					word32 s11_1386;
					word32 s8_1383;
					word32 a5_1378;
					word32 s4_1379;
					word32 a4_1377;
					word32 a2_1375;
					word32 a1_1374;
					mbedtls_debug_print_ret(ra, 0x01, a3_153, a5_151, out a1_1374, out a2_1375, out a3_1376, out a4_1377, out a5_1378, out s4_1379, out s5_1380, out s6_1381, out s7_1382, out s8_1383, out s9_1384, out s10_1385, out s11_1386);
					return;
				}
l23059FA6:
				goto l23059CDE;
			}
		}
		a5_151 = s0_284;
		a3_153.u0 = 699;
		goto l23059DBC;
	}
	else
	{
		*(union Eq_2 *) 0x18 = s1_261;
		*(union Eq_2 *) 0x14 = s1_261;
		s1_418 = *(union Eq_2 *) 0x04;
		*((word32) s1_418 + 20) = 0x00;
		ui32 a4_459 = (word32) *(union Eq_2 *) 0x20;
		word32 a5_460 = 0x08;
		a4_432 = a4_459 & 0x02;
		if ((a4_459 & 0x02) == 0x00)
			a5_460 = 0x10;
		a5_431 = a5_460 + 0x08;
		goto l23059E78;
	}
}

