pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305A0D0: Register word32 mbedtls_ssl_flush_output(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a5, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_296372) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      mbedtls_ssl_write_record
//      mbedtls_ssl_close_notify
//      mbedtls_ssl_write
//      mbedtls_ssl_read
//      mbedtls_ssl_handshake_client_step
//      mbedtls_ssl_handshake_server_step
word32 mbedtls_ssl_flush_output(Eq_2 ra, Eq_2 a0, Eq_2 a5, Eq_2 dwArg0128, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, struct Eq_285624 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	ptr32 a4_125;
	ptr32 s10_129;
	ptr32 a5_126;
	ptr32 s11_130;
	ptr32 a3_122;
	ptr32 s5_132;
	ptr32 s9_136;
	ptr32 s7_134;
	ptr32 s6_133;
	Eq_2 s1_113;
	ptr32 a1_123;
	Eq_2 a5_31;
	word32 s5_391;
	word32 s6_392;
	word32 s7_393;
	word32 s4_390;
	word32 s9_395;
	word32 a4_388;
	word32 t4_398;
	word32 s10_396;
	word32 s11_397;
	word32 s8_394;
	word32 a7_389;
	word32 a3_387;
	word32 a1_385;
	word32 a2_386;
	Eq_2 a0_121 = mbedtls_debug_print_msg(ra, a0, 0x02, &g_t2308915C, a5, out a1_385, out a2_386, out a3_387, out a4_388, out a5_31, out a7_389, out s4_390, out s5_391, out s6_392, out s7_393, out s8_394, out s9_395, out s10_396, out s11_397, out t4_398);
	ptr32 s2_10 = 0x2308A000;
	Eq_2 s0_110 = *((word32) a5_31 + 16);
	if (a5_31 == 0x00)
	{
		word32 a2_399;
		word32 a7_400;
		word32 s4_401;
		word32 s8_402;
		word32 t4_403;
		mbedtls_debug_print_msg(ra, s0_110, 0x01, &g_t2308916C, a5_31, out a1_123, out a2_399, out a3_122, out a4_125, out a5_126, out a7_400, out s4_401, out s5_132, out s6_133, out s7_134, out s8_402, out s9_136, out s10_129, out s11_130, out t4_403);
		s1_113.u0 = ~0x070000FF;
		goto l2305A122;
	}
	Eq_2 a5_141 = *((word32) s0_110 + 0x00AC);
	if (a5_141 != 0x00)
	{
		s3 = (struct Eq_285624 *) &g_t2308A000;
		word32 s4_131 = 0x23089000;
		s2_10 = 0x00FFF9A3;
		while (true)
		{
			Eq_2 a6_164 = *((word32) s0_110 + 0x00AC);
			Eq_2 s0_64 = *a0_121;
			if (a6_164 == 0x00)
				break;
			word32 a5_404;
			word32 a1_405;
			word32 a2_406;
			word32 a3_407;
			word32 a4_408;
			word32 a5_409;
			word32 a7_410;
			word32 s4_411;
			word32 s5_412;
			word32 s6_413;
			word32 s7_414;
			word32 s8_415;
			word32 s9_416;
			word32 s10_417;
			word32 s11_418;
			word32 t4_419;
			word32 a0_81 = mbedtls_debug_print_msg(ra, s0_64, 0x02, s4_131 + 440, Mem66[s0_64 + 0x00A8:int32] + mbedtls_ssl_hdr_len.isra.1(a0_121, out a5_404), out a1_405, out a2_406, out a3_407, out a4_408, out a5_409, out a7_410, out s4_411, out s5_412, out s6_413, out s7_414, out s8_415, out s9_416, out s10_417, out s11_418, out t4_419);
			struct Eq_296516 * s0_100 = *a0_81;
			<anonymous> * a5_102;
			struct Eq_296521 * a0_107 = (word32) mbedtls_ssl_hdr_len.isra.1(a0_81, out a5_102) + (s0_100->dw00A8 - s0_100->dw00AC);
			Eq_2 a0_111;
			a5_102();
			s0_110 = a0_107->t001C;
			s1_113 = a0_111;
			word32 a2_420;
			word32 s8_421;
			a0_121 = mbedtls_debug_print_ret(ra, 0x02, 0x00FFF9A3, a0_111, out a1_123, out a2_420, out a3_122, out a4_125, out a5_126, out s4_131, out s5_132, out s6_133, out s7_134, out s8_421, out s9_136, out s10_129, out s11_130);
			if (a0_111 <= 0x00)
				goto l2305A122;
			a5_141 = *((word32) s0_110 + 0x00AC);
			*((word32) s0_110 + 0x00AC) = a5_141 - a0_111;
		}
		Eq_2 a4_144 = 0x08;
		while (true)
		{
			ui32 a5_148 = (word32) *((word32) a5_141 + 116);
			Eq_2 s0_147 = *a5_141;
			a5_141 = a5_148 & 0x02;
			if ((a5_148 & 0x02) >= a4_144)
				break;
			ui32 a2_152 = (word32) a4_144 - 1;
			byte * a3_153 = (word32) *((word32) s0_147 + 144) + a2_152;
			a5_141 = (word32) *a3_153 + 0x01 & 0x00FF;
			*a3_153 = (byte) a5_141;
			if (a5_141 != 0x00)
				break;
			a4_144 = a2_152 & 0x00FF;
		}
		ui32 a5_162 = (word32) *((word32) a5_141 + 116);
		s0_110 = *a5_141;
		a5_141 = a5_162 & 0x02;
		if ((a5_162 & 0x02) != 0x00)
			a6_164.u0 = 0x02;
		if (a4_144 == a6_164)
		{
			word32 a2_422;
			word32 a7_423;
			word32 s4_424;
			word32 s8_425;
			word32 t4_426;
			mbedtls_debug_print_msg(ra, s0_110, 0x01, &g_t230891E8, a5_162 & 0x02, out a1_123, out a2_422, out a3_122, out a4_125, out a5_126, out a7_423, out s4_424, out s5_132, out s6_133, out s7_134, out s8_425, out s9_136, out s10_129, out s11_130, out t4_426);
			s1_113.u0 = 0xF9000480;
			goto l2305A122;
		}
	}
	word32 a2_427;
	word32 a7_428;
	word32 s4_429;
	word32 s8_430;
	word32 t4_431;
	mbedtls_debug_print_msg(ra, s0_110, 0x02, &g_t230891A8, a5_141, out a1_123, out a2_427, out a3_122, out a4_125, out a5_126, out a7_428, out s4_429, out s5_132, out s6_133, out s7_134, out s8_430, out s9_136, out s10_129, out s11_130, out t4_431);
	s1_113.u0 = 0x00;
l2305A122:
	0x00 = (uint16) dwArg0128;
	s1Out = s1_113;
	a0Out = s1_113;
	a1Out = a1_123;
	a2Out = dwArg0100;
	a3Out = a3_122;
	a4Out = a4_125;
	a5Out = a5_126;
	s2Out = s2_10;
	s3Out = s3;
	s4Out = dwArg78;
	s5Out = s5_132;
	s6Out = s6_133;
	s7Out = s7_134;
	s9Out = s9_136;
	s10Out = s10_129;
	s11Out = s11_130;
	return dwArgE4;
}

// 2305A250: Register Eq_2 mbedtls_ssl_recv_flight_completed(Register Eq_2 ra, Register Eq_2 a2, Register (ptr32 Eq_296685) a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out (ptr32 Eq_296691) a5Out, Register out (ptr32 Eq_296692) s10Out)
// Called from:
//      mbedtls_ssl_parse_finished
//      mbedtls_ssl_handshake_server_step
Eq_2 mbedtls_ssl_recv_flight_completed(Eq_2 ra, Eq_2 a2, struct Eq_296685 * a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg0138, Eq_2 dwArg0178, struct Eq_296691 & a5Out, struct Eq_296692 & s10Out)
{
	Eq_2 a0_9 = a5->t0030;
	struct Eq_296697 * a4_18;
	struct Eq_296698 * a5_19;
	word32 a3_129;
	ssl_flight_free(a0_9, a2, *((word32) a0_9 + 56), mstatus, dwArg0138, dwArg0178, out a3_129, out a4_18, out a5_19);
	a5_19->dw0038 = 0x00;
	a5_19->dw003C = 0x00;
	Eq_2 s0_31 = a5_19->t0030;
	Eq_2 a5_32 = a4_18->t0020;
	a4_18->t0040 = a5_32;
	word32 a3_37;
	struct Eq_296691 * a5_39;
	struct Eq_296692 * s10_44;
	word32 s11_139;
	word32 s7_137;
	word32 s9_138;
	word32 s5_135;
	word32 s6_136;
	word32 a4_133;
	word32 s4_134;
	word32 s1_131;
	word32 a1_132;
	word32 s0_130;
	Eq_2 ra_41 = ssl_set_timer(ra, s0_31, 0x00, a5_32, dwArg00, dwArg04, out s0_130, out s1_131, out a1_132, out a3_37, out a4_133, out a5_39, out s4_134, out s5_135, out s6_136, out s7_137, out s9_138, out s10_44, out s11_139);
	if (a3_37 == 22 && (word32) (*((union Eq_2 *) 22)) == 0x14)
		a5_39->b0034 = 0x03;
	else
		a5_39->b0034 = 0x00;
	a5Out = a5_39;
	s10Out = s10_44;
	return ra_41;
}

