pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305A2A4: Register Eq_2 mbedtls_ssl_send_flight_completed(Register Eq_2 ra, Register Eq_2 a4, Register (ptr32 Eq_296776) a5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Register out ptr32 s1Out, Register out (ptr32 Eq_296780) a5Out, Register out (ptr32 Eq_296781) s11Out)
// Called from:
//      mbedtls_ssl_write_finished
//      mbedtls_ssl_handshake_client_step
Eq_2 mbedtls_ssl_send_flight_completed(Eq_2 ra, Eq_2 a4, struct Eq_296776 * a5, Eq_2 dwArg00, Eq_2 dwArg04, ptr32 & s1Out, struct Eq_296780 & a5Out, struct Eq_296781 & s11Out)
{
	word32 a4_74;
	*((word32) *((word32) a4 + 0x0068) + 48) = a5;
	struct Eq_296789 * a5_24;
	Eq_2 a1_25;
	word32 s11_146;
	word32 t4_147;
	word32 s9_144;
	word32 s10_145;
	word32 s7_142;
	word32 s8_143;
	word32 s5_140;
	word32 s6_141;
	word32 a7_138;
	word32 s4_139;
	word32 a3_136;
	word32 a4_137;
	word32 a2_135;
	mbedtls_debug_print_msg(ra, a5->t0030, 0x03, &g_t23089DAC, a5->t0030, out a1_25, out a2_135, out a3_136, out a4_137, out a5_24, out a7_138, out s4_139, out s5_140, out s6_141, out s7_142, out s8_143, out s9_144, out s10_145, out s11_146, out t4_147);
	word32 a3_48;
	struct Eq_296780 * a5_50;
	ptr32 s1_54;
	struct Eq_296781 * s11_56;
	word32 s10_156;
	word32 s7_154;
	word32 s9_155;
	word32 s5_152;
	word32 s6_153;
	word32 a4_150;
	word32 s4_151;
	word32 s0_148;
	word32 a1_149;
	Eq_2 ra_52 = ssl_set_timer(ra, a5_24->t0030, a1_25, *((word32) a1_25 + 48), dwArg00, dwArg04, out s0_148, out s1_54, out a1_149, out a3_48, out a4_150, out a5_50, out s4_151, out s5_152, out s6_153, out s7_154, out s9_155, out s10_156, out s11_56);
	if (a3_48 == 22 && (word32) (*((union Eq_2 *) 22)) == 0x14)
		a4_74 = 0x03;
	else
		a4_74 = 0x02;
	a5_50->b0034 = (byte) a4_74;
	s1Out = s1_54;
	a5Out = a5_50;
	s11Out = s11_56;
	return ra_52;
}

// 2305A304: Register ui32 mbedtls_ssl_update_handshake_status(Register Eq_2 ra, Register word32 a1, Register (ptr32 Eq_296880) a4)
// Called from:
//      mbedtls_ssl_read_record
ui32 mbedtls_ssl_update_handshake_status(Eq_2 ra, word32 a1, struct Eq_296880 * a4)
{
	word32 a0_5 = a4->dw0004;
	struct Eq_296885 * a5_11 = (struct Eq_296885 *) 0x10;
	if (a4 != (struct Eq_296880 *) 0x10)
	{
		Eq_2 a0_13 = *(union Eq_2 *) 0x40;
		if (true)
			(*(<anonymous> **) 212)();
	}
	ui32 a5_29 = (word32) a5_11->w0074;
	ui32 a5_30 = a5_29 & 0x02;
	if ((a5_29 & 0x02) != 0x00 && (a5_29 & 0x02) != 0x00)
	{
		a5_30 = a4->dw0020;
		a4->dw0021 = a5_30;
	}
	return a5_30;
}

// 2305A340: void mbedtls_ssl_optimize_checksum(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_296917) a1, Register Eq_2 a5)
void mbedtls_ssl_optimize_checksum(Eq_2 ra, Eq_2 a0, struct Eq_296917 * a1, Eq_2 a5)
{
	if ((word32) a1->b0009 == 0x07)
	{
		word32 a1_74;
		word32 a2_75;
		word32 a3_76;
		word32 a4_77;
		word32 a5_78;
		word32 a7_79;
		word32 s4_80;
		word32 s5_81;
		word32 s6_82;
		word32 s7_83;
		word32 s8_84;
		word32 s9_85;
		word32 s10_86;
		word32 s11_87;
		word32 t4_88;
		mbedtls_debug_print_msg(ra, a0, 0x01, &g_t23088F14, a5, out a1_74, out a2_75, out a3_76, out a4_77, out a5_78, out a7_79, out s4_80, out s5_81, out s6_82, out s7_83, out s8_84, out s9_85, out s10_86, out s11_87, out t4_88);
	}
	else
		*(word32 *) 0xCB = 587569568;
}

// 2305A376: void mbedtls_ssl_reset_checksum(Register (ptr32 Eq_296962) a0)
void mbedtls_ssl_reset_checksum(struct Eq_296962 * a0)
{
	word32 a0_5 = a0->dw0030;
	mbedtls_sha256_starts(a0_5 + 80, null);
}

// 2305A382: Register Eq_2 mbedtls_ssl_session_init(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 a4Out)
// Called from:
//      mbedtls_ssl_setup
//      mbedtls_ssl_handshake_server_step
Eq_2 mbedtls_ssl_session_init(Eq_2 ra, Eq_2 a0, ptr32 & a4Out)
{
	ptr32 a4_11;
	word32 t1_17;
	word32 a0_18;
	word32 a1_19;
	word32 a2_20;
	word32 a3_21;
	word32 a5_22;
	Eq_2 ra_13 = memset(ra, a0, 0x00, 116, out t1_17, out a0_18, out a1_19, out a2_20, out a3_21, out a4_11, out a5_22);
	a4Out = a4_11;
	return ra_13;
}

// 2305A38C: Register Eq_2 mbedtls_ssl_init(Register Eq_2 ra, Register Eq_2 a0)
// Called from:
//      iot_tls_connect
Eq_2 mbedtls_ssl_init(Eq_2 ra, Eq_2 a0)
{
	word32 t1_16;
	word32 a0_17;
	word32 a1_18;
	word32 a2_19;
	word32 a3_20;
	word32 a4_21;
	word32 a5_22;
	return memset(ra, a0, 0x00, 0x00C0, out t1_16, out a0_17, out a1_18, out a2_19, out a3_20, out a4_21, out a5_22);
}

// 2305A396: Register ui32 mbedtls_ssl_conf_authmode(Register (ptr32 Eq_267908) a0, Register ui32 a1)
// Called from:
//      iot_tls_connect
ui32 mbedtls_ssl_conf_authmode(struct Eq_267908 * a0, ui32 a1)
{
	ui32 a5_5 = (a1 & 0x03) << 0x02;
	a0->w0074 = (word16) ((word32) a0->w0074 & ~0x0C | a5_5);
	return a5_5;
}

// 2305A3AA: void mbedtls_ssl_conf_verify(Register (ptr32 Eq_267908) a0, Register (ptr32 Eq_267937) a1, Register (ptr32 Eq_267938) a2)
// Called from:
//      iot_tls_connect
void mbedtls_ssl_conf_verify(struct Eq_267908 * a0, struct Eq_267937 * a1, struct Eq_267938 * a2)
{
	a1->ptr0034 = a0;
	a2->ptr0038 = a0;
}

// 2305A3B0: void mbedtls_ssl_conf_rng(Register (ptr32 Eq_267908) a0, Register (ptr32 Eq_268000) a1, Register (ptr32 Eq_267827) a2)
// Called from:
//      iot_tls_connect
void mbedtls_ssl_conf_rng(struct Eq_267908 * a0, struct Eq_268000 * a1, struct Eq_267827 * a2)
{
	a1->ptr0018 = a0;
	a2->ptr001C = a0;
}

// 2305A3B6: void mbedtls_ssl_set_bio(Register word32 a0, Register (ptr32 Eq_268136) a1, Register (ptr32 Eq_268181) a2, Register (ptr32 Eq_268182) a3, Register (ptr32 Eq_268183) a4)
// Called from:
//      iot_tls_connect
void mbedtls_ssl_set_bio(word32 a0, struct Eq_268136 * a1, struct Eq_268181 * a2, struct Eq_268182 * a3, struct Eq_268183 * a4)
{
	a1->dw001C = a0;
	a2->dw0010 = a0;
	a3->dw0014 = a0;
	a4->dw0018 = a0;
}

// 2305A3C0: void mbedtls_ssl_conf_read_timeout(Register Eq_2 a0, Register (ptr32 Eq_268011) a1)
// Called from:
//      iot_tls_connect
//      iot_tls_read
void mbedtls_ssl_conf_read_timeout(Eq_2 a0, struct Eq_268011 * a1)
{
	a1->t0064 = a0;
}

// 2305A3C4: Register Eq_2 mbedtls_ssl_conf_own_cert(Register Eq_2 ra, Register Eq_2 a1, Register (ptr32 Eq_267910) a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out)
// Called from:
//      iot_tls_connect
Eq_2 mbedtls_ssl_conf_own_cert(Eq_2 ra, Eq_2 a1, struct Eq_267910 * a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArgF8, Eq_2 dwArg0138, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out)
{
	ptr32 a0_13;
	ptr32 a3_16;
	ptr32 s1_22;
	ptr32 s2_23;
	Eq_2 ra_20 = ssl_append_key_cert(ra, a1, a2, a3, a4, a5, mstatus, dwArg00, dwArg04, dwArgF8, dwArg0138, out s1_22, out a0_13, out a3_16, out s2_23);
	s1Out = s1_22;
	a0Out = a0_13;
	a3Out = a3_16;
	s2Out = s2_23;
	return ra_20;
}

// 2305A3CC: void mbedtls_ssl_conf_ca_chain(Register (ptr32 Eq_267908) a0, Register (ptr32 Eq_267826) a1, Register (ptr32 Eq_268008) a2)
// Called from:
//      iot_tls_connect
void mbedtls_ssl_conf_ca_chain(struct Eq_267908 * a0, struct Eq_267826 * a1, struct Eq_268008 * a2)
{
	a1->ptr0050 = a0;
	a2->ptr0054 = a0;
}

// 2305A3D2: Register Eq_2 mbedtls_ssl_set_hostname(Register Eq_2 ra, Register Eq_2 a1, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out ptr32 a0Out, Register out Eq_2 a3Out)
// Called from:
//      iot_tls_connect
Eq_2 mbedtls_ssl_set_hostname(Eq_2 ra, Eq_2 a1, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0108, Eq_2 dwArg0148, ptr32 & a0Out, union Eq_2 & a3Out)
{
	if (a1 != 0x00)
	{
		ptr32 a0_26;
		Eq_2 a4_19;
		word32 a1_150;
		word32 a2_151;
		word32 a5_152;
		Eq_2 a3_18;
		Eq_2 a0_17 = strlen(a1, out a1_150, out a2_151, out a3_18, out a4_19, out a5_152);
		if (a0_17 <= 0x00FF)
		{
			Eq_2 s0_37;
			Eq_2 s1_38;
			struct Eq_297097 * s2_39;
			word32 a1_153;
			word32 a2_154;
			word32 a4_155;
			word32 a5_156;
			word32 s3_157;
			word32 s4_158;
			word32 s8_159;
			ra = mycalloc(ra, a0_17, 0x01, (word32) a0_17 + 1, a3_18, a4_19, 0x00FF, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_37, out s1_38, out a1_153, out a2_154, out a3_18, out a4_155, out a5_156, out s2_39, out s3_157, out s4_158, out s8_159);
			s2_39->dw00B4 = 0x01;
			if (true)
			{
				word32 a1_160;
				word32 a2_161;
				word32 a4_162;
				word32 a5_163;
				word32 a6_164;
				word32 a7_165;
				memcpy(0x01, s0_37, s1_38, out a1_160, out a2_161, out a3_18, out a4_162, out a5_163, out a6_164, out a7_165);
				((word32) s1_38 + s2_39->dw00B4)->u1 = 0x00;
				a0_26 = 0x00;
			}
			else
				a0_26 = 0xF8000100;
		}
		else
			a0_26 = ~0x070000FF;
		0x00 = (uint16) dwArg38;
		a0Out = a0_26;
		a3Out = a3_18;
		return ra;
	}
	else
	{
		a0Out = ~0x070000FF;
		a3Out = a3;
		return ra;
	}
}

// 2305A43A: Register up32 mbedtls_ssl_conf_alpn_protocols(Register Eq_2 a0, Register ptr32 a1, Stack Eq_2 dwArg0128, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_268103 a5Out, Register out Eq_2 s2Out)
// Called from:
//      iot_tls_connect
up32 mbedtls_ssl_conf_alpn_protocols(Eq_2 a0, ptr32 a1, Eq_2 dwArg0128, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_268103 & a5Out, union Eq_2 & s2Out)
{
	up32 s1_104 = 0x00;
	a0_23 = a0;
	do
	{
		Eq_2 a0_23;
		if (a0_23 == 0x00)
		{
			*((word32) a0 + 96) = a1;
			goto l2305A45C;
		}
		word32 a2_117;
		Eq_2 a0_29 = strlen(a0_23, out a1, out a2_117, out a3, out a4, out a5);
		s1_104 = (word32) a0_29 + s1_104;
		a0_23 = (word32) a0_29 - 1;
	} while (a0_29 <= ~0xFE && s1_104 < 0x10000000);
	a0_23.u0 = ~0x070000FF;
l2305A45C:
	0x00 = (uint16) dwArg0128;
	a0Out = a0_23;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s2Out = a0;
	return s1_104;
}

// 2305A48C: Register word32 mbedtls_ssl_get_verify_result(Register (ptr32 Eq_268478) a5)
// Called from:
//      iot_tls_connect
word32 mbedtls_ssl_get_verify_result(struct Eq_268478 * a5)
{
	word32 a0_11 = a5->dw0028;
	if (a5 != null)
		return a0_11;
	a0_11 = ~0x00;
	if (a5 != null)
		return a0_11;
	return a0_11;
}

// 2305A49C: void mbedtls_ssl_get_ciphersuite(Register Eq_2 a0, Register (ptr32 Eq_268327) a4)
// Called from:
//      iot_tls_connect
void mbedtls_ssl_get_ciphersuite(Eq_2 a0, struct Eq_268327 * a4)
{
	if (a0 == 0x00)
		return;
	struct Eq_268327 ** a0_5 = *((word32) a0 + 40);
	if (a0_5 == null)
		return;
	struct Eq_268327 * a0_7 = *a0_5;
	mbedtls_ssl_get_ciphersuite_name(a0_7, a4);
}

// 2305A4AC: Register (ptr32 Eq_268330) mbedtls_ssl_get_version(Register (ptr32 Eq_268330) a4, Register up32 a5)
// Called from:
//      iot_tls_connect
struct Eq_268330 * mbedtls_ssl_get_version(struct Eq_268330 * a4, up32 a5)
{
	if (((word32) a4->w0074 & 0x02) == 0x00)
	{
		if (a5 > 0x03)
			return (struct Eq_268330 *) 0x03;
		return &g_t23088E48;
	}
	else
	{
		if (a5 == 0x02)
			return (struct Eq_268330 *) 0x02;
		if (a5 == 0x03)
			return (struct Eq_268330 *) 0x03;
		return (struct Eq_268330 *) 0x03;
	}
}

// 2305A502: Register Eq_2 mbedtls_ssl_get_record_expansion(Register Eq_2 ra, Register (ptr32 Eq_268383) s0, Register (ptr32 Eq_268346) a3, Register (ptr32 Eq_268347) a4, Register Eq_2 a5, Register out (ptr32 Eq_268346) a3Out)
// Called from:
//      iot_tls_connect
Eq_2 mbedtls_ssl_get_record_expansion(Eq_2 ra, struct Eq_268383 * s0, struct Eq_268346 * a3, struct Eq_268347 * a4, Eq_2 a5, struct Eq_268346 & a3Out)
{
	Eq_2 a0_5 = a4->t0038;
	if (a4 == null)
	{
		Eq_2 a0_68 = *a0_5;
		word32 a5_151;
		Eq_2 a0_69 = mbedtls_ssl_hdr_len.isra.1(a0_68, out a5_151);
		a3Out = a3;
		return a0_69;
	}
	Eq_2 a0_51;
	if (a3 != null)
	{
		a5 = (word32) a3->b0001;
		if (a5 == 0x02)
		{
			a3 = (struct Eq_268346 *) *((word32) a5 + 20);
			s0 += a5;
			goto l2305A530;
		}
		if (a5 >= 0x02)
		{
			a5 = a5 + ~0x05 & 0x00FF;
			if (a5 <= 0x02)
			{
l2305A530:
				word32 a5_166;
				a0_51 = mbedtls_ssl_hdr_len.isra.1(*a0_5, out a5_166) + s0;
l2305A564:
				a3Out = a3;
				return a0_51;
			}
		}
	}
	word32 s10_163;
	word32 s9_162;
	word32 s8_161;
	word32 s7_160;
	word32 s6_159;
	word32 s5_158;
	word32 s4_157;
	word32 a7_156;
	word32 a5_155;
	word32 a4_154;
	word32 a2_153;
	word32 a1_152;
	word32 s11_164;
	word32 t4_165;
	mbedtls_debug_print_msg(ra, a0_5, 0x01, &g_t23088F14, a5, out a1_152, out a2_153, out a3, out a4_154, out a5_155, out a7_156, out s4_157, out s5_158, out s6_159, out s7_160, out s8_161, out s9_162, out s10_163, out s11_164, out t4_165);
	a0_51.u0 = 0xF9000400;
	goto l2305A564;
}

// 2305A56C: Register ptr32 mbedtls_ssl_get_max_frag_len(Register (ptr32 Eq_269262) a3, Register (ptr32 Eq_297306) a5, Register out ptr32 a5Out)
// Called from:
//      mbedtls_ssl_write
ptr32 mbedtls_ssl_get_max_frag_len(struct Eq_269262 * a3, struct Eq_297306 * a5, ptr32 & a5Out)
{
	ptr32 a5_14 = (a5->dw0074 >> 4 & 0x1C)->ptr2308A204;
	if (a3 != null)
	{
		ptr32 a4_18 = g_a2308A204[(word32) a3->b0070 * 0x04];
		if (a4_18 < a5_14)
			a5_14 = a4_18;
	}
	a5Out = a5_14;
	return a5_14;
}

// 2305A598: Register Eq_2 mbedtls_ssl_get_peer_cert(Register Eq_2 a0)
// Called from:
//      iot_tls_connect
Eq_2 mbedtls_ssl_get_peer_cert(Eq_2 a0)
{
	if (a0 != 0x00)
	{
		a0 = *((word32) a0 + 40);
		if (a0 != 0x00)
			a0 = *((word32) a0 + 92);
	}
	return a0;
}

// 2305A5A2: Register Eq_2 mbedtls_ssl_handshake_step(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_297343) a4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg78, Stack Eq_2 dwArgC4, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_297343) a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_ssl_handshake
Eq_2 mbedtls_ssl_handshake_step(Eq_2 ra, Eq_2 a0, struct Eq_297343 * a4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg78, Eq_2 dwArgC4, ptr32 & s1Out, ptr32 & a0Out, struct Eq_297343 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s5Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		s1Out = s1;
		a0Out = ~0x070000FF;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s5Out = s5;
		mstatusOut = mstatus;
		return ra;
	}
	ptr32 a0_109;
	if (a4 != null)
	{
		ui32 a5_16 = (word32) a4->w0074;
		a5 = a5_16 & 0x01;
		if ((a5_16 & 0x01) != 0x00)
		{
l2305A5B8:
			struct Eq_297343 * a4_72;
			Eq_2 a5_73;
			ptr32 s3_79;
			Eq_2 s5_81;
			ptr32 mstatus_94;
			ptr32 a0_93 = mbedtls_ssl_handshake_server_step(ra, a5, s5, mstatus, dwArg18, dwArgC4, out a4_72, out a5_73, out s3_79, out s5_81, out mstatus_94);
			s1Out = s1;
			a0Out = a0_93;
			a4Out = a4_72;
			a5Out = a5_73;
			s2Out = s2;
			s3Out = s3_79;
			s5Out = s5_81;
			mstatusOut = mstatus_94;
			return ra;
		}
		struct Eq_297378 * a5_34;
		ra = mbedtls_ssl_handshake_client_step(ra, a5_16 & 0x01, mstatus, dwArg78, out s1, out a0_109, out a4, out a5_34, out s2, out s3, out s5, out mstatus);
		ui32 a5_50 = (word32) a5_34->w0074;
		a5 = a5_50 & 0x01;
		if ((a5_50 & 0x01) != 0x00)
			goto l2305A5B8;
	}
	else
		a0_109 = ~0x070000FF;
	s1Out = s1;
	a0Out = a0_109;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2;
	s3Out = s3;
	s5Out = s5;
	mstatusOut = mstatus;
	return ra;
}

// 2305A5EA: Register Eq_2 mbedtls_ssl_handshake(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArgA4, Register out (ptr32 Eq_268751) s0Out, Register out Eq_2 s1Out, Register out (ptr32 Eq_268751) a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_268757) a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      iot_tls_connect
//      mbedtls_ssl_write
//      mbedtls_ssl_read
Eq_2 mbedtls_ssl_handshake(Eq_2 ra, Eq_2 a0, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArgA4, struct Eq_268751 & s0Out, union Eq_2 & s1Out, struct Eq_268751 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, struct Eq_268757 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	struct Eq_268751 * s0_120;
	if (a0 != 0x00)
	{
		Eq_2 a0_16 = *a5;
		s1 = a0_16;
		if (a5 != 0x00)
		{
			word32 s9_272;
			word32 a3_266;
			word32 a7_267;
			word32 s4_268;
			word32 s7_270;
			word32 s6_269;
			word32 s8_271;
			word32 a2_265;
			word32 a1_264;
			word32 s10_273;
			word32 s11_274;
			word32 t4_275;
			struct Eq_297343 * a4_32;
			Eq_2 s5_37;
			Eq_2 a5_100;
			mbedtls_debug_print_msg(ra, a0_16, 0x02, &g_t230892C4, a5, out a1_264, out a2_265, out a3_266, out a4_32, out a5_100, out a7_267, out s4_268, out s5_37, out s6_269, out s7_270, out s8_271, out s9_272, out s10_273, out s11_274, out t4_275);
			s2 = 0x2308A000;
			s3.u0 = 0x10;
			do
			{
				s1 = *((word32) a5_100 + 4);
				if (a5_100 == s3)
				{
					s0_120 = null;
					break;
				}
				struct Eq_268751 * a0_57;
				ra = mbedtls_ssl_handshake_step(ra, s1, a4_32, s5_37, mstatus, dwLoc08, dwArg58, dwArgA4, out s1, out a0_57, out a4_32, out a5_100, out s2, out s3, out s5_37, out mstatus);
				s0_120 = a0_57;
			} while (a0_57 == null);
			word32 a2_276;
			word32 a7_277;
			word32 s4_278;
			word32 s7_279;
			word32 s8_280;
			word32 s9_281;
			word32 s10_282;
			word32 s11_283;
			word32 t4_284;
			mbedtls_debug_print_msg(ra, s1, 0x02, &g_t230892D4, a5_100, out a1, out a2_276, out a3, out a4, out a5, out a7_277, out s4_278, out s5, out s6, out s7_279, out s8_280, out s9_281, out s10_282, out s11_283, out t4_284);
l2305A64A:
			s0Out = s0_120;
			s1Out = s1;
			a0Out = s0_120;
			a1Out = a1;
			a2Out = dwArg48;
			a3Out = a3;
			a4Out = a4;
			a5Out = a5;
			s2Out = s2;
			s3Out = s3;
			s4Out = dwArg04;
			s5Out = s5;
			s6Out = s6;
			mstatusOut = mstatus;
			return ra;
		}
	}
	s0_120 = (struct Eq_268751 *) ~0x070000FF;
	goto l2305A64A;
}

