pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305A662: Register Eq_2 mbedtls_ssl_transform_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_2 a5Out)
// Called from:
//      ssl_handshake_wrapup_free_hs_transform
//      mbedtls_ssl_setup
//      mbedtls_ssl_free
Eq_2 mbedtls_ssl_transform_free(Eq_2 ra, Eq_2 a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, ptr32 & a1Out, ptr32 & a2Out, union Eq_2 & a5Out)
{
	if (a0 == 0x00)
	{
		a1Out = a1;
		a2Out = a2;
		a5Out = a5;
		return a0;
	}
	else
	{
		Eq_2 a5_14;
		mbedtls_cipher_free(ra, (word32) a0 + 80, a5, out a5_14);
		Eq_2 a5_18;
		Eq_2 a5_24;
		Eq_2 a5_28;
		mbedtls_md_free(ra, (word32) a0 + 0x0044, mbedtls_md_free(ra, (word32) a0 + 56, mbedtls_cipher_free(ra, (word32) a0 + 144, a5_14, out a5_18), a4, a5_18, mstatus, out a5_24), a4, a5_24, mstatus, out a5_28);
		ptr32 a1_35;
		Eq_2 a0_34 = mbedtls_zeroize(a0, 0x00D0, out a1_35);
		a1Out = a1_35;
		a2Out = dwArg10;
		a5Out = a5_28;
		return a0_34;
	}
}

// 2305A69E: Register Eq_2 mbedtls_ssl_handshake_free(Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register ptr32 mstatus, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0188, Register out Eq_2 a0Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      ssl_handshake_wrapup_free_hs_transform
//      mbedtls_ssl_setup
//      mbedtls_ssl_free
Eq_2 mbedtls_ssl_handshake_free(Eq_2 s1, Eq_2 a0, Eq_2 a2, ptr32 mstatus, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0178, Eq_2 dwArg0188, union Eq_2 & a0Out, union Eq_2 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	if (a0 == 0x00)
	{
		a0Out = a0;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		return s1;
	}
	else
	{
		Eq_2 a5_14;
		Eq_2 a0_13 = mbedtls_sha256_free((word32) a0 + 80, out a5_14);
		while (a0_13 != 0x00)
		{
			word32 s0_143;
			word32 a0_144;
			word32 a1_145;
			word32 a3_146;
			word32 a4_147;
			word32 a6_148;
			word32 s4_149;
			word32 t3_150;
			vPortFree(*((word32) s1 + 8), a2, a5_14, mstatus, dwArg0148, dwArg0188, out s0_143, out s1, out a0_144, out a1_145, out a2, out a3_146, out a4_147, out a5_14, out a6_148, out s4_149, out t3_150);
			a0_13 = s1;
		}
		Eq_2 a2_23;
		Eq_2 a5_26;
		Eq_2 a0_29;
		word32 s0_127;
		word32 s1_128;
		word32 a1_129;
		word32 a3_130;
		word32 a4_131;
		word32 a6_132;
		word32 s4_133;
		word32 t3_134;
		vPortFree(a0_13, a2, a5_14, mstatus, dwArg0148, dwArg0188, out s0_127, out s1_128, out a0_29, out a1_129, out a2_23, out a3_130, out a4_131, out a5_26, out a6_132, out s4_133, out t3_134);
		Eq_2 a2_36;
		Eq_2 a5_39;
		Eq_2 a0_42;
		word32 s0_135;
		word32 s1_136;
		word32 a1_137;
		word32 a3_138;
		word32 a4_139;
		word32 a6_140;
		word32 s4_141;
		word32 t3_142;
		vPortFree(a0_29, a2_23, a5_26, mstatus, dwArg0148, dwArg0188, out s0_135, out s1_136, out a0_42, out a1_137, out a2_36, out a3_138, out a4_139, out a5_39, out a6_140, out s4_141, out t3_142);
		Eq_2 s0_48 = *((word32) a0_42 + 56);
		ptr32 a3_52;
		ptr32 a4_53;
		ptr32 a5_54;
		Eq_2 s1_56 = ssl_flight_free(a0_42, a2_36, a5_39, mstatus, dwArg0138, dwArg0178, out a3_52, out a4_53, out a5_54);
		word32 a1_151;
		a0Out = mbedtls_zeroize(s0_48, 348, out a1_151);
		a2Out = dwArg10;
		a3Out = a3_52;
		a4Out = a4_53;
		a5Out = a5_54;
		return s1_56;
	}
}

// 2305A6E6: Register Eq_2 ssl_handshake_wrapup_free_hs_transform(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0188)
// Called from:
//      mbedtls_ssl_handshake_wrapup
//      mbedtls_ssl_read_record_layer
Eq_2 ssl_handshake_wrapup_free_hs_transform(Eq_2 ra, Eq_2 a0, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0178, Eq_2 dwArg0188)
{
	Eq_2 a2_23;
	Eq_2 a0_41;
	Eq_2 a2_43;
	Eq_2 a5_46;
	word32 a3_138;
	word32 a1_137;
	word32 a4_139;
	word32 a5_140;
	word32 a7_141;
	word32 s4_142;
	word32 s5_143;
	word32 s6_144;
	word32 s7_145;
	word32 s8_146;
	word32 s9_147;
	word32 s10_148;
	word32 s11_149;
	word32 t4_150;
	word32 a3_151;
	word32 a4_152;
	mbedtls_ssl_handshake_free(0x2308A000, mbedtls_debug_print_msg(ra, a0, 0x03, &g_t2308A310, a5, out a1_137, out a2_23, out a3_138, out a4_139, out a5_140, out a7_141, out s4_142, out s5_143, out s6_144, out s7_145, out s8_146, out s9_147, out s10_148, out s11_149, out t4_150), a2_23, mstatus, dwArg0128, dwArg0138, dwArg0168, dwArg0178, out a0_41, out a2_43, out a3_151, out a4_152, out a5_46);
	Eq_2 a4_55;
	Eq_2 a0_59;
	word32 s0_153;
	word32 s1_154;
	word32 a1_155;
	word32 a2_156;
	word32 a3_157;
	word32 a6_158;
	word32 s4_159;
	word32 t3_160;
	Eq_2 a5_56;
	vPortFree(a0_41, a2_43, a5_46, mstatus, dwArg0148, dwArg0188, out s0_153, out s1_154, out a0_59, out a1_155, out a2_156, out a3_157, out a4_55, out a5_56, out a6_158, out s4_159, out t3_160);
	*((word32) *((word32) a0_59 + 60) + 48) = 0x00;
	if (a0_59 != 0x00)
	{
		Eq_2 a2_69;
		Eq_2 a5_70;
		word32 a1_161;
		word32 s0_162;
		word32 s1_163;
		word32 a0_164;
		word32 a1_165;
		word32 a2_166;
		word32 a3_167;
		word32 a4_168;
		word32 a6_169;
		word32 s4_170;
		word32 t3_171;
		vPortFree(mbedtls_ssl_transform_free(ra, a0_59, a4_55, a5_56, mstatus, out a1_161, out a2_69, out a5_70), a2_69, a5_70, mstatus, dwArg0148, dwArg0188, out s0_162, out s1_163, out a0_164, out a1_165, out a2_166, out a3_167, out a4_168, out a5_56, out a6_169, out s4_170, out t3_171);
	}
	Eq_2 s0_86 = *((word32) a5_56 + 64);
	*((word32) s0_86 + 64) = 0x00;
	*((word32) a5_56 + 60) = s0_86;
	Eq_2 a5_104;
	word32 a1_172;
	word32 a2_173;
	word32 a3_174;
	word32 a4_175;
	word32 a7_176;
	word32 s4_177;
	word32 s5_178;
	word32 s6_179;
	word32 s7_180;
	word32 s8_181;
	word32 s9_182;
	word32 s10_183;
	word32 s11_184;
	word32 t4_185;
	mbedtls_debug_print_msg(ra, s0_86, 0x03, &g_t2308A330, a5_56, out a1_172, out a2_173, out a3_174, out a4_175, out a5_104, out a7_176, out s4_177, out s5_178, out s6_179, out s7_180, out s8_181, out s9_182, out s10_183, out s11_184, out t4_185);
	return a5_104;
}

// 2305A754: Register word32 mbedtls_ssl_session_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188, Register out Eq_2 a0Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_ssl_handshake_wrapup
//      mbedtls_ssl_setup
//      mbedtls_ssl_free
//      mbedtls_ssl_handshake_server_step
word32 mbedtls_ssl_session_free(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188, union Eq_2 & a0Out, union Eq_2 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out)
{
	if (a0 == 0x00)
	{
		a0Out = a0;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		return s1;
	}
	else
	{
		Eq_2 a0_10 = *((word32) a0 + 92);
		if (a0_10 != 0x00)
		{
			Eq_2 a0_14;
			Eq_2 a2_16;
			Eq_2 a5_19;
			word32 s0_123;
			word32 s1_124;
			word32 a1_125;
			word32 s3_126;
			word32 s4_127;
			word32 s8_128;
			mbedtls_x509_crt_free(ra, a0_10, a1, a5, mstatus, dwArg0128, dwArg0168, out s0_123, out s1_124, out a0_14, out a1_125, out a2_16, out a5_19, out s3_126, out s4_127, out s8_128);
			word32 s0_129;
			word32 s1_130;
			word32 a1_131;
			word32 a3_132;
			word32 a4_133;
			word32 a6_134;
			word32 s4_135;
			word32 t3_136;
			vPortFree(a0_14, a2_16, a5_19, mstatus, dwArg0148, dwArg0188, out s0_129, out s1_130, out a0_10, out a1_131, out a2, out a3_132, out a4_133, out a5, out a6_134, out s4_135, out t3_136);
		}
		ptr32 a3_52;
		ptr32 a4_53;
		Eq_2 a5_54;
		word32 s1_55;
		Eq_2 s0_60;
		word32 a0_117;
		word32 a1_118;
		word32 a2_119;
		word32 a6_120;
		word32 s4_121;
		word32 t3_122;
		vPortFree(a0_10, a2, a5, mstatus, dwArg0148, dwArg0188, out s0_60, out s1_55, out a0_117, out a1_118, out a2_119, out a3_52, out a4_53, out a5_54, out a6_120, out s4_121, out t3_122);
		word32 a1_137;
		a0Out = mbedtls_zeroize(s0_60, 116, out a1_137);
		a2Out = dwArg10;
		a3Out = a3_52;
		a4Out = a4_53;
		a5Out = a5_54;
		return s1_55;
	}
}

// 2305A784: void mbedtls_ssl_handshake_wrapup(Register Eq_2 ra, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack word32 dwArg38, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0188)
void mbedtls_ssl_handshake_wrapup(Eq_2 ra, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, word32 dwArg38, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, Eq_2 dwArg0188)
{
	Eq_2 s2_22 = *((word32) a5 + 328);
	word32 s1_16 = 0x2308A000;
	Eq_2 a2_26;
	word32 s11_340;
	word32 t4_341;
	word32 s7_336;
	word32 s9_338;
	word32 s10_339;
	word32 s8_337;
	word32 a7_332;
	word32 s5_334;
	word32 s6_335;
	word32 s4_333;
	Eq_2 a1_25;
	struct Eq_298033 ** a4_28;
	word32 a3_27;
	Eq_2 a5_121;
	Eq_2 a0_23 = mbedtls_debug_print_msg(ra, *((word32) a5 + 48), 0x03, &g_t230892E4, a5, out a1_25, out a2_26, out a3_27, out a4_28, out a5_121, out a7_332, out s4_333, out s5_334, out s6_335, out s7_336, out s8_337, out s9_338, out s10_339, out s11_340, out t4_341);
	if (a0_23 != 0x00)
	{
		Eq_2 a0_44;
		Eq_2 a2_46;
		Eq_2 a5_49;
		word32 a3_342;
		word32 a4_343;
		mbedtls_ssl_session_free(ra, a0_23, a1_25, a2_26, a5_121, mstatus, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out a0_44, out a2_46, out a3_342, out a4_343, out a5_49);
		word32 t3_348;
		word32 s0_344;
		word32 a6_346;
		word32 s4_347;
		word32 a2_345;
		vPortFree(a0_44, a2_46, a5_49, mstatus, dwArg0148, dwArg0188, out s0_344, out s1_16, out a0_23, out a1_25, out a2_345, out a3_27, out a4_28, out a5_121, out a6_346, out s4_347, out t3_348);
	}
	struct Eq_298033 * s0_72 = *a4_28;
	s0_72->dw002C = 0x00;
	*((word32) a1_25 + 40) = s0_72;
	if (a5_121 != 0x00 && (a3_27 != 0x00 && s2_22 == 0x00))
	{
		Eq_2 s0_87;
		word32 a0_91;
		word32 a6_112;
		a5_121();
		if (a0_91 != 0x00)
		{
			word32 s10_360;
			word32 s11_361;
			word32 t4_362;
			word32 s8_358;
			word32 s9_359;
			word32 s6_356;
			word32 s7_357;
			word32 s4_354;
			word32 s5_355;
			word32 a4_352;
			word32 a7_353;
			word32 a2_350;
			word32 a3_351;
			word32 a1_349;
			mbedtls_debug_print_msg(ra, s0_87, 0x01, &g_t230892F8, a5_121, out a1_349, out a2_350, out a3_351, out a4_352, out a5_121, out a7_353, out s4_354, out s5_355, out s6_356, out s7_357, out s8_358, out s9_359, out s10_360, out s11_361, out t4_362);
		}
	}
	struct Eq_298077 * a5_161;
	ui32 a5_142 = (word32) *((word32) a5_121 + 116);
	Eq_2 s0_141 = *a5_121;
	Eq_2 a5_143 = a5_142 & 0x02;
	if ((a5_142 & 0x02) != 0x00)
	{
		s0_141 = (a5_142 & 0x02)->t0030;
		a5_143 = (a5_142 & 0x02)->t0038;
		if (a5_143 != 0x00)
		{
			word32 a3_365;
			word32 s1_363;
			Eq_2 a5_185;
			Eq_2 s0_188;
			word32 a1_364;
			word32 a4_366;
			word32 s4_367;
			word32 s5_368;
			word32 s6_369;
			word32 s7_370;
			word32 s9_371;
			word32 s10_372;
			word32 s11_373;
			ra = ssl_set_timer(ra, s0_141, 0x00, a5_143, dwArg00, dwArg04, out s0_188, out s1_363, out a1_364, out a3_365, out a4_366, out a5_185, out s4_367, out s5_368, out s6_369, out s7_370, out s9_371, out s10_372, out s11_373);
			word32 a1_374;
			word32 a2_375;
			word32 a3_376;
			word32 a4_377;
			word32 a7_378;
			word32 s4_379;
			word32 s5_380;
			word32 s6_381;
			word32 s7_382;
			word32 s8_383;
			word32 s9_384;
			word32 s10_385;
			word32 s11_386;
			word32 t4_387;
			mbedtls_debug_print_msg(ra, s0_188, 0x03, &g_t23089314, a5_185, out a1_374, out a2_375, out a3_376, out a4_377, out a5_161, out a7_378, out s4_379, out s5_380, out s6_381, out s7_382, out s8_383, out s9_384, out s10_385, out s11_386, out t4_387);
l2305A828:
			Eq_2 s0_231 = a5_161->t0004;
			Eq_2 a5_235 = (char *) a5_161 + 1;
			*((word32) a5_235 + 4) = s0_231;
			0x00 = dwArg38;
			word32 a1_388;
			word32 a2_389;
			word32 a3_390;
			word32 a4_391;
			word32 a5_392;
			word32 a7_393;
			word32 s4_394;
			word32 s5_395;
			word32 s6_396;
			word32 s7_397;
			word32 s8_398;
			word32 s9_399;
			word32 s10_400;
			word32 s11_401;
			word32 t4_402;
			mbedtls_debug_print_msg(ra, s0_231, 0x03, &g_t2308933C, a5_235, out a1_388, out a2_389, out a3_390, out a4_391, out a5_392, out a7_393, out s4_394, out s5_395, out s6_396, out s7_397, out s8_398, out s9_399, out s10_400, out s11_401, out t4_402);
			return;
		}
	}
	a5_161 = ssl_handshake_wrapup_free_hs_transform(ra, s0_141, a5_143, mstatus, dwArg0118, dwArg0128, dwArg0138, dwArg0158, dwArg0168, dwArg0178);
	goto l2305A828;
}

