pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305A85A: Register Eq_2 ssl_handshake_init(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_298257) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0188, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out)
// Called from:
//      mbedtls_ssl_setup
Eq_2 ssl_handshake_init(Eq_2 ra, Eq_2 s1, struct Eq_298257 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, Eq_2 dwArg0188, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out)
{
	Eq_2 a0_103 = a0->t0040;
	if (a0_103 != 0x00)
		a0_103 = mbedtls_ssl_transform_free(ra, a0_103, a4, a5, mstatus, out a1, out a2, out a5);
	if (a0_103 != 0x00)
		s1 = mbedtls_ssl_session_free(ra, a0_103, a1, a2, a5, mstatus, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out a0_103, out a2, out a3, out a4, out a5);
	if (a0_103 != 0x00)
	{
		word32 a2_617;
		s1 = mbedtls_ssl_handshake_free(s1, a0_103, a2, mstatus, dwArg0128, dwArg0138, dwArg0168, dwArg0178, out a0_103, out a2_617, out a3, out a4, out a5);
	}
	if (a5 == 0x00)
	{
		Eq_2 s0_88;
		word32 s3_621;
		word32 s4_622;
		word32 s8_623;
		word32 s2_620;
		word32 a1_618;
		word32 a2_619;
		ra = mycalloc(ra, s1, 0x01, 0x00D0, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_88, out s1, out a1_618, out a2_619, out a3, out a4, out a5, out s2_620, out s3_621, out s4_622, out s8_623);
		*(union Eq_2 *) 0x41 = s0_88;
		a0_103.u0 = 0x01;
	}
	if (a5 == 0x00)
	{
		Eq_2 s0_117;
		word32 s3_627;
		word32 s4_628;
		word32 s8_629;
		word32 a1_624;
		word32 a2_625;
		word32 s2_626;
		ra = mycalloc(ra, s1, 0x01, 116, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_117, out s1, out a1_624, out a2_625, out a3, out a4, out a5, out s2_626, out s3_627, out s4_628, out s8_629);
		*(union Eq_2 *) 0x2D = s0_117;
		a0_103.u0 = 0x01;
	}
	ptr32 a1_254;
	ptr32 a3_259;
	ptr32 a0_264;
	Eq_2 s0_146;
	if (a5 == 0x00)
	{
		word32 a1_701;
		word32 a2_702;
		word32 a3_703;
		word32 a4_704;
		word32 s2_705;
		word32 s3_706;
		word32 s4_707;
		word32 s8_708;
		ra = mycalloc(ra, s1, 0x01, 348, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_146, out s1, out a1_701, out a2_702, out a3_703, out a4_704, out a5, out s2_705, out s3_706, out s4_707, out s8_708);
		*(union Eq_2 *) 0x31 = s0_146;
		a0_103.u0 = 0x01;
		if (false)
		{
l2305A8A6:
			word32 a6_648;
			word32 t4_642;
			word32 s0_643;
			word32 s1_644;
			word32 a3_646;
			word32 a1_645;
			word32 a4_647;
			word32 s6_636;
			word32 s7_637;
			word32 s8_638;
			Eq_2 a5_320;
			Eq_2 a2_322;
			Eq_2 a2_343;
			Eq_2 a5_346;
			Eq_2 a0_349;
			word32 s4_649;
			word32 t3_650;
			word32 s9_639;
			word32 s10_640;
			word32 s11_641;
			word32 a1_630;
			word32 a3_631;
			word32 a4_632;
			word32 a7_633;
			word32 s4_634;
			word32 s5_635;
			vPortFree(mbedtls_debug_print_msg(ra, s0_146, 0x01, &g_t2308A2EC, a5, out a1_630, out a2_322, out a3_631, out a4_632, out a5_320, out a7_633, out s4_634, out s5_635, out s6_636, out s7_637, out s8_638, out s9_639, out s10_640, out s11_641, out t4_642), a2_322, a5_320, mstatus, dwArg0148, dwArg0188, out s0_643, out s1_644, out a0_349, out a1_645, out a2_343, out a3_646, out a4_647, out a5_346, out a6_648, out s4_649, out t3_650);
			Eq_2 a2_356;
			Eq_2 a5_359;
			Eq_2 a0_362;
			word32 s1_652;
			word32 s0_651;
			word32 a3_654;
			word32 a4_655;
			word32 a6_656;
			word32 a1_653;
			word32 s4_657;
			word32 t3_658;
			vPortFree(a0_349, a2_343, a5_346, mstatus, dwArg0148, dwArg0188, out s0_651, out s1_652, out a0_362, out a1_653, out a2_356, out a3_654, out a4_655, out a5_359, out a6_656, out s4_657, out t3_658);
			struct Eq_298458 * s0_378;
			word32 s1_659;
			word32 a0_660;
			word32 a2_661;
			word32 a4_662;
			word32 a6_664;
			word32 s4_665;
			word32 t3_666;
			word32 a5_663;
			vPortFree(a0_362, a2_356, a5_359, mstatus, dwArg0148, dwArg0188, out s0_378, out s1_659, out a0_660, out a1_254, out a2_661, out a3_259, out a4_662, out a5_663, out a6_664, out s4_665, out t3_666);
			s0_378->dw0030 = 0x00;
			s0_378->dw0040 = 0x00;
			s0_378->dw002C = 0x00;
			a0_264 = 0xF8000100;
			goto l2305A8E8;
		}
	}
	s0_146 = *((word32) a5 + 64);
	if (a5 != 0x00)
	{
		s0_146 = *((word16) a0_103.u0 + 44);
		if (a0_103 != 0x00)
		{
			Eq_2 s2_242 = (word32) s1 + 80;
			struct Eq_298502 * a4_248;
			word32 a4_667;
			word32 t1_668;
			word32 a3_675;
			word32 a0_669;
			word32 a1_670;
			word32 a2_671;
			word32 a3_672;
			word32 a4_673;
			word32 a5_674;
			word32 a4_676;
			word32 a5_677;
			word32 a3_678;
			word32 a4_679;
			word32 a5_680;
			word32 t1_681;
			word32 a0_682;
			word32 a1_683;
			word32 a2_684;
			word32 a3_685;
			word32 a4_686;
			word32 a5_687;
			word32 a3_688;
			word32 a5_689;
			ra = mbedtls_sha256_init(memset(mbedtls_md_init(mbedtls_md_init(mbedtls_cipher_init(mbedtls_cipher_init(memset(mbedtls_ssl_session_init(ra, a0_103, out a4_667), s1, 0x00, 0x00D0, out t1_668, out a0_669, out a1_670, out a2_671, out a3_672, out a4_673, out a5_674), (word32) s1 + 80), (word32) s1 + 144), (word32) s1 + 56, out a3_675, out a4_676, out a5_677), (word32) s1 + 0x0044, out a3_678, out a4_679, out a5_680), s1, 0x00, 348, out t1_681, out a0_682, out a1_683, out a2_684, out a3_685, out a4_686, out a5_687), s2_242, out a3_688, out a4_248, out a5_689);
			mbedtls_sha256_starts(s2_242, null);
			*((word32) s1 + 0x00C4) = 587569558;
			*(union Eq_2 *) 0x02 = s1;
			*(union Eq_2 *) 0x0F = s1;
			a1_254 = 0x00;
			a3_259 = 0x02;
			a0_264 = 0x00;
			ui32 a5_265 = (word32) *(uint16 *) 0x77;
			if ((a5_265 & 0x02) != 0x00)
			{
				a4_248->dw0044 = a5_265 & 0x02;
				Eq_2 s0_271 = a4_248->t0030;
				ui32 a5_272 = (word32) (a5_265 & 0x02)->w0074;
				if ((a5_272 & 0x01) == 0x00)
					a4_248->b0034 = 0x00;
				else
					a4_248->b0034 = 0x02;
				word32 s0_690;
				word32 s1_691;
				word32 a4_692;
				word32 a5_693;
				word32 s4_694;
				word32 s5_695;
				word32 s6_696;
				word32 s7_697;
				word32 s9_698;
				word32 s10_699;
				word32 s11_700;
				ra = ssl_set_timer(ra, s0_271, 0x00, a5_272 & 0x01, dwArg00, dwArg04, out s0_690, out s1_691, out a1_254, out a3_259, out a4_692, out a5_693, out s4_694, out s5_695, out s6_696, out s7_697, out s9_698, out s10_699, out s11_700);
				a0_264 = 0x00;
			}
l2305A8E8:
			0x00 = (uint16) dwArg38;
			a0Out = a0_264;
			a1Out = a1_254;
			a3Out = a3_259;
			return ra;
		}
	}
	goto l2305A8A6;
}

// 2305A9A2: Register Eq_2 mbedtls_ssl_setup(Register Eq_2 ra, Register word32 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0188, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out)
// Called from:
//      iot_tls_connect
Eq_2 mbedtls_ssl_setup(Eq_2 ra, word32 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, Eq_2 dwArg0188, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out)
{
	*a1 = a0;
	Eq_2 a3_26;
	Eq_2 a4_27;
	Eq_2 a5_28;
	Eq_2 s1_32;
	word32 s2_33;
	word32 a1_254;
	word32 a2_255;
	word32 s3_256;
	word32 s4_257;
	word32 s8_258;
	Eq_2 s0_31;
	Eq_2 ra_30 = mycalloc(ra, a1, 0x01, 0x0400013D, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_31, out s1_32, out a1_254, out a2_255, out a3_26, out a4_27, out a5_28, out s2_33, out s3_256, out s4_257, out s8_258);
	*(union Eq_2 *) 0x51 = s0_31;
	if (true)
	{
		struct Eq_298784 * a5_48;
		Eq_2 s1_52;
		word32 a1_280;
		word32 a2_281;
		word32 a3_282;
		word32 a4_283;
		word32 s2_284;
		word32 s3_285;
		word32 s4_286;
		word32 s8_287;
		ra_30 = mycalloc(ra_30, s1_32, 0x01, s2_33 + 317, a3_26, a4_27, a5_28, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_31, out s1_52, out a1_280, out a2_281, out a3_282, out a4_283, out a5_48, out s2_284, out s3_285, out s4_286, out s8_287);
		*((word32) s0_31 + 0x008C) = 0x01;
		if (true)
		{
			Eq_2 a5_126;
			struct Eq_298257 * s0_117 = a5_48->ptr0050;
			if (((word32) *((word32) s1_52 + 116) & 0x02) != 0x00)
			{
				s0_117->dw0094 = 0x01;
				a5_48->ptr0058 = s0_117;
				s0_117->dw0090 = 0x04;
				s0_117->dw0098 = 0x0C;
				s0_117->dw009C = 0x0E;
				s0_117->dw00A0 = 0x0E;
				a5_48->ptr0057 = s0_117;
				a5_126 = (char *) a5_48 + 3;
			}
			else
			{
				s0_117->dw0090 = 0x01;
				a5_48->ptr0054 = s0_117;
				s0_117->dw0094 = 0x09;
				s0_117->dw0098 = 0x0C;
				s0_117->dw009C = 0x0E;
				s0_117->dw00A0 = 0x0E;
				a5_48->ptr0060 = s0_117;
				a5_126 = (char *) a5_48 + 8;
			}
			a5_48->ptr0067 = s0_117;
			a5_48->ptr006D = s0_117;
			a5_48->ptr0071 = s0_117;
			0x00 = (uint16) dwArg38;
			ptr32 a0_158;
			ptr32 a1_159;
			ptr32 a3_161;
			Eq_2 ra_166 = ssl_handshake_init(ra_30, s1_52, s0_117, (char *) a5_48 + 11, dwArg10, 0x0E, (char *) a5_48 + 0x0D, a5_126, mstatus, dwArg00, dwArg04, dwArg10, dwArg14, dwArg38, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, dwArg0178, dwArg0188, out a0_158, out a1_159, out a3_161);
			a0Out = a0_158;
			a1Out = a1_159;
			a3Out = a3_161;
			return ra_166;
		}
	}
	Eq_2 a5_75;
	Eq_2 a2_77;
	ptr32 a3_98;
	ptr32 a1_104;
	struct Eq_298723 * s0_106;
	word32 a1_259;
	word32 a3_260;
	word32 a4_261;
	word32 a7_262;
	word32 s4_263;
	word32 s5_264;
	word32 s6_265;
	word32 s7_266;
	word32 s8_267;
	word32 s9_268;
	word32 s10_269;
	word32 s11_270;
	word32 t4_271;
	word32 s1_272;
	word32 a0_273;
	word32 a2_274;
	word32 a4_275;
	word32 a5_276;
	word32 a6_277;
	word32 s4_278;
	word32 t3_279;
	vPortFree(mbedtls_debug_print_msg(ra_30, s0_31, 0x01, &g_t23089DD4, 0x0400013D, out a1_259, out a2_77, out a3_260, out a4_261, out a5_75, out a7_262, out s4_263, out s5_264, out s6_265, out s7_266, out s8_267, out s9_268, out s10_269, out s11_270, out t4_271), a2_77, a5_75, mstatus, dwArg0148, dwArg0188, out s0_106, out s1_272, out a0_273, out a1_104, out a2_274, out a3_98, out a4_275, out a5_276, out a6_277, out s4_278, out t3_279);
	s0_106->dw0050 = 0x00;
	0x00 = (uint16) dwArg38;
	a0Out = 0xF8000100;
	a1Out = a1_104;
	a3Out = a3_98;
	return ra_30;
}

// 2305AA7C: Register Eq_2 mbedtls_ssl_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0188, Register out ptr32 a2Out, Register out Eq_2 a5Out)
// Called from:
//      iot_tls_destroy
Eq_2 mbedtls_ssl_free(Eq_2 ra, Eq_2 a0, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, Eq_2 dwArg0188, ptr32 & a2Out, union Eq_2 & a5Out)
{
	if (a0 == 0x00)
	{
		a2Out = a2;
		a5Out = a5;
		return s1;
	}
	else
	{
		word32 a3_423;
		word32 a7_424;
		word32 s4_425;
		word32 s5_426;
		word32 s6_427;
		word32 s7_428;
		word32 s8_429;
		word32 s9_430;
		word32 s10_431;
		word32 s11_432;
		word32 t4_433;
		Eq_2 a4_27;
		Eq_2 a1_106;
		Eq_2 a2_118;
		Eq_2 a5_102;
		mbedtls_debug_print_msg(ra, a0, 0x02, &g_t2308920C, a5, out a1_106, out a2_118, out a3_423, out a4_27, out a5_102, out a7_424, out s4_425, out s5_426, out s6_427, out s7_428, out s8_429, out s9_430, out s10_431, out s11_432, out t4_433);
		Eq_2 s1_103 = 0x2308A000;
		Eq_2 a0_105 = *((word32) a0 + 0x008C);
		if (a0_105 != 0x00)
		{
			word32 a1_434;
			mbedtls_zeroize(a0_105, 0x0400013D, out a1_434);
			word32 s0_435;
			word32 a3_436;
			word32 a6_437;
			word32 s4_438;
			word32 t3_439;
			vPortFree(*((word32) a0 + 0x008C), a2_118, a5_102, mstatus, dwArg0148, dwArg0188, out s0_435, out s1_103, out a0_105, out a1_106, out a2_118, out a3_436, out a4_27, out a5_102, out a6_437, out s4_438, out t3_439);
		}
		if (a0_105 != 0x00)
		{
			word32 a1_440;
			word32 s0_441;
			word32 a3_442;
			word32 a6_443;
			word32 s4_444;
			word32 t3_445;
			vPortFree(mbedtls_zeroize(a0_105, 0x0400013D, out a1_440), a2_118, a5_102, mstatus, dwArg0148, dwArg0188, out s0_441, out s1_103, out a0_105, out a1_106, out a2_118, out a3_442, out a4_27, out a5_102, out a6_443, out s4_444, out t3_445);
		}
		if (a0_105 != 0x00)
		{
			Eq_2 a2_95;
			Eq_2 a5_96;
			word32 a1_446;
			word32 s0_447;
			word32 a3_448;
			word32 a4_449;
			word32 a6_450;
			word32 s4_451;
			word32 t3_452;
			vPortFree(mbedtls_ssl_transform_free(ra, a0_105, a4_27, a5_102, mstatus, out a1_446, out a2_95, out a5_96), a2_95, a5_96, mstatus, dwArg0148, dwArg0188, out s0_447, out s1_103, out a0_105, out a1_106, out a2_118, out a3_448, out a4_449, out a5_102, out a6_450, out s4_451, out t3_452);
		}
		if (a0_105 != 0x00)
		{
			Eq_2 a0_121;
			Eq_2 a4_125;
			Eq_2 a5_126;
			word32 a2_453;
			word32 a3_454;
			mbedtls_ssl_handshake_free(s1_103, a0_105, a2_118, mstatus, dwArg0128, dwArg0138, dwArg0168, dwArg0178, out a0_121, out a2_453, out a3_454, out a4_125, out a5_126);
			Eq_2 a1_135;
			Eq_2 a2_136;
			Eq_2 a5_137;
			Eq_2 a0_139;
			Eq_2 a2_141;
			Eq_2 a5_144;
			word32 a3_455;
			word32 a4_456;
			mbedtls_ssl_session_free(ra, mbedtls_ssl_transform_free(ra, a0_121, a4_125, a5_126, mstatus, out a1_135, out a2_136, out a5_137), a1_135, a2_136, a5_137, mstatus, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out a0_139, out a2_141, out a3_455, out a4_456, out a5_144);
			Eq_2 a2_151;
			Eq_2 a5_154;
			Eq_2 a0_157;
			word32 s0_457;
			word32 s1_458;
			word32 a1_459;
			word32 a3_460;
			word32 a4_461;
			word32 a6_462;
			word32 s4_463;
			word32 t3_464;
			vPortFree(a0_139, a2_141, a5_144, mstatus, dwArg0148, dwArg0188, out s0_457, out s1_458, out a0_157, out a1_459, out a2_151, out a3_460, out a4_461, out a5_154, out a6_462, out s4_463, out t3_464);
			Eq_2 a2_164;
			Eq_2 a5_167;
			Eq_2 a0_170;
			word32 s0_465;
			word32 s1_466;
			word32 a1_467;
			word32 a3_468;
			word32 a4_469;
			word32 a6_470;
			word32 s4_471;
			word32 t3_472;
			vPortFree(a0_157, a2_151, a5_154, mstatus, dwArg0148, dwArg0188, out s0_465, out s1_466, out a0_170, out a1_467, out a2_164, out a3_468, out a4_469, out a5_167, out a6_470, out s4_471, out t3_472);
			word32 s0_473;
			word32 a3_474;
			word32 a4_475;
			word32 a6_476;
			word32 s4_477;
			word32 t3_478;
			vPortFree(a0_170, a2_164, a5_167, mstatus, dwArg0148, dwArg0188, out s0_473, out s1_103, out a0_105, out a1_106, out a2_118, out a3_474, out a4_475, out a5_102, out a6_476, out s4_477, out t3_478);
		}
		Eq_2 s0_191 = *((word32) a0_105 + 40);
		if (a0_105 != 0x00)
		{
			Eq_2 a0_202;
			Eq_2 a2_204;
			Eq_2 a5_207;
			word32 a3_479;
			word32 a4_480;
			mbedtls_ssl_session_free(ra, a0_105, a1_106, a2_118, a5_102, mstatus, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out a0_202, out a2_204, out a3_479, out a4_480, out a5_207);
			word32 a0_481;
			word32 a1_482;
			word32 a2_483;
			word32 a3_484;
			word32 a4_485;
			word32 a6_486;
			word32 s4_487;
			word32 t3_488;
			vPortFree(a0_202, a2_204, a5_207, mstatus, dwArg0148, dwArg0188, out s0_191, out s1_103, out a0_481, out a1_482, out a2_483, out a3_484, out a4_485, out a5_102, out a6_486, out s4_487, out t3_488);
		}
		Eq_2 s2_228 = *((word32) s0_191 + 0x00B4);
		if (s2_228 != 0x00)
		{
			Eq_2 a5_233;
			Eq_2 a2_235;
			word32 a1_503;
			word32 a3_504;
			word32 a4_505;
			word32 a1_506;
			mbedtls_zeroize(s2_228, strlen(s2_228, out a1_503, out a2_235, out a3_504, out a4_505, out a5_233), out a1_506);
			word32 a0_507;
			word32 a1_508;
			word32 a2_509;
			word32 a3_510;
			word32 a4_511;
			word32 a6_512;
			word32 s4_513;
			word32 t3_514;
			vPortFree(*((word32) s0_191 + 0x00B4), a2_235, a5_233, mstatus, dwArg0148, dwArg0188, out s0_191, out s1_103, out a0_507, out a1_508, out a2_509, out a3_510, out a4_511, out a5_102, out a6_512, out s4_513, out t3_514);
		}
		Eq_2 a5_271;
		word32 a1_489;
		word32 a2_490;
		word32 a3_491;
		word32 a4_492;
		word32 a7_493;
		word32 s4_494;
		word32 s5_495;
		word32 s6_496;
		word32 s7_497;
		word32 s8_498;
		word32 s9_499;
		word32 s10_500;
		word32 s11_501;
		word32 t4_502;
		mbedtls_debug_print_msg(ra, s0_191, 0x02, &g_t23089214, a5_102, out a1_489, out a2_490, out a3_491, out a4_492, out a5_271, out a7_493, out s4_494, out s5_495, out s6_496, out s7_497, out s8_498, out s9_499, out s10_500, out s11_501, out t4_502);
		0x00 = (uint16) dwArg38;
		word32 a1_515;
		mbedtls_zeroize(s0_191, 0x00C0, out a1_515);
		a2Out = dwArg10;
		a5Out = a5_271;
		return s1_103;
	}
}

// 2305AB64: Register Eq_2 mbedtls_ssl_config_init(Register Eq_2 ra, Register Eq_2 a0)
// Called from:
//      iot_tls_connect
Eq_2 mbedtls_ssl_config_init(Eq_2 ra, Eq_2 a0)
{
	word32 t1_16;
	word32 a0_17;
	word32 a1_18;
	word32 a2_19;
	word32 a3_20;
	word32 a4_21;
	word32 a5_22;
	return memset(ra, a0, 0x00, 0x0078, out t1_16, out a0_17, out a1_18, out a2_19, out a3_20, out a4_21, out a5_22);
}

