pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305AB6E: Register Eq_2 mbedtls_ssl_config_defaults(Register Eq_2 a0, Register ui32 a1, Register ui32 a2, Register ptr32 a3, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      iot_tls_connect
Eq_2 mbedtls_ssl_config_defaults(Eq_2 a0, ui32 a1, ui32 a2, ptr32 a3, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s5Out)
{
	ui32 a5_14 = ((word32) *((word32) a0 + 116) & ~0x01 | a1 & 1) & ~0x02 | (a2 & 1) << 1;
	((word32) a0 + 116)->u0 = (word16) a5_14;
	if (a1 == 0x00)
		((word32) a0 + 116)->u0 = (word16) (a5_14 & -525 | 520);
	*(union Eq_2 *) 0x0450 = a0;
	*(union Eq_2 *) 0x0EFFFACC = a0;
	if (a3 != 0x02)
	{
		*(union Eq_2 *) 0x03030373 = a0;
		if (a2 == 0x01)
			((word32) a0 + 115)->u1 = 0x02;
		struct Eq_299341 * a0_44;
		ptr32 s2_51;
		ptr32 s4_53;
		ptr32 s5_54;
		word32 s0_49 = mbedtls_ssl_list_ciphersuites(out a0_44, out s2_51, out s4_53, out s5_54);
		g_dw2308A714 = s0_49;
		a0_44->dw000C = s0_49;
		a0_44->dw0008 = s0_49;
		a0_44->dw0004 = s0_49;
		a0_44->dw0000 = s0_49;
		g_dw4200D4F0 = s0_49;
		ptr32 a3_71;
		ptr32 a4_72;
		mbedtls_ecp_grp_id_list(out a3_71, out a4_72)->dw005C = s0_49;
		a3Out = a3_71;
		a4Out = a4_72;
		s2Out = s2_51;
		s4Out = s4_53;
		s5Out = s5_54;
		return <invalid>;
	}
	else
	{
		*(union Eq_2 *) 0x03030373 = a0;
		g_t4200D4B4 = a0;
		g_t4200D4B0 = a0;
		g_t4200D4AC = a0;
		g_t4200D4A8 = a0;
		g_t2308A724 = a0;
		g_t4200D50C = a0;
		g_t4200D9D4 = a0;
		a3Out = a3;
		a4Out = 0x02;
		s2Out = s2;
		s4Out = s4;
		s5Out = s5;
		return <invalid>;
	}
}

// 2305AC2A: Register Eq_2 mbedtls_ssl_config_free(Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
// Called from:
//      iot_tls_destroy
Eq_2 mbedtls_ssl_config_free(Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	Eq_2 s0_11 = a0;
	Eq_2 a0_12 = *((word32) a0 + 76);
	while (a0_12 != 0x00)
	{
		word32 a0_68;
		word32 a1_69;
		word32 a3_70;
		word32 a4_71;
		word32 a6_72;
		word32 s4_73;
		word32 t3_74;
		vPortFree(*((word32) s1 + 8), a2, a5, mstatus, dwArg0148, dwArg0188, out s0_11, out s1, out a0_68, out a1_69, out a2, out a3_70, out a4_71, out a5, out a6_72, out s4_73, out t3_74);
		a0_12 = s1;
	}
	word32 a1_75;
	mbedtls_zeroize(s0_11, 0x0078, out a1_75);
	return s1;
}

// 2305AC54: void mbedtls_ssl_sig_from_pk(Register Eq_2 a0, Register Eq_2 a5)
void mbedtls_ssl_sig_from_pk(Eq_2 a0, Eq_2 a5)
{
	word32 a5_18;
	mbedtls_pk_can_do(a0, 0x01, a5, out a5_18);
}

// 2305AC68: void mbedtls_ssl_pk_alg_from_sig()
void mbedtls_ssl_pk_alg_from_sig()
{
}

// 2305AC70: Register word32 mbedtls_ssl_md_alg_from_hash(Register word32 a0, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_ssl_handshake_server_step
word32 mbedtls_ssl_md_alg_from_hash(word32 a0, union Eq_2 & a5Out)
{
	struct Eq_299433 * a5_5 = a0 + ~0x00 & 0x00FF;
	if (a5_5 > (struct Eq_299433 *) 0x03)
	{
		a5Out.u0 = <invalid>;
		return 0x00;
	}
	else
	{
		word32 a0_12 = (word32) a5_5->b2308DEB8;
		a5Out.u0 = <invalid>;
		return a0_12;
	}
}

// 2305AC90: Register Eq_2 mbedtls_ssl_hash_from_md_alg(Register Eq_2 a0)
// Called from:
//      mbedtls_ssl_handshake_client_step
Eq_2 mbedtls_ssl_hash_from_md_alg(Eq_2 a0)
{
	if (a0 > ~0x05)
		return 0x00;
	return (word32) *((word32) a0 + 587783865);
}

// 2305ACAC: Register word32 mbedtls_ssl_check_curve(Register (ptr32 Eq_299455) a1, Register Eq_27976 a5, Register out (ptr32 Eq_299455) a4Out, Register out (ptr32 byte) a5Out)
// Called from:
//      mbedtls_ssl_parse_certificate
word32 mbedtls_ssl_check_curve(struct Eq_299455 * a1, Eq_27976 a5, struct Eq_299455 & a4Out, byte & a5Out)
{
	byte * a5_12 = *((word32) a5 + 92);
	if (a5_12 != null)
	{
		while (true)
		{
			a4 = (word32) *a5_12;
			if (a4 == null)
				break;
			if (a4 == a1)
			{
				a4Out = a4;
				a5Out = a5_12;
				return 0x00;
			}
			++a5_12;
		}
	}
	a4Out = a4;
	a5Out = a5_12;
	return ~0x00;
}

// 2305ACC8: Register ptr32 mbedtls_ssl_check_cert_usage(Register Eq_2 a0, Register (ptr32 Eq_299479) a1, Register ui32 a2, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 ptr32) a5Out, Register out Eq_299484 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      mbedtls_ssl_parse_certificate
//      mbedtls_ssl_handshake_server_step
ptr32 mbedtls_ssl_check_cert_usage(Eq_2 a0, struct Eq_299479 * a1, ui32 a2, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a5Out, union Eq_299484 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	int32 a1_19 = 0x0080;
	if (a2 == 0x01)
	{
		up32 a5_21 = (word32) a1->b000A;
		a1_19 = 0x00;
		if (a5_21 <= 0x0A)
		{
			ui32 a5_24 = a2 << a5_21;
			a1_19 = 32;
			if ((a5_24 & 0x0082) == 0x00)
			{
				a1_19 = 0x08;
				if ((a5_24 & 0x0600) == 0x00)
					a1_19 = (word32) ((a5_24 & 0x1C) != 0x00) << 7;
			}
		}
	}
	word32 * a5_39;
	word32 a3_133;
	word32 a4_134;
	if (mbedtls_x509_crt_check_key_usage(a0, a1_19, out a3_133, out a4_134, out a5_39) != 0x00)
		*(a5_39 | 0x00FFF800) = *a5_39;
	Eq_2 a1_54;
	if (a2 != 0x01)
		a1_54.u0 = 587763300;
	else
		a1_54.u0 = 0x23088E58;
	word32 a0_62;
	Eq_299484 s3_72;
	ptr32 * a5_123;
	ptr32 s1_124;
	ptr32 s0_69 = mbedtls_x509_crt_check_extended_key_usage(a0, a1_54, 0x08, out s1_124, out a0_62, out a5_123, out s3_72);
	if (a0_62 != 0x00)
	{
		s1_124 = *a5_123;
		*(a5_123 | 0x01000000) = s1_124;
		s0_69 = ~0x00;
		a5_123 |= 0x01000000;
	}
	s1Out = s1_124;
	a0Out = s0_69;
	a5Out = a5_123;
	s3Out = s3_72;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return s0_69;
}

// 2305AD62: Register Eq_2 mbedtls_ssl_write_version(Register Eq_2 a0, Register word32 a1, Register ui32 a2, Register (ptr32 Eq_299584) a3)
// Called from:
//      mbedtls_ssl_write_record
//      mbedtls_ssl_read_record_layer
//      mbedtls_ssl_handshake_client_step
Eq_2 mbedtls_ssl_write_version(Eq_2 a0, word32 a1, ui32 a2, struct Eq_299584 * a3)
{
	Eq_2 a0_14 = a0 & 0x00FF;
	if (a2 == 0x01)
	{
		if (a1 == 0x02)
			a1 = 0x01;
		a0_14 = ~((a0 & 0x00FF) + ~0x01);
		a3->b0000 = (byte) a0_14;
		a1 = 0x00 - a1;
	}
	else
		a3->b0000 = (byte) (a0 & 0x00FF);
	a3->b0001 = (byte) a1;
	return a0_14;
}

