pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305AD8E: Register Eq_2 mbedtls_ssl_write_record(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a5, Register ptr32 mstatus, Register out Eq_2 s0Out, Register out (ptr32 Eq_299618) s1Out, Register out Eq_2 a0Out, Register out (ptr32 Eq_299620) a1Out, Register out ptr32 a2Out, Register out (ptr32 Eq_299622) a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_299624) a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_ssl_resend
//      mbedtls_ssl_send_alert_message
//      mbedtls_ssl_write_certificate
//      mbedtls_ssl_write_change_cipher_spec
//      mbedtls_ssl_write_finished
//      mbedtls_ssl_write
//      mbedtls_ssl_handshake_client_step
Eq_2 mbedtls_ssl_write_record(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a5, ptr32 mstatus, union Eq_2 & s0Out, struct Eq_299618 & s1Out, union Eq_2 & a0Out, struct Eq_299620 & a1Out, ptr32 & a2Out, struct Eq_299622 & a3Out, ptr32 & a4Out, struct Eq_299624 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 s1_1075;
	struct Eq_299620 * a1_1084;
	ptr32 a2_1085;
	ptr32 a4_1087;
	struct Eq_299624 * a5_1083;
	ptr32 s11_1090;
	ptr32 s4_1091;
	struct Eq_299638 * a5_129;
	Eq_2 s3_1074 = *((word32) a0 + 0x00A8);
	struct Eq_299643 * a5_32;
	word32 s4_40;
	word32 s5_41;
	word32 s6_42;
	word32 s8_1716;
	word32 s9_1717;
	word32 s10_1718;
	word32 t4_1720;
	word32 s11_1719;
	word32 a4_1713;
	word32 a7_1714;
	word32 s7_1715;
	Eq_2 a3_133;
	word32 a1_131;
	Eq_299657 a2_132;
	Eq_2 a0_127 = mbedtls_debug_print_msg(ra, a0, 0x02, &g_t23089FE4, a5, out a1_131, out a2_132, out a3_133, out a4_1713, out a5_32, out a7_1714, out s4_40, out s5_41, out s6_42, out s7_1715, out s8_1716, out s9_1717, out s10_1718, out s11_1719, out t4_1720);
	struct Eq_299678 * sp_173 = fp + -96;
	Eq_2 s2_1062 = 0x2308A000;
	Eq_2 s0_1058 = a5_32->t0000;
	ui32 a5_51 = (word32) a5_32->w0074;
	if ((a5_51 & 0x02) != 0x00)
	{
		s0_1058 = (a5_51 & 0x02)->t0030;
		if ((a5_51 & 0x02) != 0x00)
		{
			a5_129 = (struct Eq_299638 *) 0x01;
			if ((word32) (a5_51 & 0x02)->b0034 == 0x01)
			{
l2305AEC0:
				struct Eq_299719 * s0_203 = a5_129->ptr0000;
				ui32 a5_204 = (word32) a5_129->w0074;
				if ((a5_204 & 0x02) != 0x00)
				{
					s0_203 = (a5_204 & 0x02)->ptr0030;
					if ((a5_204 & 0x02) != 0x00 && (word32) (a5_204 & 0x02)->b0034 != 0x01)
					{
						Eq_299826 a5_209 = s0_203->t00A4;
						if ((a5_209 & ~0x02) == 0x14)
						{
							Eq_2 a3_230;
							Eq_2 a4_231;
							Eq_2 a5_232;
							word32 s8_1734;
							word32 a2_1732;
							word32 s4_1733;
							word32 s1_1730;
							word32 a1_1731;
							ra = mycalloc(ra, s1, 0x01, 0x10, a3_133, 0x14, a5_209 & ~0x02, mstatus, sp_173->t0020, sp_173->t0024, sp_173->t0118, sp_173->t0158, out s0_1058, out s1_1730, out a1_1731, out a2_1732, out a3_230, out a4_231, out a5_232, out s2_1062, out s3_1074, out s4_1733, out s8_1734);
							if (false)
							{
								word32 a4_1745;
								word32 a5_1746;
								word32 s4_1748;
								word32 s6_1750;
								word32 s11_1755;
								word32 t4_1756;
								word32 s7_1751;
								word32 s8_1752;
								word32 s9_1753;
								word32 s10_1754;
								word32 s5_1749;
								word32 a7_1747;
								word32 a3_1744;
								word32 a2_1743;
								word32 a1_1742;
								mbedtls_debug_print_msg(ra, s0_1058, 0x01, &g_t23089FF4, 0x10, out a1_1742, out a2_1743, out a3_1744, out a4_1745, out a5_1746, out a7_1747, out s4_1748, out s5_1749, out s6_1750, out s7_1751, out s8_1752, out s9_1753, out s10_1754, out s11_1755, out t4_1756);
								goto l2305AF0C;
							}
							Eq_2 s0_255;
							Eq_2 s1_256;
							word32 a5_1739;
							word32 s4_1740;
							word32 s8_1741;
							word32 a2_1736;
							word32 a3_1737;
							word32 a4_1738;
							word32 a1_1735;
							ra = mycalloc(ra, 0x01, 0x01, *((word32) s0_1058 + 0x00A8), a3_230, a4_231, a5_232, mstatus, sp_173->t0020, sp_173->t0024, sp_173->t0118, sp_173->t0158, out s0_255, out s1_256, out a1_1735, out a2_1736, out a3_1737, out a4_1738, out a5_1739, out s2_1062, out s3_1074, out s4_1740, out s8_1741);
							*(union Eq_2 *) 0x01 = s1_256;
							a0_127.u0 = 0x01;
							Eq_2 a5_266 = *((word32) s0_255 + 0x00A8);
							if (false)
							{
								Eq_2 a5_1229;
								Eq_2 a2_1231;
								word32 s4_1768;
								word32 s5_1769;
								word32 s7_1771;
								word32 s9_1773;
								word32 s10_1774;
								word32 s11_1775;
								word32 t4_1776;
								word32 s8_1772;
								word32 s6_1770;
								word32 a7_1767;
								word32 a1_1764;
								word32 a4_1766;
								word32 a3_1765;
								mbedtls_debug_print_msg(ra, s0_255, 0x01, &g_t23089FF4, a5_266, out a1_1764, out a2_1231, out a3_1765, out a4_1766, out a5_1229, out a7_1767, out s4_1768, out s5_1769, out s6_1770, out s7_1771, out s8_1772, out s9_1773, out s10_1774, out s11_1775, out t4_1776);
								word32 s4_1785;
								word32 t3_1786;
								word32 a4_1782;
								word32 a5_1783;
								word32 a6_1784;
								word32 a2_1780;
								word32 a3_1781;
								word32 a0_1778;
								word32 a1_1779;
								word32 s1_1777;
								vPortFree(s1_256, a2_1231, a5_1229, mstatus, sp_173->t0158, sp_173->t0198, out s0_1058, out s1_1777, out a0_1778, out a1_1779, out a2_1780, out a3_1781, out a4_1782, out a5_1783, out a6_1784, out s4_1785, out t3_1786);
l2305AF0C:
								word32 s8_1791;
								word32 s9_1792;
								word32 s10_1793;
								word32 s7_1790;
								word32 a3_1787;
								word32 s6_1789;
								word32 s5_1788;
								mbedtls_debug_print_ret(ra, 0x01, 0x00FFFAF1, 0xF8000100, out a1_1084, out a2_1085, out a3_1787, out a4_1087, out a5_1083, out s4_1091, out s5_1788, out s6_1789, out s7_1790, out s8_1791, out s9_1792, out s10_1793, out s11_1090);
								s1_1075.u0 = 0xF8000100;
								goto l2305AE12;
							}
							struct Eq_300099 * a4_269;
							word32 a6_1762;
							word32 a7_1763;
							word32 a3_1760;
							word32 a5_1761;
							memcpy(0x01, *((word32) s0_255 + 0x00A0), a5_266, out a1_131, out a2_132, out a3_1760, out a4_269, out a5_1761, out a6_1762, out a7_1763);
							*((word32) *((word32) s0_255 + 0x00A8) + 4) = s1_256;
							Eq_2 a5_284 = *((word32) s0_255 + 0x00A4);
							*((word32) s1_256 + 0x0C) = 0x00;
							((word32) s1_256 + 8)->u1 = (byte) a5_284;
							s0_203 = a4_269->ptr0030;
							Eq_2 a4_288 = *((word32) a5_284 + 56);
							if (a5_284 == 0x00)
								*((word32) s1_256 + 56) = a4_288;
							else
							{
								do
								{
									word32 a5_291 = *((word32) a4_288 + 0x0C);
								} while (a4_288 != 0x00);
								*((word32) s1_256 + 0x0C) = a5_291;
							}
						}
					}
				}
				Eq_2 a5_1102;
				Eq_2 a3_1104;
				union Eq_299826 * a5_299 = s0_203->ptr0094;
				*a5_299 = (union Eq_299826 *) s0_203->t00A4;
				struct Eq_299830 * s0_323 = *((word32) a0_127 + 8);
				Eq_2 a0_327 = mbedtls_ssl_write_version(a0_127, a1_131, a2_132 >> 1 & 0x01, (char *) *((char *) *a5_299 + 0x0094) + 1);
				s0_323->t0098->u1 = (byte) (s3_1074 >> 0x08);
				Eq_2 a5_336 = s0_323->t0098;
				((word32) a5_336 + 1)->u1 = (byte) s3_1074;
				Eq_2 s0_338 = *((word32) a5_336 + 56);
				if (a5_336 == 0x00)
				{
l2305B3E0:
					Eq_2 s0_975 = *a0_327;
					word32 a5_1804;
					Eq_2 a0_977 = mbedtls_ssl_hdr_len.isra.1(a0_327, out a5_1804);
					struct Eq_300312 * a3_980 = *((word32) s0_975 + 0x0098);
					Mem983[s0_975 + 0x00AC:word32] = a0_977 + Mem974[s0_975 + 0x00A8:int32];
					uint32 a4_988 = (word32) a3_980->b0001 << 8 | (word32) a3_980->b0000;
					Eq_2 a5_996 = (word32) **((word32) s0_975 + 0x0094);
					sp_173->ptr0000 = (word32) (word16) (a4_988 >> 8 | a4_988 << 0x08);
					word32 s7_1814;
					word32 s8_1815;
					word32 s10_1817;
					word32 t4_1819;
					word32 s11_1818;
					word32 s9_1816;
					word32 s6_1813;
					word32 a4_1808;
					word32 a5_1809;
					word32 a7_1810;
					word32 s5_1812;
					word32 s4_1811;
					word32 a1_1805;
					word32 a2_1806;
					word32 a3_1807;
					Eq_2 a0_1007 = mbedtls_debug_print_msg(ra, s0_975, 0x03, &g_t2308A17C, a5_996, out a1_1805, out a2_1806, out a3_1807, out a4_1808, out a5_1809, out a7_1810, out s4_1811, out s5_1812, out s6_1813, out s7_1814, out s8_1815, out s9_1816, out s10_1817, out s11_1818, out t4_1819);
					Eq_2 s0_1026 = *a0_1007;
					word32 a5_1820;
					mbedtls_ssl_hdr_len.isra.1(a0_1007, out a5_1820);
					Eq_2 a5_1039;
					word32 a4_1824;
					word32 a7_1825;
					word32 a1_1821;
					word32 a2_1822;
					word32 a3_1823;
					mbedtls_debug_print_buf(ra, 0x04, *((word32) s0_1026 + 0x0094), out a1_1821, out a2_1822, out a3_1823, out a4_1824, out a5_1039, out a7_1825);
					word32 s11_1837;
					Eq_2 a0_1050;
					Eq_2 a5_1055;
					word32 s10_1836;
					word32 s4_1831;
					word32 s5_1832;
					word32 s6_1833;
					word32 s9_1835;
					word32 s7_1834;
					word32 a2_1828;
					word32 a3_1829;
					word32 a4_1830;
					word32 s1_1826;
					word32 a1_1827;
					s0_1058 = mbedtls_ssl_flush_output(ra, s0_1026, a5_1039, sp_173->t0128, out s1_1826, out a0_1050, out a1_1827, out a2_1828, out a3_1829, out a4_1830, out a5_1055, out s2_1062, out s3_1074, out s4_1831, out s5_1832, out s6_1833, out s7_1834, out s9_1835, out s10_1836, out s11_1837);
					s1_1075 = a0_1050;
					if (a0_1050 == 0x00)
					{
						word32 s8_1859;
						word32 t4_1862;
						word32 a3_1854;
						word32 s5_1856;
						word32 a7_1855;
						word32 s6_1857;
						word32 s7_1858;
						word32 s10_1861;
						word32 s9_1860;
						mbedtls_debug_print_msg(ra, s0_1058, 0x02, &g_t2308A1F4, a5_1055, out a1_1084, out a2_1085, out a3_1854, out a4_1087, out a5_1083, out a7_1855, out s4_1091, out s5_1856, out s6_1857, out s7_1858, out s8_1859, out s9_1860, out s10_1861, out s11_1090, out t4_1862);
						goto l2305AE12;
					}
					a5_1102 = a0_1050;
					a3_1104 = (word32) s3_1074 - 1224;
l2305B256:
					word32 s6_1865;
					word32 s7_1866;
					word32 s8_1867;
					word32 s9_1868;
					word32 s5_1864;
					word32 s10_1869;
					word32 a3_1863;
					mbedtls_debug_print_ret(ra, 0x01, a3_1104, a5_1102, out a1_1084, out a2_1085, out a3_1863, out a4_1087, out a5_1083, out s4_1091, out s5_1864, out s6_1865, out s7_1866, out s8_1867, out s9_1868, out s10_1869, out s11_1090);
l2305AE12:
					s0Out = s0_1058;
					s1Out = dwArg28;
					a0Out = s1_1075;
					a1Out = a1_1084;
					a2Out = a2_1085;
					a3Out = dwArg08;
					a4Out = a4_1087;
					a5Out = a5_1083;
					s2Out = s2_1062;
					s3Out = s3_1074;
					s4Out = s4_1091;
					s5Out = s4;
					s11Out = s11_1090;
					mstatusOut = mstatus;
					return dwArg68;
				}
				word32 a7_1842;
				word32 a3_1840;
				word32 a1_1838;
				word32 s6_361;
				word32 s11_1849;
				word32 t4_1850;
				word32 s4_1843;
				word32 s9_1847;
				word32 s5_1844;
				word32 s10_1848;
				word32 a4_1841;
				word32 s8_1846;
				word32 s7_1845;
				word32 a2_1839;
				Eq_2 a5_1160;
				mbedtls_debug_print_msg(ra, s0_338, 0x02, &g_t2308A020, a5_336, out a1_1838, out a2_1839, out a3_1840, out a4_1841, out a5_1160, out a7_1842, out s4_1843, out s5_1844, out s6_361, out s7_1845, out s8_1846, out s9_1847, out s10_1848, out s11_1849, out t4_1850);
				s0_1058 = *((word32) a5_1160 + 36);
				if (a5_1160 == 0x00)
				{
l2305AFF4:
					goto l2305B000;
				}
				s0_1058 = *((word32) a5_1160 + 56);
				if (a5_1160 == 0x00)
					goto l2305AFF4;
				struct Eq_300496 * a5_371 = *((word32) a5_1160 + 80);
				Eq_2 s1_372 = 0x00;
				if (a5_371 != null)
					s1_372 = (word32) a5_371->b0001;
				word32 s5_400;
				word32 a7_1853;
				struct Eq_300507 * a3_390;
				struct Eq_295064 * a4_391;
				word32 a5_1852;
				word32 a1_1851;
				word32 a2_389;
				struct Eq_294369 * a0_386 = mbedtls_debug_print_buf(ra, 0x04, *((word32) s0_1058 + 0x00A0), out a1_1851, out a2_389, out a3_390, out a4_391, out a5_1852, out a7_1853);
				a5_1160.u0 = 0x07;
				if (s1_372 != 0x07)
				{
					a5_1160.u0 = 0x02;
					s5_400 = 0x00;
					if (s1_372 != 0x02)
						goto l2305B0F4;
				}
				s0_1058 = *((word16) a5_1160.u0 + 0x0C);
				if (a5_1160 <= 0x00)
					goto l2305B000;
				word32 a0_418;
				struct Eq_295064 * a4_420;
				Eq_2 a5_421;
				word32 a0_427;
				struct Eq_295064 * a4_429;
				Eq_2 a5_430;
				struct Eq_300610 * a0_436;
				struct Eq_295064 * a4_438;
				Eq_2 a5_439;
				Eq_2 ra_440 = mbedtls_md_hmac_update(mbedtls_md_hmac_update(mbedtls_md_hmac_update(ra, (char *) &a0_386->t0010 + 40, a4_391, a5_1160, sp_173->t0010, out a0_418, out a4_420, out a5_421), a0_418 + 56, a4_420, a5_421, sp_173->t0010, out a0_427, out a4_429, out a5_430), a0_427 + 56, a4_429, a5_430, sp_173->t0010, out a0_436, out a4_438, out a5_439);
				struct Eq_300644 * s0_441 = a0_436->ptr0038;
				word32 a5_1870;
				struct Eq_300649 * a0_446;
				ptr32 a4_448;
				Eq_2 ra_450 = mbedtls_md_hmac_update(ra_440, &a0_436->ptr0038, a4_438, a5_439, sp_173->t0010, out a0_446, out a4_448, out a5_1870);
				struct Eq_295070 * a5_451 = s0_441->ptr00A8;
				word32 a5_1875;
				word32 a4_1872;
				word32 a4_1874;
				word32 s0_1873;
				word32 a2_1871;
				word32 a0_458;
				struct Eq_295080 * a1_459;
				Eq_2 a5_462;
				ra = mbedtls_md_hmac_reset(mbedtls_md_hmac_finish(ra_450, a0_446->dw0038, s1_372, &a0_446->dw0038, a5_451 + s0_441->dw00A0 / 0x0C, a4_448, a5_451, s2_1062, sp_173->ptr0100, sp_173->dw0104, sp_173->t0128, out s1_372, out a0_458, out a1_459, out a2_1871, out a4_1872, out a5_462, out s2_1062), a0_458 + 56, a1_459, a5_462, out s0_1873, out a4_1874, out a5_1875);
				struct Eq_300708 * s0_480 = a3_390->ptr0038;
				word32 a1_1876;
				struct Eq_300713 * a4_496;
				word32 a5_1878;
				word32 a7_1879;
				word32 a3_1877;
				a0_386 = mbedtls_debug_print_buf(ra, 0x04, s0_480->dw00A8 + s0_480->dw00A0, out a1_1876, out a2_389, out a3_1877, out a4_496, out a5_1878, out a7_1879);
				s0_1058 = a4_496->t0038;
				*((word32) s0_1058 + 0x00A8) = (word32) *((word32) s0_1058 + 0x00A8) + a4_496->dw0014;
				s5_400 = 0x01;
l2305B0F4:
				Eq_2 a5_1112;
				Eq_2 a3_1114;
				word32 s5_702;
				ui32 a5_508 = (word32) s1_372 - 6;
				if ((a5_508 & 0x00FD) == 0x00)
				{
					struct Eq_300785 * s0_714 = (a5_508 & 0x00FD)->ptr0038;
					s3_1074.u0 = 0x08;
					if (((word32) *((char *) *(a5_508 & 0x00FD) + 28) & 0x02) == 0x00)
						s3_1074.u0 = 0x10;
					Eq_2 a0_725 = (char *) &sp_173->t0024 + 0x0C;
					word32 a1_729;
					uint32 a2_730;
					word32 a3_1895;
					word32 a4_1896;
					word32 a5_1897;
					word32 a6_1898;
					word32 a7_1899;
					memcpy(a0_725, s0_714->t0090, 0x08, out a1_729, out a2_730, out a3_1895, out a4_1896, out a5_1897, out a6_1898, out a7_1899);
					struct Eq_300834 ** a5_739 = s0_714->ptr00A4;
					sp_173->t0038 = (byte) a5_739;
					struct Eq_300834 * s0_743 = *a5_739;
					mbedtls_ssl_write_version(a0_725, a1_729, a2_730 >> 1 & 0x01, (char *) &sp_173->t0038 + 1);
					Eq_300846 a5_751 = s0_743->t00A8;
					sp_173->b003B = (byte) (a5_751 >> 0x08);
					sp_173->b003C = (byte) a5_751;
					struct Eq_300860 * a5_766;
					word32 a4_770;
					word32 a1_1900;
					word32 a2_1901;
					word32 a3_1902;
					word32 a7_1903;
					struct Eq_294369 * a0_765 = mbedtls_debug_print_buf(ra, 0x04, (char *) &sp_173->t0024 + 0x0C, out a1_1900, out a2_1901, out a3_1902, out a4_770, out a5_766, out a7_1903);
					s0_1058 = a5_766->t0038;
					a5_1160 = a0_765->t0010;
					if (a4_770 + ~0x07 != a0_765)
					{
l2305B000:
						word32 a2_1881;
						word32 a1_1880;
						word32 a3_1882;
						word32 a4_1883;
						word32 a5_1884;
						word32 a7_1885;
						word32 s4_1886;
						word32 s5_1887;
						word32 s6_1888;
						word32 s7_1889;
						word32 s8_1890;
						word32 s9_1891;
						word32 s10_1892;
						word32 s11_1893;
						word32 t4_1894;
						mbedtls_debug_print_msg(ra, s0_1058, 0x01, &g_t23088F14, a5_1160, out a1_1880, out a2_1881, out a3_1882, out a4_1883, out a5_1884, out a7_1885, out s4_1886, out s5_1887, out s6_1888, out s7_1889, out s8_1890, out s9_1891, out s10_1892, out s11_1893, out t4_1894);
						s1_1075.u0 = 0xF9000400;
						goto l2305B246;
					}
					word32 a1_1904;
					word32 a2_1905;
					word32 a3_1906;
					word32 a4_1907;
					word32 a5_1908;
					word32 a6_1909;
					word32 a7_1910;
					memcpy(a0_765 + (a5_1160 + 0x18), Mem757[s0_1058 + 144:int32], 0x08, out a1_1904, out a2_1905, out a3_1906, out a4_1907, out a5_1908, out a6_1909, out a7_1910);
					struct Eq_300911 * a5_801;
					word32 a1_1911;
					word32 a2_1912;
					word32 a3_1913;
					word32 a4_1914;
					word32 a6_1915;
					word32 a7_1916;
					memcpy(*((word32) s0_1058 + 0x009C), *((word32) s0_1058 + 144), 0x08, out a1_1911, out a2_1912, out a3_1913, out a4_1914, out a5_801, out a6_1915, out a7_1916);
					struct Eq_300934 * a5_825;
					struct Eq_300935 * a4_829;
					word32 a1_1917;
					word32 a2_1918;
					word32 a3_1919;
					word32 a7_1920;
					mbedtls_debug_print_buf(ra, 0x04, a5_801->ptr0038->t009C, out a1_1917, out a2_1918, out a3_1919, out a4_829, out a5_825, out a7_1920);
					Eq_2 s0_835 = a4_829->t0038;
					int32 a7_837 = *((word32) s0_835 + 0x00A0);
					word32 a5_842 = a5_825 + Mem757[s0_835 + 0x00A8:int32] - Mem757[Mem757[a5_825 + 0x0C:word32] + 16:word32];
					*((word32) s0_835 + 0x00A8) = a5_842;
					sp_173->dw008C = a7_837;
					Eq_2 a2_854;
					word32 a7_857;
					Eq_2 s4_860;
					Eq_2 s5_861;
					union Eq_2 * t4_869;
					word32 a1_1921;
					word32 a3_1922;
					word32 a4_1923;
					word32 a5_1924;
					word32 s6_1925;
					word32 s7_1926;
					word32 s8_1927;
					word32 s9_1928;
					word32 s10_1929;
					word32 s11_1930;
					mbedtls_debug_print_msg(ra, s0_835, 0x03, &g_t2308A088, a5_842, out a1_1921, out a2_854, out a3_1922, out a4_1923, out a5_1924, out a7_857, out s4_860, out s5_861, out s6_1925, out s7_1926, out s8_1927, out s9_1928, out s10_1929, out s11_1930, out t4_869);
					word32 a0_873 = *((word32) a2_854 + 0x0C);
					sp_173->ptr0000 = (char *) &sp_173->t0024 + 8;
					sp_173->t0004 = s3_1074;
					sp_173->dw0080 = (word32) s4_860 + a7_857;
					Eq_2 a0_885;
					Eq_2 s4_902;
					word32 s5_903;
					Eq_2 s6_904;
					ra = mbedtls_cipher_auth_encrypt(ra, a0_873 + 80, a0_873 + 24, a2_854, 0x0D, s4_860, s5_861, t4_869, sp_173->t0038, sp_173->t0084, sp_173->t00A8, sp_173->dw00AC, sp_173->t0128, sp_173->t0198, out s0_1058, out a0_885, out a5_1160, out s2_1062, out s3_1074, out s4_902, out s5_903, out s6_904);
					s1_1075 = a0_885;
					if (a0_885 != 0x00)
					{
						a5_1112 = a0_885;
						a3_1114.u0 = 0x059F;
						goto l2305B23A;
					}
					if (s4_902 != a5_1160)
						goto l2305B000;
					Mem917[s0_1058 + 0x00A8:word32] = Mem879[s0_1058 + 0x00A8:int32] + s3_1074;
					word32 a1_1931;
					word32 a2_1932;
					word32 a3_1933;
					word32 a4_1934;
					word32 a5_1935;
					word32 a7_1936;
					mbedtls_debug_print_buf(ra, 0x04, s6_904, out a1_1931, out a2_1932, out a3_1933, out a4_1934, out a5_1935, out a7_1936);
					s5_702 = s5_903 + 0x01;
				}
				else
				{
					a5_1160.u0 = 0x02;
					if (s1_372 != 0x02)
						goto l2305B000;
					Eq_2 s0_515 = *(union Eq_2 *) 0x3A;
					sp_173->dw0018 = 0x00;
					Eq_2 a5_519 = *(union Eq_2 *) 0x0E;
					Eq_2 s3_1376 = a5_519 - ((word32) (*((word32) s0_515 + 0x00A8)) + 1 & a5_519);
					if (a5_519 == s3_1376)
						s3_1376.u0 = 0x00;
					Eq_2 a4_524 = 0x00;
					do
					{
						Mem533[Mem526[s0_515 + 0x00A0:int32] + a4_524 + Mem526[s0_515 + 0x00A8:int32]:byte] = SLICE(s3_1376, byte, 0);
						a4_524 = (word32) a4_524 + 1;
					} while (s3_1376 >= a4_524);
					Eq_2 s1_631;
					Eq_192792 s0_536 = *((word32) a4_524 + 0x0C);
					int32 s4_539 = (word16) s3_1376.u0 + ((word32) (*((word32) s0_515 + 0x00A8)) + 1);
					*((word32) s0_536 + 0x00A8) = s4_539;
					struct Eq_301169 * a5_537 = (struct Eq_301169 *) 0x01;
					if (a4_524 <= 0x01)
						s1_631 = *((word32) s0_536 + 0x00A0);
					else
					{
						Eq_2 a2_592;
						struct Eq_301174 * a1_593;
						Eq_2 a0_594;
						word32 a6_600;
						word32 t5_607;
						word32 t6_608;
						word32 tp_610;
						word32 t2_1388;
						a4_524();
						s1_1075 = a0_594;
						if (a0_594 != 0x00)
							goto l2305B246;
						struct Eq_301277 * a5_617;
						word32 a1_1965;
						word32 a2_1966;
						word32 a3_1967;
						word32 a4_1968;
						word32 a6_1969;
						word32 a7_1970;
						memcpy(a1_593->ptr0038->t009C, (word32) *((word32) a2_592 + 0x0C) + 24, a2_592, out a1_1965, out a2_1966, out a3_1967, out a4_1968, out a5_617, out a6_1969, out a7_1970);
						struct Eq_301304 * s0_629 = a5_617->ptr0038;
						s1_631 = s0_629->t00A0;
						a5_537 = s0_629->ptr00A8 + a5_617->dw000C / 60;
						s0_629->ptr00A8 = a5_537;
					}
					Eq_2 s0_638 = a5_537->t0038;
					Eq_2 a2_654;
					Eq_2 s4_660;
					Eq_2 s5_661;
					Eq_2 s7_663;
					word32 a1_1971;
					word32 a3_1972;
					word32 a4_1973;
					word32 a5_1974;
					word32 a7_1975;
					word32 s6_1976;
					word32 s8_1977;
					word32 s9_1978;
					word32 s10_1979;
					word32 s11_1980;
					word32 t4_1981;
					mbedtls_debug_print_msg(ra, s0_638, 0x03, &g_t2308A0F4, *((word32) s0_638 + 0x00A8), out a1_1971, out a2_654, out a3_1972, out a4_1973, out a5_1974, out a7_1975, out s4_660, out s5_661, out s6_1976, out s7_663, out s8_1977, out s9_1978, out s10_1979, out s11_1980, out t4_1981);
					word32 a0_674 = *((word32) a2_654 + 0x0C);
					Eq_2 a0_680;
					Eq_2 s4_692;
					word32 s1_1982;
					word32 a1_1983;
					word32 a2_1984;
					word32 a3_1985;
					ra = mbedtls_cipher_crypt(ra, a0_674 + 80, a0_674 + 24, a2_654, s1_631, s4_660, s1_631, (char *) &sp_173->t0024 + 0x0C, s5_661, s7_663, sp_173->t0008, sp_173->t0048, sp_173->t0068, sp_173->t0088, sp_173->t00B4, sp_173->t00D0, sp_173->t00D4, sp_173->t00F8, sp_173->t0128, out s0_1058, out s1_1982, out a0_680, out a1_1983, out a2_1984, out a3_1985, out a5_1160, out s2_1062, out s3_1074, out s4_692, out s5_702);
					s1_1075 = a0_680;
					if (a0_680 != 0x00)
					{
						a5_1112 = a0_680;
						a3_1114.u0 = 1515;
l2305B23A:
						word32 a1_1937;
						word32 a2_1938;
						word32 a3_1939;
						word32 a4_1940;
						word32 a5_1941;
						word32 s4_1942;
						word32 s5_1943;
						word32 s6_1944;
						word32 s7_1945;
						word32 s8_1946;
						word32 s9_1947;
						word32 s10_1948;
						word32 s11_1949;
						mbedtls_debug_print_ret(ra, 0x01, a3_1114, a5_1112, out a1_1937, out a2_1938, out a3_1939, out a4_1940, out a5_1941, out s4_1942, out s5_1943, out s6_1944, out s7_1945, out s8_1946, out s9_1947, out s10_1948, out s11_1949);
l2305B246:
						a5_1102 = s1_1075;
						a3_1104.u0 = 0x00FFFB22;
						goto l2305B256;
					}
					if (s4_692 != a5_1160)
						goto l2305B000;
				}
				a5_1160.u0 = 0x01;
				if (s5_702 != 0x01)
					goto l2305B000;
				word32 a1_1950;
				word32 a2_1951;
				word32 a3_1952;
				word32 a4_1953;
				word32 a5_1954;
				word32 a7_1955;
				word32 s4_1956;
				word32 s5_1957;
				word32 s6_1958;
				word32 s7_1959;
				word32 s8_1960;
				word32 s9_1961;
				word32 s10_1962;
				word32 s11_1963;
				word32 t4_1964;
				a0_327 = mbedtls_debug_print_msg(ra, s0_1058, 0x02, &g_t2308A15C, 0x01, out a1_1950, out a2_1951, out a3_1952, out a4_1953, out a5_1954, out a7_1955, out s4_1956, out s5_1957, out s6_1958, out s7_1959, out s8_1960, out s9_1961, out s10_1962, out s11_1963, out t4_1964);
				Eq_2 a5_967 = *((word32) s0_1058 + 0x00A8);
