pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
				(*((word32) s0_1058 + 0x0098))->u1 = (byte) (a5_967 >> 0x08);
				((word32) *((word32) s0_1058 + 0x0098) + 1)->u1 = (byte) a5_967;
				goto l2305B3E0;
			}
		}
	}
	Eq_2 a4_58 = *((word32) s0_1058 + 0x00A4);
	a5_129 = (struct Eq_299638 *) 22;
	if (a4_58 == 22)
	{
		Eq_2 a5_60 = *((word32) s0_1058 + 0x00A0);
		s1 = (word32) *a5_60;
		if (s1 != 0x00)
		{
			s0_1058 = *((word32) a4_58 + 48);
			if (a4_58 == 0x00)
			{
				word32 a7_1722;
				word32 s5_1723;
				word32 s7_1725;
				word32 s9_1727;
				word32 s10_1728;
				word32 t4_1729;
				word32 s8_1726;
				word32 s6_1724;
				word32 a3_1721;
				mbedtls_debug_print_msg(ra, s0_1058, 0x01, &g_t23088F14, a5_60, out a1_1084, out a2_1085, out a3_1721, out a4_1087, out a5_1083, out a7_1722, out s4_1091, out s5_1723, out s6_1724, out s7_1725, out s8_1726, out s9_1727, out s10_1728, out s11_1090, out t4_1729);
				s1_1075.u0 = 0xF9000400;
				goto l2305AE12;
			}
		}
		((word32) a5_60 + 1)->u1 = (byte) ((word32) s3_1074 - 4 >> 0x10);
		((word32) *((word32) s0_1058 + 0x00A0) + 2)->u1 = (byte) ((word32) s3_1074 - 4 >> 0x08);
		Eq_2 a5_73 = *((word32) s0_1058 + 0x00A0);
		*((word32) a5_73 + 3) = (byte) ((word32) s3_1074 - 4);
		ui32 a5_76 = (word32) *((word32) a5_73 + 116);
		a2_132 = (word32) s3_1074 - 4;
		struct Eq_299775 * s0_102 = *a5_73;
		a5_129 = a5_76 & 0x02;
		if ((a5_76 & 0x02) != 0x00)
		{
			struct Eq_300021 * a0_78 = s0_102->ptr00A0;
			word32 a5_1759;
			word32 a3_1757;
			word32 a4_1758;
			memmove(&a0_78->b0005 + 7, &a0_78->b0004, (word32) s3_1074 - 4, out a3_1757, out a4_1758, out a5_1759);
			struct Eq_300038 * a5_86 = s0_102->ptr00A8;
			struct Eq_300021 * a4_87 = s0_102->ptr00A0;
			s0_102->ptr00A8 = (struct Eq_300038 *) ((char *) a5_86 + 8);
			s3_1074 = (word32) s3_1074 + 8;
			if (s1 != 0x00)
			{
				a4_87->b0004 = (byte) (a5_86->dw0024 >> 8);
				struct Eq_300075 * a5_99 = a4_87->ptr0030->ptr00A0;
				struct Eq_300082 * a4_100 = a4_87->ptr001C;
				a5_99->b0005 = (byte) a4_100;
				s0_102 = a4_100->ptr0030;
				a5_99->dw001D = a5_99->dw001C;
			}
			else
			{
				a4_87->b0004 = 0x00;
				s0_102->ptr00A0->b0005 = 0x00;
			}
			word32 t1_1794;
			word32 a1_1796;
			word32 a2_1797;
			word32 a3_1798;
			word32 a4_1799;
			word32 a5_1800;
			word32 a0_1795;
			ra = memset(ra, &s0_102->ptr00A0->b0005 + 1, 0x00, 0x03, out t1_1794, out a0_1795, out a1_1796, out a2_1797, out a3_1798, out a4_1799, out a5_1800);
			struct Eq_300021 * a0_124 = s0_102->ptr00A0;
			word32 a7_1803;
			word32 a4_1801;
			word32 a6_1802;
			memcpy(&a0_124->b0005 + 4, (char *) a0_124 + 1, 0x03, out a1_131, out a2_132, out a3_133, out a4_1801, out a5_129, out a6_1802, out a7_1803);
			a0_127 = &a0_124->b0005 + 4;
		}
		if (s1 != 0x00)
		{
			word32 s0_145 = a5_129->dw0030;
			<anonymous> * a5_150 = a5_129->ptr00C4;
			word32 a6_192;
			word32 t5_199;
			word32 t6_200;
			word32 t2_1387;
			word32 tp_1386;
			a5_150();
		}
	}
	goto l2305AEC0;
}

// 2305B494: Register Eq_2 mbedtls_ssl_resend(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg0128, Register out (ptr32 (ptr32 (ptr32 Eq_329291))) s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_301462) a4Out, Register out Eq_301463 a5Out, Register out ptr32 s2Out, Register out Eq_301465 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out (ptr32 Eq_301471) s10Out, Register out (ptr32 Eq_301472) s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_ssl_fetch_input
//      mbedtls_ssl_prepare_handshake_record
//      mbedtls_ssl_read_record_layer
//      mbedtls_ssl_read
//      mbedtls_ssl_handshake_client_step
//      mbedtls_ssl_handshake_server_step
Eq_2 mbedtls_ssl_resend(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg0128, struct Eq_329291 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, struct Eq_301462 & a4Out, union Eq_301463 & a5Out, ptr32 & s2Out, union Eq_301465 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, struct Eq_301471 & s10Out, struct Eq_301472 & s11Out, ptr32 & mstatusOut)
{
	struct Eq_301474 * a5_33;
	word32 s4_480;
	word32 s5_481;
	word32 a7_479;
	word32 s6_482;
	word32 s7_483;
	word32 s8_484;
	word32 s9_485;
	word32 s10_486;
	word32 s11_487;
	word32 t4_488;
	struct Eq_301485 * a3_208;
	Eq_2 a4_125;
	Eq_2 a2_128;
	Eq_2 a1_127;
	mbedtls_debug_print_msg(ra, a0, 0x02, &g_t23089CF8, a5, out a1_127, out a2_128, out a3_208, out a4_125, out a5_33, out a7_479, out s4_480, out s5_481, out s6_482, out s7_483, out s8_484, out s9_485, out s10_486, out s11_487, out t4_488);
	ptr32 s2_10 = 0x2308A000;
	Eq_2 s0_51 = a5_33->t0030;
	Eq_2 s1_116 = 0x01;
	Eq_2 a5_113 = (word32) a5_33->b0034;
	if (a5_113 != 0x01)
	{
		Eq_2 a4_65;
		word32 a1_489;
		word32 a2_490;
		word32 a3_491;
		word32 a5_492;
		word32 a7_493;
		word32 s4_494;
		word32 s5_495;
		word32 s6_496;
		word32 s7_497;
		word32 s8_498;
		word32 s9_499;
		word32 s10_500;
		word32 s11_501;
		word32 t4_502;
		mbedtls_debug_print_msg(ra, s0_51, 0x02, &g_t23089D10, a5_113, out a1_489, out a2_490, out a3_491, out a4_65, out a5_492, out a7_493, out s4_494, out s5_495, out s6_496, out s7_497, out s8_498, out s9_499, out s10_500, out s11_501, out t4_502);
		Eq_2 a5_81 = *((word32) a4_65 + 56);
		*((word32) a4_65 + 60) = a5_81;
		ssl_swap_epochs(ra, a4_65, a5_81, out a1_127, out a2_128, out a3_208, out a4_125, out a5_113);
		((word32) a5_113 + 52)->u1 = 0x01;
	}
	Eq_301465 s3_108 = 0x01000000;
	byte * s4_109 = (byte *) 22;
	Eq_2 s5_110 = 0x14;
	do
	{
		Eq_301463 a5_249;
		struct Eq_301462 * a4_248;
		ptr32 a3_245;
		ptr32 a1_246;
		struct Eq_301471 * s10_252;
		struct Eq_301472 * s11_253;
		ptr32 s5_255;
		ptr32 s9_259;
		ptr32 s7_257;
		ptr32 s6_256;
		struct Eq_301577 * s0_115 = *((word32) a5_113 + 48);
		Eq_2 a5_117 = *((word16) s1_116.u0 + 60);
		if (s1_116 == 0x00)
		{
			Eq_2 s0_266 = a3_208->t0004;
			if (a3_208 == (struct Eq_301485 *) 0x10)
				((word32) a5_117 + 52)->u1 = 0x03;
			else
			{
				((word32) a5_117 + 52)->u1 = 0x02;
				word32 s1_503;
				word32 a1_504;
				word32 a3_505;
				word32 a4_506;
				word32 s4_507;
				word32 s5_508;
				word32 s6_509;
				word32 s7_510;
				word32 s9_511;
				word32 s10_512;
				word32 s11_513;
				ra = ssl_set_timer(ra, *((word32) a5_117 + 48), a1_127, *((word32) a1_127 + 48), s2, s0, out s0_266, out s1_503, out a1_504, out a3_505, out a4_506, out a5_117, out s4_507, out s5_508, out s6_509, out s7_510, out s9_511, out s10_512, out s11_513);
			}
			word32 a2_530;
			word32 a7_531;
			word32 s4_532;
			word32 s8_533;
			word32 t4_534;
			mbedtls_debug_print_msg(ra, s0_266, 0x02, &g_t23089D64, a5_117, out a1_246, out a2_530, out a3_245, out a4_248, out a5_249, out a7_531, out s4_532, out s5_255, out s6_256, out s7_257, out s8_533, out s9_259, out s10_252, out s11_253, out t4_534);
			s1_116.u0 = 0x00;
			goto l2305B5B0;
		}
		byte * a5_118 = (word32) *((word32) s1_116 + 8);
		if (a5_118 == s4_109)
		{
			Eq_2 a5_121 = (word32) *a5_118;
			if (a5_121 == s5_110)
			{
				word32 a3_527;
				word32 a4_528;
				word32 a5_529;
				s0_115 = ssl_swap_epochs(ra, a4_125, a5_121, out a1_127, out a2_128, out a3_527, out a4_528, out a5_529);
			}
		}
		struct Eq_301649 * a4_158;
		struct Eq_301650 * a5_159;
		word32 a1_514;
		word32 a2_515;
		word32 a3_516;
		word32 a6_517;
		word32 a7_518;
		memcpy(s0_115->t00A0, a1_127, a2_128, out a1_514, out a2_515, out a3_516, out a4_158, out a5_159, out a6_517, out a7_518);
		struct Eq_301669 * s1_171 = a5_159->ptr0004;
		s0_115->ptr00A8 = a5_159;
		struct Eq_301676 * a5_177 = (word32) s1_171->b0008;
		s0_115->ptr00A4 = a5_177;
		Eq_2 s1_183 = a4_158->t000C;
		Eq_2 s0_184 = a5_177->t0030;
		a4_158->ptr003C = a5_177;
		Eq_2 a5_193;
		word32 a1_519;
		word32 a2_520;
		word32 a3_521;
		word32 a4_522;
		word32 a7_523;
		mbedtls_debug_print_buf(ra, 0x03, *((word32) s0_184 + 0x00A0), out a1_519, out a2_520, out a3_521, out a4_522, out a5_193, out a7_523);
		Eq_2 a0_231;
		word32 s0_524;
		word32 s1_525;
		word32 s11_526;
		ra = mbedtls_ssl_write_record(ra, s1_183, s0_184, a5_193, mstatus, out s0_524, out s1_525, out a0_231, out a1_127, out a2_128, out a3_208, out a4_125, out a5_113, out s2_10, out s3_108, out s4_109, out s5_110, out s11_526, out mstatus);
		s1_116 = a0_231;
	} while (a0_231 == 0x00);
	word32 a2_535;
	word32 s4_536;
	word32 s8_537;
	mbedtls_debug_print_ret(ra, 0x01, (word32) s3_108 - 1443, a0_231, out a1_246, out a2_535, out a3_245, out a4_248, out a5_249, out s4_536, out s5_255, out s6_256, out s7_257, out s8_537, out s9_259, out s10_252, out s11_253);
l2305B5B0:
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_116;
	a0Out = s1_116;
	a1Out = a1_246;
	a2Out = dwArgB8;
	a3Out = a3_245;
	a4Out = a4_248;
	a5Out = a5_249;
	s2Out = s2_10;
	s3Out = s3_108;
	s4Out = dwArg78;
	s5Out = s5_255;
	s6Out = s6_256;
	s7Out = s7_257;
	s9Out = s9_259;
	s10Out = s10_252;
	s11Out = s11_253;
	mstatusOut = mstatus;
	return ra;
}

