pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305B5DA: Register Eq_2 mbedtls_ssl_fetch_input(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 a0Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_ssl_read_record_layer
//      mbedtls_ssl_handshake_server_step
Eq_2 mbedtls_ssl_fetch_input(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_2 & a0Out, ptr32 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	ptr32 s10_1125;
	ptr32 s11_1128;
	ptr32 s5_1146;
	ptr32 s6_1149;
	ptr32 s7_1152;
	ptr32 s9_1155;
	Eq_2 s1_135;
	struct Eq_274 * a4_765;
	Eq_2 s0_258;
	struct Eq_301837 * a4_43;
	word32 a7_1240;
	word32 a3_1239;
	word32 a1_1237;
	word32 a2_1238;
	word32 s6_1243;
	word32 s4_1241;
	word32 s5_1242;
	word32 s11_1248;
	word32 t4_1249;
	word32 s7_1244;
	word32 s8_1245;
	word32 s9_1246;
	word32 s10_1247;
	Eq_2 a5_113;
	mbedtls_debug_print_msg(ra, a0, 0x02, &g_t23089054, a5, out a1_1237, out a2_1238, out a3_1239, out a4_43, out a5_113, out a7_1240, out s4_1241, out s5_1242, out s6_1243, out s7_1244, out s8_1245, out s9_1246, out s10_1247, out s11_1248, out t4_1249);
	Eq_2 s3_1135 = a1;
	ptr32 s2_1131 = 0x2308A000;
	if (a5_113 == 0x00)
	{
		s0_258 = *((word32) a5_113 + 24);
		if (a5_113 == 0x00)
		{
			a4_765 = (struct Eq_274 *) &g_t2308916C;
			goto l2305B62C;
		}
	}
	struct Eq_301876 * a4_65 = a5_113 - a4_43;
	s0_258 = a4_43->t0050;
	a5_113 = 0x0400013D - a4_65;
	if (a5_113 < a1)
	{
		a4_765 = (struct Eq_274 *) &g_t23089064;
		goto l2305B678;
	}
	Eq_2 s0_108;
	ui32 a5_71 = (word32) *((word32) a5_113 + 116);
	a5_113 = a5_71 & 0x02;
	if ((a5_71 & 0x02) != 0x00)
	{
		s0_258 = (a5_71 & 0x02)->t0048;
		if ((a5_71 & 0x02) == 0x00)
		{
l2305B692:
			a4_765 = (struct Eq_274 *) &g_t23089084;
l2305B62C:
			word32 s8_1257;
			word32 a1_1250;
			word32 a4_1253;
			word32 a2_1251;
			word32 a3_1252;
			word32 s4_1256;
			word32 a5_1254;
			word32 a7_1255;
			word32 t4_1258;
			mbedtls_debug_print_msg(ra, s0_258, 0x01, a4_765, a5_113, out a1_1250, out a2_1251, out a3_1252, out a4_1253, out a5_1254, out a7_1255, out s4_1256, out s5_1146, out s6_1149, out s7_1152, out s8_1257, out s9_1155, out s10_1125, out s11_1128, out t4_1258);
			s1_135.u0 = ~0x070000FF;
			goto l2305B63A;
		}
		s0_258 = (a5_71 & 0x02)->t004C;
		if ((a5_71 & 0x02) == 0x00)
			goto l2305B692;
		if ((a5_71 & 0x02) != 0x00)
		{
			s0_108 = a4_65->t0074;
			if (a4_65 < (a5_71 & 0x02))
				goto l2305B6BA;
			struct Eq_302158 * a4_262 = a4_65 - (a5_71 & 0x02);
			a4_262->t0074 = s0_108;
			if (a4_262 != null)
			{
				word32 a7_1319;
				word32 a1_273;
				struct Eq_28011 * a2_274;
				word32 s10_1326;
				word32 s11_1327;
				word32 t4_1328;
				word32 s8_1324;
				word32 s9_1325;
				word32 s7_1323;
				word32 s5_1321;
				word32 s6_1322;
				word32 s4_1320;
				word32 a3_1316;
				word32 a5_1318;
				word32 a4_1317;
				Eq_2 a0_271 = mbedtls_debug_print_msg(ra, s0_108, 0x02, &g_t230890B8, a5_71 & 0x02, out a1_273, out a2_274, out a3_1316, out a4_1317, out a5_1318, out a7_1319, out s4_1320, out s5_1321, out s6_1322, out s7_1323, out s8_1324, out s9_1325, out s10_1326, out s11_1327, out t4_1328);
				s0_108 = a2_274[116];
				word32 a3_1329;
				word32 a4_1330;
				memmove(a0_271, (word32) a0_271 + a1_273, a2_274, out a3_1329, out a4_1330, out a5_113);
			}
			((word32) s0_108 + 0x007C)->u0 = 0x00;
		}
		word32 t4_1315;
		word32 s9_1312;
		word32 s10_1313;
		word32 s11_1314;
		word32 s4_1307;
		word32 s5_1308;
		word32 s6_1309;
		word32 s7_1310;
		word32 s8_1311;
		word32 a4_1305;
		word32 a7_1306;
		word32 a3_1304;
		word32 a1_1302;
		word32 a2_1303;
		mbedtls_debug_print_msg(ra, *((word32) a5_113 + 116), 0x02, &g_t230890E4, a5_113, out a1_1302, out a2_1303, out a3_1304, out a4_1305, out a5_113, out a7_1306, out s4_1307, out s5_1308, out s6_1309, out s7_1310, out s8_1311, out s9_1312, out s10_1313, out s11_1314, out t4_1315);
		s0_108 = *((word32) a5_113 + 116);
		if (a5_113 >= a1)
		{
l2305B72E:
			word32 s8_1300;
			word32 t4_1301;
			word32 a4_1296;
			word32 a5_1297;
			word32 s4_1299;
			word32 a7_1298;
			word32 a1_1293;
			word32 a3_1295;
			word32 a2_1294;
			mbedtls_debug_print_msg(ra, s0_108, 0x02, &g_t23089100, a5_113, out a1_1293, out a2_1294, out a3_1295, out a4_1296, out a5_1297, out a7_1298, out s4_1299, out s5_1146, out s6_1149, out s7_1152, out s8_1300, out s9_1155, out s10_1125, out s11_1128, out t4_1301);
			s1_135.u0 = 0x00;
			goto l2305B63A;
		}
		if (a5_113 != 0x00)
		{
l2305B6BA:
			word32 a2_1334;
			word32 s4_1339;
			word32 t4_1341;
			word32 s8_1340;
			word32 a7_1338;
			word32 a3_1335;
			word32 a5_1337;
			word32 a4_1336;
			word32 a1_1333;
			mbedtls_debug_print_msg(ra, s0_108, 0x01, &g_t23088F14, a5_113, out a1_1333, out a2_1334, out a3_1335, out a4_1336, out a5_1337, out a7_1338, out s4_1339, out s5_1146, out s6_1149, out s7_1152, out s8_1340, out s9_1155, out s10_1125, out s11_1128, out t4_1341);
			s1_135.u0 = 0xF9000400;
			goto l2305B63A;
		}
		word32 a0_339;
		word32 a4_343;
		word32 s6_1331;
		word32 s7_1332;
		ra = ssl_check_timer(ra, s0_108, a5_113, out a0_339, out a4_343, out a5_113, out s6_1331, out s7_1332);
		if (a0_339 != 0x00)
		{
l2305B756:
			word32 a1_1342;
			word32 a2_1343;
			word32 a3_1344;
			word32 s5_1348;
			word32 s6_1349;
			word32 a7_1346;
			word32 s4_1347;
			word32 s9_1352;
			word32 a4_1345;
			word32 s7_1350;
			word32 s8_1351;
			word32 t4_1355;
			word32 s11_1354;
			word32 s10_1353;
			Eq_2 a5_503;
			mbedtls_debug_print_msg(ra, s0_108, 0x02, &g_t23089110, a5_113, out a1_1342, out a2_1343, out a3_1344, out a4_1345, out a5_503, out a7_1346, out s4_1347, out s5_1348, out s6_1349, out s7_1350, out s8_1351, out s9_1352, out s10_1353, out s11_1354, out t4_1355);
			word32 s0_1356;
			word32 a1_1358;
			word32 s4_1360;
			word32 a5_1359;
			Eq_2 a3_534;
			word32 a4_535;
			word32 s1_1357;
			ra = ssl_set_timer(ra, s0_108, 0x00, a5_503, s2, s0, out s0_1356, out s1_1357, out a1_1358, out a3_534, out a4_535, out a5_1359, out s4_1360, out s5_1146, out s6_1149, out s7_1152, out s9_1155, out s10_1125, out s11_1128);
			if (a4_535 == 0x10)
			{
l2305B780:
				s1_135.u0 = ~0x060007FF;
				goto l2305B63A;
			}
			Eq_2 s0_557 = *(union Eq_2 *) 0x10;
			Eq_2 a2_558 = *((word32) a3_534 + 48);
			Eq_2 a5_559 = *(union Eq_2 *) 0x7C;
			if (a3_534 >= a5_559)
			{
				word32 a1_1361;
				word32 a5_1365;
				word32 s8_1368;
				word32 a3_1363;
				word32 a2_1362;
				word32 a7_1366;
				word32 s4_1367;
				word32 a4_1364;
				word32 t4_1369;
				mbedtls_debug_print_msg(ra, s0_557, 0x01, &g_t2307C948, a5_559, out a1_1361, out a2_1362, out a3_1363, out a4_1364, out a5_1365, out a7_1366, out s4_1367, out s5_1146, out s6_1149, out s7_1152, out s8_1368, out s9_1155, out s10_1125, out s11_1128, out t4_1369);
				goto l2305B780;
			}
			if (a3_534 << 0x01 >= a3_534 && a3_534 << 0x01 < a5_559)
				a5_559 = a3_534 << 0x01;
			*((word32) a5_559 + 48) = a2_558;
			Eq_2 s0_565 = *((word32) a5_559 + 48);
			word32 a2_1371;
			word32 a1_1370;
			word32 a7_1374;
			Eq_2 a5_576;
			word32 s7_1378;
			word32 s8_1379;
			word32 s4_1375;
			word32 a4_1373;
			word32 a3_1372;
			word32 s10_1381;
			word32 s11_1382;
			word32 s6_1377;
			word32 s9_1380;
			word32 s5_1376;
			word32 t4_1383;
			mbedtls_debug_print_msg(ra, s0_565, 0x03, &g_t23089DAC, *((word32) a5_559 + 48), out a1_1370, out a2_1371, out a3_1372, out a4_1373, out a5_576, out a7_1374, out s4_1375, out s5_1376, out s6_1377, out s7_1378, out s8_1379, out s9_1380, out s10_1381, out s11_1382, out t4_1383);
			Eq_2 a0_633;
			word32 s0_1384;
			word32 s1_1385;
			word32 a2_1387;
			word32 a1_1386;
			word32 a3_1388;
			word32 a5_1390;
			word32 s4_1391;
			word32 a4_1389;
			ra = mbedtls_ssl_resend(ra, s0_565, s0_565, a5_576, 0x2308A000, mstatus, dwArgF8, out s0_1384, out s1_1385, out a0_633, out a1_1386, out a2_1387, out a3_1388, out a4_1389, out a5_1390, out s2_1131, out s3_1135, out s4_1391, out s5_1146, out s6_1149, out s7_1152, out s9_1155, out s10_1125, out s11_1128, out mstatus);
			s1_135 = a0_633;
			if (a0_633 != 0x00)
			{
				word32 a2_1393;
				word32 a3_1394;
				word32 a1_1392;
				word32 a4_1395;
				word32 a5_1396;
				word32 s4_1397;
				word32 s8_1398;
				mbedtls_debug_print_ret(ra, 0x01, 0x00FFF93A, a0_633, out a1_1392, out a2_1393, out a3_1394, out a4_1395, out a5_1396, out s4_1397, out s5_1146, out s6_1149, out s7_1152, out s8_1398, out s9_1155, out s10_1125, out s11_1128);
			}
			else
				s1_135.u0 = 0xF9000700;
l2305B63A:
			0x00 = (uint16) dwArg0128;
			s0Out = s4;
			a0Out = s1_135;
			s2Out = s2_1131;
			s3Out = s3_1135;
			s4Out = dwArg78;
			s5Out = s5_1146;
			s6Out = s6_1149;
			s7Out = s7_1152;
			s8Out = s5;
			s9Out = s9_1155;
			s10Out = s10_1125;
			s11Out = s11_1128;
			mstatusOut = mstatus;
			return ra;
		}
		Eq_2 s0_367;
		if (a4_343 != 0x10)
		{
			s0_367 = *(union Eq_2 *) 0x40;
			s3_1135 = *(union Eq_2 *) 0x40;
		}
		else
		{
			s0_367 = *(union Eq_2 *) 0x10;
			s3_1135 = *(union Eq_2 *) 116;
		}
		Eq_2 a0_409;
		struct Eq_302374 * a5_384;
		word32 a1_385;
		word32 a4_388;
		word32 a2_1406;
		word32 a3_1407;
		word32 a7_1408;
		word32 s4_1409;
		word32 s5_1410;
		word32 s6_1411;
		word32 s7_1412;
		word32 s8_1413;
		word32 s9_1414;
		word32 s10_1415;
		word32 s11_1416;
		word32 t4_1417;
		Eq_2 a0_383 = mbedtls_debug_print_msg(ra, s0_367, 0x03, &g_t23089118, s3_1135, out a1_385, out a2_1406, out a3_1407, out a4_388, out a5_384, out a7_1408, out s4_1409, out s5_1410, out s6_1411, out s7_1412, out s8_1413, out s9_1414, out s10_1415, out s11_1416, out t4_1417);
		s0_108 = *((word32) a0_383 + 28);
		if (a5_384 != null)
			a5_384();
		else
		{
			a5_384();
			s0_108 = a5_384->t0014;
		}
		word32 a1_1399;
		word32 a2_1400;
		word32 a3_1401;
		word32 a4_1402;
		word32 a5_1403;
		word32 s4_1404;
		word32 s8_1405;
		mbedtls_debug_print_ret(ra, 0x02, 0x00FFF925, a0_409, out a1_1399, out a2_1400, out a3_1401, out a4_1402, out a5_1403, out s4_1404, out s5_1146, out s6_1149, out s7_1152, out s8_1405, out s9_1155, out s10_1125, out s11_1128);
		s1_135 = a0_409;
		if (a0_409 == 0x00)
		{
l2305B7F0:
			s1_135.u0 = ~0x0700027F;
			goto l2305B63A;
		}
		a5_113.u0 = ~0x060007FF;
		if (a0_409 == ~0x060007FF)
			goto l2305B756;
		if (a0_409 < 0x00)
			goto l2305B63A;
		*((word32) a0_409 + 116) = s0_108;
	}
	else
	{
		s0_108 = (a5_71 & 0x02)->t0074;
		word32 s9_1269;
		word32 a3_1261;
		word32 a4_1262;
		word32 a2_1260;
		word32 a1_1259;
		word32 s6_1266;
		word32 s7_1267;
		word32 s5_1265;
		word32 a7_1263;
		word32 s4_1264;
		word32 s10_1270;
		word32 t4_1272;
		word32 s8_1268;
		word32 s11_1271;
		mbedtls_debug_print_msg(ra, s0_108, 0x02, &g_t230890E4, a5_71 & 0x02, out a1_1259, out a2_1260, out a3_1261, out a4_1262, out a5_113, out a7_1263, out s4_1264, out s5_1265, out s6_1266, out s7_1267, out s8_1268, out s9_1269, out s10_1270, out s11_1271, out t4_1272);
		while (*((word32) s0_108 + 116) < a1)
		{
			word32 a0_115;
			word32 a4_119;
			Eq_2 s7_128;
			Eq_2 a5_120;
			word32 s6_127;
			ra = ssl_check_timer(ra, s0_108, a5_113, out a0_115, out a4_119, out a5_120, out s6_127, out s7_128);
			s1_135 = s7_128;
			if (a0_115 == 0x00)
			{
				Eq_2 a0_143;
				if (a5_120 != 0x00)
					a5_120();
				else
					a5_120();
				s1_135 = a0_143;
			}
			Eq_2 s5_219;
			word32 a2_1274;
			word32 a1_1273;
			word32 s8_1282;
			word32 a5_1277;
			word32 a4_1276;
			word32 a3_1275;
			word32 s6_1280;
			word32 s4_1279;
			word32 a7_1278;
			word32 s7_1281;
			word32 s9_1283;
			word32 s11_1285;
			word32 s10_1284;
			word32 t4_1286;
			mbedtls_debug_print_msg(ra, *((word32) a5_120 + 116), 0x02, s6_127 + 228, a5_120, out a1_1273, out a2_1274, out a3_1275, out a4_1276, out a5_1277, out a7_1278, out s4_1279, out s5_219, out s6_1280, out s7_1281, out s8_1282, out s9_1283, out s10_1284, out s11_1285, out t4_1286);
			word32 a4_1290;
			word32 a2_1288;
			word32 a1_1287;
			word32 s8_1292;
			word32 a3_1289;
			word32 s4_1291;
			mbedtls_debug_print_ret(ra, 0x02, s5_219, s1_135, out a1_1287, out a2_1288, out a3_1289, out a4_1290, out a5_113, out s4_1291, out s5_1146, out s6_1149, out s7_1152, out s8_1292, out s9_1155, out s10_1125, out s11_1128);
			if (s1_135 == 0x00)
				goto l2305B7F0;
			if (s1_135 < 0x00)
				goto l2305B63A;
			s0_108 = *((word32) a5_113 + 116);
			Mem257[s1_135 + a5_113 + 116:word32] = s0_108;
		}
	}
	goto l2305B72E;
}

