pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305BF74: Register Eq_2 mbedtls_ssl_send_alert_message(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_ssl_send_fatal_handshake_failure
//      mbedtls_ssl_close_notify
//      mbedtls_ssl_read_record_layer
//      mbedtls_ssl_handshake_server_step
Eq_2 mbedtls_ssl_send_alert_message(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a5, ptr32 mstatus, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & mstatusOut)
{
	Eq_2 s1_151;
	if (a0 != 0x00)
	{
		Eq_2 a0_18 = *a5;
		if (a5 != 0x00)
		{
			word32 s4_42;
			word32 a7_257;
			word32 s5_258;
			word32 s6_259;
			word32 s7_260;
			word32 s8_261;
			word32 a5_256;
			word32 a4_255;
			word32 a3_254;
			word32 a2_253;
			word32 a1_252;
			word32 s9_262;
			word32 s10_263;
			word32 s11_264;
			word32 t4_265;
			mbedtls_debug_print_msg(ra, a0_18, 0x02, &g_t23089D7C, a5, out a1_252, out a2_253, out a3_254, out a4_255, out a5_256, out a7_257, out s4_42, out s5_258, out s6_259, out s7_260, out s8_261, out s9_262, out s10_263, out s11_264, out t4_265);
			((word32) a0_18 + 0x00A4)->u0 = 0x15;
			((word32) a0_18 + 0x00A8)->u0 = 0x02;
			(*((word32) a0_18 + 0x00A0))->u1 = (byte) s4_42;
			Eq_2 a5_59 = *((word32) a0_18 + 0x00A0);
			((word32) a5_59 + 1)->u1 = (byte) a2;
			Eq_2 a5_66;
			Eq_2 s0_70;
			Eq_2 a0_87;
			word32 s1_266;
			word32 a1_267;
			word32 a2_268;
			word32 a3_269;
			word32 a4_270;
			word32 s4_271;
			word32 s5_272;
			word32 s11_273;
			ra = mbedtls_ssl_write_record(ra, a2, a0_18, a5_59, mstatus, out s0_70, out s1_266, out a0_87, out a1_267, out a2_268, out a3_269, out a4_270, out a5_66, out s2, out s3, out s4_271, out s5_272, out s11_273, out mstatus);
			s1_151 = a0_87;
			if (a0_87 != 0x00)
			{
				word32 a1_284;
				word32 a2_285;
				word32 a3_286;
				word32 s4_287;
				word32 s6_288;
				word32 s7_289;
				word32 s8_290;
				word32 s11_291;
				mbedtls_debug_print_ret(ra, 0x01, s3 + -29, a0_87, out a1_284, out a2_285, out a3_286, out a4, out a5, out s4_287, out s5, out s6_288, out s7_289, out s8_290, out s9, out s10, out s11_291);
			}
			else
			{
				word32 a1_274;
				word32 a2_275;
				word32 a3_276;
				word32 a7_277;
				word32 s4_278;
				word32 s6_279;
				word32 s7_280;
				word32 s8_281;
				word32 s11_282;
				word32 t4_283;
				mbedtls_debug_print_msg(ra, s0_70, 0x02, &g_t23089D94, a5_66, out a1_274, out a2_275, out a3_276, out a4, out a5, out a7_277, out s4_278, out s5, out s6_279, out s7_280, out s8_281, out s9, out s10, out s11_282, out t4_283);
			}
l2305BFEA:
			s0Out = s1;
			s1Out = s1_151;
			a0Out = s1_151;
			a4Out = a4;
			a5Out = a5;
			s2Out = s2;
			s3Out = s3;
			s5Out = s5;
			s8Out = s4;
			s9Out = s9;
			s10Out = s10;
			mstatusOut = mstatus;
			return ra;
		}
	}
	s1_151.u0 = ~0x070000FF;
	goto l2305BFEA;
}

// 2305C01E: Register word32 mbedtls_ssl_send_fatal_handshake_failure(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a5, Register ptr32 mstatus, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_ssl_handshake_server_step
word32 mbedtls_ssl_send_fatal_handshake_failure(Eq_2 ra, Eq_2 a0, Eq_2 a5, ptr32 mstatus, ptr32 & a0Out, ptr32 & a4Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	ptr32 a0_9;
	word32 s0_12;
	ptr32 a4_19;
	ptr32 mstatus_22;
	ptr32 s5_28;
	word32 s1_43;
	word32 a5_44;
	word32 s2_45;
	word32 s3_46;
	word32 s8_47;
	word32 s9_48;
	word32 s10_49;
	mbedtls_ssl_send_alert_message(ra, a0, 40, a5, mstatus, out s0_12, out s1_43, out a0_9, out a4_19, out a5_44, out s2_45, out s3_46, out s5_28, out s8_47, out s9_48, out s10_49, out mstatus_22);
	a0Out = a0_9;
	a4Out = a4_19;
	s5Out = s5_28;
	mstatusOut = mstatus_22;
	return s0_12;
}

// 2305C028: Register Eq_2 mbedtls_ssl_close_notify(Register Eq_2 ra, Register word32 a0, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0128, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      iot_tls_disconnect
Eq_2 mbedtls_ssl_close_notify(Eq_2 ra, word32 a0, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0128, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a5Out, ptr32 & mstatusOut)
{
	Eq_2 s1_19;
	Eq_2 s0_117;
	s1_19 = s1;
	if (a0 != 0x00)
	{
		Eq_2 a0_18 = *a5;
		s1_19 = a0_18;
		if (a5 != 0x00)
		{
			struct Eq_304266 * a4_34;
			word32 t4_341;
			word32 s11_340;
			word32 s10_339;
			word32 s9_338;
			word32 s8_337;
			word32 s7_336;
			word32 s6_335;
			word32 s5_334;
			word32 s4_333;
			word32 a7_332;
			word32 a5_331;
			word32 a3_330;
			word32 a2_329;
			word32 a1_328;
			mbedtls_debug_print_msg(ra, a0_18, 0x02, (char *) &g_t23088E48 + 40, a5, out a1_328, out a2_329, out a3_330, out a4_34, out a5_331, out a7_332, out s4_333, out s5_334, out s6_335, out s7_336, out s8_337, out s9_338, out s10_339, out s11_340, out t4_341);
			Eq_2 a5_48 = *((word32) a0_18 + 0x00AC);
			if (a5_48 != 0x00)
			{
				Eq_2 a0_168;
				Eq_2 a5_173;
				Eq_2 s1_177;
				word32 a1_342;
				word32 a2_343;
				word32 a3_344;
				word32 a4_345;
				word32 s2_346;
				word32 s3_347;
				word32 s4_348;
				word32 s5_349;
				word32 s6_350;
				word32 s7_351;
				word32 s9_352;
				word32 s10_353;
				word32 s11_354;
				s0Out = mbedtls_ssl_flush_output(ra, a0_18, a5_48, dwArg0128, out s1_177, out a0_168, out a1_342, out a2_343, out a3_344, out a4_345, out a5_173, out s2_346, out s3_347, out s4_348, out s5_349, out s6_350, out s7_351, out s9_352, out s10_353, out s11_354);
				s1Out = s1_177;
				a0Out = a0_168;
				a5Out = a5_173;
				mstatusOut = mstatus;
				return ra;
			}
			s1_19 = a4_34->t0004;
			Eq_2 a5_51 = 0x10;
			if (a4_34 == (struct Eq_304266 *) 0x10)
			{
				Eq_2 a0_56;
				word32 s3_74;
				word32 s0_369;
				word32 a4_370;
				word32 s2_371;
				word32 s5_372;
				word32 s8_373;
				word32 s9_374;
				word32 s10_375;
				ra = mbedtls_ssl_send_alert_message(ra, s1_19, 0x00, 0x10, mstatus, out s0_369, out s1_19, out a0_56, out a4_370, out a5_51, out s2_371, out s3_74, out s5_372, out s8_373, out s9_374, out s10_375, out mstatus);
				s0_117 = a0_56;
				if (a0_56 != 0x00)
				{
					word32 a1_376;
					word32 a2_377;
					word32 a3_378;
					word32 a4_379;
					word32 s4_380;
					word32 s5_381;
					word32 s6_382;
					word32 s7_383;
					word32 s8_384;
					word32 s9_385;
					word32 s10_386;
					word32 s11_387;
					mbedtls_debug_print_ret(ra, 0x01, s3_74 + -1165, a0_56, out a1_376, out a2_377, out a3_378, out a4_379, out a5, out s4_380, out s5_381, out s6_382, out s7_383, out s8_384, out s9_385, out s10_386, out s11_387);
l2305C0A6:
					s0Out = s1;
					s1Out = s1_19;
					a0Out = s0_117;
					a5Out = a5;
					mstatusOut = mstatus;
					return ra;
				}
			}
			word32 a1_355;
			word32 a2_356;
			word32 a3_357;
			word32 a4_358;
			word32 a7_359;
			word32 s4_360;
			word32 s5_361;
			word32 s6_362;
			word32 s7_363;
			word32 s8_364;
			word32 s9_365;
			word32 s10_366;
			word32 s11_367;
			word32 t4_368;
			mbedtls_debug_print_msg(ra, s1_19, 0x02, (char *) &g_t23088E48 + 96, a5_51, out a1_355, out a2_356, out a3_357, out a4_358, out a5, out a7_359, out s4_360, out s5_361, out s6_362, out s7_363, out s8_364, out s9_365, out s10_366, out s11_367, out t4_368);
			s0_117.u0 = 0x00;
			goto l2305C0A6;
		}
	}
	s0_117.u0 = ~0x070000FF;
	goto l2305C0A6;
}

