pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305C0DE: void mbedtls_ssl_write_certificate(Register Eq_2 ra, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArgB4, Stack word32 dwArg0128)
void mbedtls_ssl_write_certificate(Eq_2 ra, Eq_2 a5, ptr32 mstatus, Eq_2 dwArgB4, word32 dwArg0128)
{
	Eq_2 a0_15 = *((word32) a5 + 64);
	struct Eq_304447 * s2_18 = *a5;
	word32 a7_468;
	word32 s4_469;
	word32 a5_467;
	word32 a3_465;
	word32 a4_466;
	word32 a2_464;
	word32 a1_463;
	word32 s5_470;
	word32 s6_471;
	word32 s7_472;
	word32 s8_473;
	word32 s9_474;
	word32 s10_475;
	word32 s11_476;
	word32 t4_477;
	mbedtls_debug_print_msg(ra, a0_15, 0x02, &g_t23089EA0, a5, out a1_463, out a2_464, out a3_465, out a4_466, out a5_467, out a7_468, out s4_469, out s5_470, out s6_471, out s7_472, out s8_473, out s9_474, out s10_475, out s11_476, out t4_477);
	struct Eq_304485 * a5_48 = (word32) s2_18->b000A + ~0x04 & 0x00FF;
	if (a5_48 <= (struct Eq_304485 *) 0x06)
	{
		uint32 a5_50 = 75 >> a5_48;
		a5_48 = a5_50 & 0x01;
		if ((a5_50 & 0x01) != 0x00)
		{
			struct Eq_304519 * a5_357;
			word32 a1_478;
			word32 a2_479;
			word32 a3_480;
			word32 a4_481;
			word32 a7_482;
			word32 s4_483;
			word32 s5_484;
			word32 s6_485;
			word32 s7_486;
			word32 s8_487;
			word32 s9_488;
			word32 s10_489;
			word32 s11_490;
			word32 t4_491;
			mbedtls_debug_print_msg(ra, a0_15, 0x02, &g_t23089EB8, a5_50 & 0x01, out a1_478, out a2_479, out a3_480, out a4_481, out a5_357, out a7_482, out s4_483, out s5_484, out s6_485, out s7_486, out s8_487, out s9_488, out s10_489, out s11_490, out t4_491);
			a5_357->dw0005 = a5_357->dw0004;
			goto l2305C14C;
		}
	}
	ui32 a5_55 = (word32) a5_48->w0074;
	Eq_2 s0_54 = a5_48->t0000;
	Eq_2 a5_56 = a5_55 & 0x01;
	if ((a5_55 & 0x01) == 0x00)
	{
		if (*((word32) s0_54 + 0x00B0) == 0x00)
		{
			struct Eq_304632 * a5_329;
			word32 a1_504;
			word32 a2_505;
			word32 a3_506;
			word32 a4_507;
			word32 a7_508;
			word32 s4_509;
			word32 s5_510;
			word32 s6_511;
			word32 s7_512;
			word32 s8_513;
			word32 s9_514;
			word32 s10_515;
			word32 s11_516;
			word32 t4_517;
			mbedtls_debug_print_msg(ra, s0_54, 0x02, &g_t23089EB8, a5_55 & 0x01, out a1_504, out a2_505, out a3_506, out a4_507, out a5_329, out a7_508, out s4_509, out s5_510, out s6_511, out s7_512, out s8_513, out s9_514, out s10_515, out s11_516, out t4_517);
			a5_329->dw0005 = a5_329->dw0004;
			goto l2305C14C;
		}
	}
	else if (mbedtls_ssl_own_cert(a5_55 & 0x01, out a5_56) == 0x00)
	{
		word32 a1_557;
		word32 a2_558;
		word32 a3_559;
		word32 a4_560;
		word32 a5_561;
		word32 a7_562;
		word32 s4_563;
		word32 s5_564;
		word32 s6_565;
		word32 s7_566;
		word32 s8_567;
		word32 s9_568;
		word32 s10_569;
		word32 s11_570;
		word32 t4_571;
		mbedtls_debug_print_msg(ra, s0_54, 0x01, &g_t23089ED4, a5_56, out a1_557, out a2_558, out a3_559, out a4_560, out a5_561, out a7_562, out s4_563, out s5_564, out s6_565, out s7_566, out s8_567, out s9_568, out s10_569, out s11_570, out t4_571);
		goto l2305C14C;
	}
	Eq_2 a5_116;
	Eq_2 s0_122;
	word32 a5_492;
	word32 s1_493;
	word32 a0_494;
	word32 a1_495;
	word32 a3_496;
	word32 s3_497;
	word32 s4_498;
	word32 s7_499;
	word32 s9_500;
	word32 s10_501;
	word32 s11_502;
	Eq_2 a2_119;
	Eq_2 ra_109 = mbedtls_debug_print_crt(ra, 0x03, 587767536, mbedtls_ssl_own_cert(a5_56, out a5_492), out s0_122, out s1_493, out a0_494, out a1_495, out a2_119, out a3_496, out a5_116, out s3_497, out s4_498, out s7_499, out s9_500, out s10_501, out s11_502);
	word32 a5_503;
	Eq_2 s1_137 = mbedtls_ssl_own_cert(a5_116, out a5_503);
	Eq_2 a4_138 = 0x07;
	while (s1_137 != 0x00)
	{
		word32 a0_145 = (word32) a4_138 + 3;
		Eq_2 a5_148 = (word32) a2_119 + a0_145;
		if (0x03FFFFFD - a4_138 < a2_119)
		{
			word32 a1_578;
			word32 a2_579;
			word32 a3_580;
			word32 a4_581;
			word32 a5_582;
			word32 a7_583;
			word32 s4_584;
			word32 s5_585;
			word32 s6_586;
			word32 s7_587;
			word32 s8_588;
			word32 s9_589;
			word32 s10_590;
			word32 s11_591;
			word32 t4_592;
			mbedtls_debug_print_msg(ra_109, s0_122, 0x01, &g_t23089F00, a5_148, out a1_578, out a2_579, out a3_580, out a4_581, out a5_582, out a7_583, out s4_584, out s5_585, out s6_586, out s7_587, out s8_588, out s9_589, out s10_590, out s11_591, out t4_592);
			goto l2305C14C;
		}
		Mem155[Mem142[s0_122 + 0x00A0:int32] + a4_138:byte] = SLICE(a2_119 >>u 0x10, byte, 0);
		Eq_2 a1_157 = a2_119 >> 0x08;
		Mem159[Mem155[s0_122 + 0x00A0:int32] + a4_138 + 1:byte] = SLICE(a1_157, byte, 0);
		Mem162[a4_138 + Mem159[s0_122 + 0x00A0:int32] + 2:byte] = SLICE(a2_119, byte, 0);
		struct Eq_304891 * s1_164 = *((word32) a1_157 + 8);
		Eq_2 a5_167;
		word32 a1_572;
		word32 a2_573;
		word32 a3_574;
		word32 a4_575;
		word32 a6_576;
		word32 a7_577;
		memcpy((word32) *((word32) s0_122 + 0x00A0) + a0_145, a1_157, a2_119, out a1_572, out a2_573, out a3_574, out a4_575, out a5_167, out a6_576, out a7_577);
		a2_119 = dwArgB4;
		s1_137 = s1_164->t0130;
		a4_138 = a5_167;
	}
	uint32 a5_214 = (word32) a4_138 - 7;
	*((word32) *((word32) s0_122 + 0x00A0) + 4) = (byte) (a5_214 >> 0x10);
	*((word32) *((word32) s0_122 + 0x00A0) + 5) = (byte) (a5_214 >> 0x08);
	((word32) *((word32) s0_122 + 0x00A0) + 6)->u1 = (byte) a5_214;
	((word32) s0_122 + 0x00A4)->u0 = 22;
	struct Eq_304690 * a5_225 = *((word32) s0_122 + 0x00A0);
	*((word32) s0_122 + 0x00A8) = a4_138;
	a5_225->b0000 = 11;
	a5_225->t0005 = a5_225->t0004;
	Eq_2 a5_240;
	Eq_2 s0_244;
	Eq_2 a0_261;
	word32 s1_518;
	word32 a1_519;
	word32 a2_520;
	word32 a3_521;
	word32 a4_522;
	word32 s2_523;
	word32 s3_524;
	word32 s4_525;
	word32 s5_526;
	word32 s11_527;
	word32 mstatus_528;
	Eq_2 ra_243 = mbedtls_ssl_write_record(ra_109, s1_137, s0_122, &a5_225->b0000 + 1, mstatus, out s0_244, out s1_518, out a0_261, out a1_519, out a2_520, out a3_521, out a4_522, out a5_240, out s2_523, out s3_524, out s4_525, out s5_526, out s11_527, out mstatus_528);
	if (a0_261 != 0x00)
	{
		word32 a1_544;
		word32 a2_545;
		word32 a3_546;
		word32 a4_547;
		word32 a5_548;
		word32 s4_549;
		word32 s5_550;
		word32 s6_551;
		word32 s7_552;
		word32 s8_553;
		word32 s9_554;
		word32 s10_555;
		word32 s11_556;
		mbedtls_debug_print_ret(ra_243, 0x01, 0x01000089, a0_261, out a1_544, out a2_545, out a3_546, out a4_547, out a5_548, out s4_549, out s5_550, out s6_551, out s7_552, out s8_553, out s9_554, out s10_555, out s11_556);
	}
	else
	{
		word32 a1_529;
		word32 a2_530;
		word32 a3_531;
		word32 a4_532;
		word32 a5_533;
		word32 a7_534;
		word32 s4_535;
		word32 s5_536;
		word32 s6_537;
		word32 s7_538;
		word32 s8_539;
		word32 s9_540;
		word32 s10_541;
		word32 s11_542;
		word32 t4_543;
		mbedtls_debug_print_msg(ra_243, s0_244, 0x02, &g_t23089F20, a5_240, out a1_529, out a2_530, out a3_531, out a4_532, out a5_533, out a7_534, out s4_535, out s5_536, out s6_537, out s7_538, out s8_539, out s9_540, out s10_541, out s11_542, out t4_543);
	}
l2305C14C:
	0x00 = dwArg0128;
}

// 2305C2E0: void mbedtls_ssl_write_change_cipher_spec(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a5, Register ptr32 mstatus)
void mbedtls_ssl_write_change_cipher_spec(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a5, ptr32 mstatus)
{
	word32 s6_193;
	word32 s5_192;
	word32 s4_191;
	word32 a7_190;
	word32 a5_189;
	word32 a4_188;
	word32 a3_187;
	word32 a2_186;
	word32 a1_185;
	word32 s7_194;
	word32 s8_195;
	word32 s9_196;
	word32 s10_197;
	word32 s11_198;
	word32 t4_199;
	mbedtls_debug_print_msg(ra, a0, 0x02, &g_t23089F38, a5, out a1_185, out a2_186, out a3_187, out a4_188, out a5_189, out a7_190, out s4_191, out s5_192, out s6_193, out s7_194, out s8_195, out s9_196, out s10_197, out s11_198, out t4_199);
	byte * a4_44 = *((word32) a0 + 0x00A0);
	((word32) a0 + 0x00A4)->u0 = 0x14;
	((word32) a0 + 0x00A8)->u0 = 0x01;
	*a4_44 = 0x01;
	Eq_2 s0_49 = *(union Eq_2 *) 0x05;
	*(union Eq_2 *) 0x06 = s0_49;
	Eq_2 a5_58;
	Eq_2 s0_62;
	word32 s3_67;
	Eq_2 a0_79;
	word32 s1_200;
	word32 a1_201;
	word32 a2_202;
	word32 a3_203;
	word32 a4_204;
	word32 s2_205;
	word32 s4_206;
	word32 s5_207;
	word32 s11_208;
	word32 mstatus_209;
	Eq_2 ra_61 = mbedtls_ssl_write_record(ra, s1, s0_49, 0x02, mstatus, out s0_62, out s1_200, out a0_79, out a1_201, out a2_202, out a3_203, out a4_204, out a5_58, out s2_205, out s3_67, out s4_206, out s5_207, out s11_208, out mstatus_209);
	if (a0_79 != 0x00)
	{
		word32 a1_225;
		word32 a2_226;
		word32 a3_227;
		word32 a4_228;
		word32 a5_229;
		word32 s4_230;
		word32 s5_231;
		word32 s6_232;
		word32 s7_233;
		word32 s8_234;
		word32 s9_235;
		word32 s10_236;
		word32 s11_237;
		mbedtls_debug_print_ret(ra_61, 0x01, s3_67 + 446, a0_79, out a1_225, out a2_226, out a3_227, out a4_228, out a5_229, out s4_230, out s5_231, out s6_232, out s7_233, out s8_234, out s9_235, out s10_236, out s11_237);
	}
	else
	{
		word32 a1_210;
		word32 a2_211;
		word32 a3_212;
		word32 a4_213;
		word32 a5_214;
		word32 a7_215;
		word32 s4_216;
		word32 s5_217;
		word32 s6_218;
		word32 s7_219;
		word32 s8_220;
		word32 s9_221;
		word32 s10_222;
		word32 s11_223;
		word32 t4_224;
		mbedtls_debug_print_msg(ra_61, s0_62, 0x02, &g_t23089F54, a5_58, out a1_210, out a2_211, out a3_212, out a4_213, out a5_214, out a7_215, out s4_216, out s5_217, out s6_218, out s7_219, out s8_220, out s9_221, out s10_222, out s11_223, out t4_224);
	}
}

// 2305C372: void mbedtls_ssl_write_finished(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack word32 dwArg38)
void mbedtls_ssl_write_finished(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a5, Eq_2 s2, ptr32 mstatus, word32 dwArg38)
{
	struct Eq_305120 * a2_25;
	struct Eq_305121 * a4_27;
	word32 s8_481;
	word32 s11_484;
	word32 t4_485;
	word32 s9_482;
	word32 s10_483;
	word32 a1_473;
	word32 a7_476;
	word32 s4_477;
	word32 s5_478;
	word32 s6_479;
	word32 s7_480;
	word32 a3_474;
	word32 a5_475;
	mbedtls_debug_print_msg(ra, a0, 0x02, &g_t23089F70, a5, out a1_473, out a2_25, out a3_474, out a4_27, out a5_475, out a7_476, out s4_477, out s5_478, out s6_479, out s7_480, out s8_481, out s9_482, out s10_483, out s11_484, out t4_485);
	struct Eq_305165 ** a5_42 = (struct Eq_305165 **) 0x01;
	int32 a1_43 = a4_27->ptr000C->dw009C;
	if (a4_27 > (struct Eq_305121 *) 0x01)
	{
		a5_42 = 0x01 - *((word32) (*((union Eq_2 *) 0x0D)) + 16);
		a1_43 = (char *) a5_42 + a1_43;
	}
	struct Eq_305165 * s0_51 = *a5_42;
	s0_51->dw00A0 = a1_43;
	struct Eq_305172 * a5_56 = a2_25->ptr0074;
	<anonymous> * a5_60 = a5_56->ptr00CC;
	struct Eq_305180 * a4_67;
	Eq_2 ra_72;
	Eq_2 s1_238;
	a5_60();
	struct Eq_305183 * s0_90 = a4_67->ptr000C;
	int32 a5_91 = 36;
	if (a4_67 != null)
		a5_91 = 0x0C;
	Eq_2 a5_105;
	Eq_2 s0_104;
	s0_90->dw00A8 = a5_91 + 0x04;
	s0_90->dw00A4 = 22;
	struct Eq_305210 * a5_99 = s0_90->ptr00A0;
	a5_99->b0000 = 0x14;
	struct Eq_305218 * a5_103 = a5_99->ptr0148;
	if (a5_103 != null)
	{
		s0_104 = *(union Eq_2 *) 0x14;
		if (((word32) *(uint16 *) 0x88 & 0x01) == 0x00)
		{
			*(union Eq_2 *) 0x13 = s0_104;
			ui32 a5_111 = (word32) *(uint16 *) 0x88;
			a5_105 = a5_111 & 0x01;
			if ((a5_111 & 0x01) == 0x00)
				goto l2305C40A;
		}
		a5_105.u0 = 0x0A;
	}
	else
	{
		s0_104 = a5_103->t0004;
		a5_105 = (char *) a5_103 + 1;
	}
	*((word16) a5_105.u0 + 4) = s0_104;
l2305C40A:
	Eq_2 ra_167;
	Eq_2 a4_165;
	Eq_2 a5_166;
	struct Eq_305254 * a5_136;
	struct Eq_305255 * a4_140;
	word32 s5_491;
	word32 s8_494;
	word32 s9_495;
	word32 s10_496;
	word32 s11_497;
	word32 t4_498;
	word32 s6_492;
	word32 s7_493;
	word32 a7_489;
	word32 s4_490;
	word32 a1_486;
	word32 a2_487;
	word32 a3_488;
	Eq_2 a0_135 = mbedtls_debug_print_msg(ra_72, s0_104, 0x03, &g_t23089F84, a5_105, out a1_486, out a2_487, out a3_488, out a4_140, out a5_136, out a7_489, out s4_490, out s5_491, out s6_492, out s7_493, out s8_494, out s9_495, out s10_496, out s11_497, out t4_498);
	struct Eq_305289 * s0_155 = a5_136->ptr0000;
	ui32 a5_156 = (word32) a5_136->w0074;
	if ((a5_156 & 0x02) != 0x00)
	{
		a4_140->dw0044 = a5_156 & 0x02;
		Eq_2 s0_174 = *((word32) a0_135 + 48);
		word32 a5_508;
		word32 a6_509;
		word32 a7_510;
		word32 a2_505;
		word32 a3_506;
		word32 a4_507;
		word32 a1_504;
		memcpy((word32) a0_135 + 72, *((word32) s0_174 + 144), 0x08, out a1_504, out a2_505, out a3_506, out a4_507, out a5_508, out a6_509, out a7_510);
		word32 t1_511;
		word32 a0_512;
		word32 a1_513;
		word32 a2_514;
		word32 a3_515;
		word32 a4_516;
		word32 a5_517;
		ra_167 = memset(ra_72, (word32) *((word32) s0_174 + 144) + 2, 0x00, 0x06, out t1_511, out a0_512, out a1_513, out a2_514, out a3_515, out a4_516, out a5_517);
		a4_165 = *((word32) s0_174 + 144);
		a5_166 = (word32) *((word32) a4_165 + 1) + 0x01 & 0x00FF;
		((word32) a4_165 + 1)->u1 = (byte) a5_166;
		if (a5_166 == 0x00)
		{
			a4_165 = *((word32) s0_174 + 144);
			a5_166 = (word32) *a4_165 + 0x01 & 0x00FF;
			a4_165->u1 = (byte) a5_166;
			if (a5_166 == 0x00)
			{
				word32 a1_518;
				word32 a2_519;
				word32 a3_520;
				word32 a4_521;
				word32 a5_522;
				word32 a7_523;
				word32 s4_524;
				word32 s5_525;
				word32 s6_526;
				word32 s7_527;
				word32 s8_528;
				word32 s9_529;
				word32 s10_530;
				word32 s11_531;
				word32 t4_532;
				mbedtls_debug_print_msg(ra_167, s0_174, 0x01, &g_t23089FB8, a5_166, out a1_518, out a2_519, out a3_520, out a4_521, out a5_522, out a7_523, out s4_524, out s5_525, out s6_526, out s7_527, out s8_528, out s9_529, out s10_530, out s11_531, out t4_532);
				goto l2305C498;
			}
		}
	}
	else
	{
		word32 t1_499;
		word32 a0_500;
		word32 a1_501;
		word32 a2_502;
		word32 a3_503;
		ra_167 = memset(ra_72, s0_155->t0090, 0x00, 0x08, out t1_499, out a0_500, out a1_501, out a2_502, out a3_503, out a4_165, out a5_166);
	}
	*((word32) a5_166 + 56) = *((word32) a5_166 + 64);
	*((word32) a5_166 + 36) = *((word32) a5_166 + 44);
	ui32 a5_220 = (word32) *((word32) a5_166 + 116);
	Eq_2 s0_219 = *a5_166;
	Eq_2 a5_221 = a5_220 & 0x02;
	if ((a5_220 & 0x02) != 0x00)
	{
		word32 s11_544;
		ra_167 = mbedtls_ssl_send_flight_completed(ra_167, a4_165, a5_220 & 0x02, s2, s0, out s1_238, out a5_221, out s11_544);
	}
	Eq_2 a5_270;
	Eq_2 s0_274;
	Eq_2 a0_291;
	word32 s1_533;
	word32 a1_534;
	word32 a2_535;
	word32 a3_536;
	word32 a4_537;
	word32 s2_538;
	word32 s3_539;
	word32 s4_540;
	word32 s5_541;
	word32 s11_542;
	word32 mstatus_543;
	Eq_2 ra_273 = mbedtls_ssl_write_record(ra_167, s1_238, s0_219, a5_221, mstatus, out s0_274, out s1_533, out a0_291, out a1_534, out a2_535, out a3_536, out a4_537, out a5_270, out s2_538, out s3_539, out s4_540, out s5_541, out s11_542, out mstatus_543);
	if (a0_291 != 0x00)
	{
		word32 a1_560;
		word32 a2_561;
		word32 a3_562;
		word32 a4_563;
		word32 a5_564;
		word32 s4_565;
		word32 s5_566;
		word32 s6_567;
		word32 s7_568;
		word32 s8_569;
		word32 s9_570;
		word32 s10_571;
		word32 s11_572;
		mbedtls_debug_print_ret(ra_273, 0x01, 0x01000471, a0_291, out a1_560, out a2_561, out a3_562, out a4_563, out a5_564, out s4_565, out s5_566, out s6_567, out s7_568, out s8_569, out s9_570, out s10_571, out s11_572);
	}
	else
	{
		word32 a1_545;
		word32 a2_546;
		word32 a3_547;
		word32 a4_548;
		word32 a5_549;
		word32 a7_550;
		word32 s4_551;
		word32 s5_552;
		word32 s6_553;
		word32 s7_554;
		word32 s8_555;
		word32 s9_556;
		word32 s10_557;
		word32 s11_558;
		word32 t4_559;
		mbedtls_debug_print_msg(ra_273, s0_274, 0x02, &g_t23089FD0, a5_270, out a1_545, out a2_546, out a3_547, out a4_548, out a5_549, out a7_550, out s4_551, out s5_552, out s6_553, out s7_554, out s8_555, out s9_556, out s10_557, out s11_558, out t4_559);
	}
l2305C498:
	0x00 = dwArg38;
}

