pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305C514: Register Eq_2 mbedtls_ssl_write(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg84, Stack word32 dwArgA8, Stack Eq_2 dwArg0108, Register out ptr32 s0Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out (ptr32 Eq_269262) a3Out, Register out (ptr32 Eq_269263) a4Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out (ptr32 Eq_2) s5Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      iot_tls_write
Eq_2 mbedtls_ssl_write(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg84, word32 dwArgA8, Eq_2 dwArg0108, ptr32 & s0Out, union Eq_2 & a0Out, ptr32 & a2Out, struct Eq_269262 & a3Out, struct Eq_269263 & a4Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_2 & s5Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & mstatusOut)
{
	Eq_2 s0_169;
	word32 a5_35;
	ptr32 s4_43;
	word32 a1_542;
	word32 s8_545;
	word32 a2_543;
	word32 a7_544;
	word32 s11_546;
	word32 t4_547;
	Eq_2 s6_118;
	union Eq_2 * s5_306;
	ptr32 s7_308;
	ptr32 s9_310;
	ptr32 s10_303;
	struct Eq_269263 * a4_301;
	struct Eq_269262 * a3_300;
	mbedtls_debug_print_msg(ra, a0, 0x02, &g_t23089DEC, a5, out a1_542, out a2_543, out a3_300, out a4_301, out a5_35, out a7_544, out s4_43, out s5_306, out s6_118, out s7_308, out s8_545, out s9_310, out s10_303, out s11_546, out t4_547);
	Eq_2 s2_101 = a2;
	if (a0 == 0x00 || a5_35 == 0x00)
	{
		s0_169.u0 = ~0x070000FF;
		goto l2305C580;
	}
	Eq_2 s1_103 = a4_301->t0004;
	struct Eq_297306 * a5_57 = (struct Eq_297306 *) 0x10;
	s3 = s4_43;
	if (a4_301 != (struct Eq_269263 *) 0x10)
	{
		Eq_2 a0_61;
		word32 s5_81;
		word32 s0_548;
		word32 a1_549;
		word32 a2_550;
		word32 s4_552;
		word32 a4_551;
		ra = mbedtls_ssl_handshake(ra, s1_103, 0x10, mstatus, dwArg38, dwArg84, out s0_548, out s1_103, out a0_61, out a1_549, out a2_550, out a3_300, out a4_551, out a5_57, out s2_101, out s3, out s4_552, out s5_81, out s6_118, out mstatus);
		s0_169 = a0_61;
		if (a0_61 != 0x00)
		{
			word32 s6_557;
			word32 a5_555;
			word32 a2_554;
			word32 s11_559;
			word32 s4_556;
			word32 a1_553;
			word32 s8_558;
			mbedtls_debug_print_ret(ra, 0x01, s5_81 + -1202, a0_61, out a1_553, out a2_554, out a3_300, out a4_301, out a5_555, out s4_556, out s5_306, out s6_557, out s7_308, out s8_558, out s9_310, out s10_303, out s11_559);
			goto l2305C580;
		}
	}
	Eq_2 a5_143;
	struct Eq_274 * a4_178;
	Eq_2 a5_177;
	struct Eq_305631 * a5_99;
	Eq_2 a0_97 = mbedtls_ssl_get_max_frag_len(a3_300, a5_57, out a5_99);
	if (a0_97 < s2_101)
	{
		s1_103 = a5_99->t0000;
		if (((word32) a5_99->w0074 & 0x02) != 0x00)
		{
			a5_177 = s2_101;
			a4_178 = (struct Eq_274 *) &g_t23089E10;
			goto l2305C5BC;
		}
		s2_101 = a0_97;
	}
	Eq_2 a5_172;
	Eq_2 a3_174;
	Eq_2 a5_109 = *((word32) s1_103 + 0x00AC);
	if (a5_109 != 0x00)
	{
		Eq_2 a0_183;
		word32 a1_560;
		word32 a4_563;
		word32 a2_561;
		word32 a3_562;
		word32 s4_564;
		word32 s5_565;
		word32 s6_566;
		word32 s7_567;
		word32 s9_568;
		word32 s10_569;
		word32 s11_570;
		mbedtls_ssl_flush_output(ra, s1_103, a5_109, dwArg0108, out s1_103, out a0_183, out a1_560, out a2_561, out a3_562, out a4_563, out a5_143, out s2_101, out s3, out s4_564, out s5_565, out s6_566, out s7_567, out s9_568, out s10_569, out s11_570);
		s0_169 = a0_183;
		if (a0_183 != 0x00)
		{
			a5_172 = a0_183;
			a3_174.u0 = 0x01FFFAF4;
			goto l2305C60C;
		}
	}
	else
	{
		if (s2_101 > 0x04000130)
		{
			a5_177 = s2_101;
			a4_178 = (struct Eq_274 *) &g_t23089E58;
l2305C5BC:
			word32 a1_594;
			word32 a2_595;
			word32 a3_596;
			word32 a4_597;
			word32 a7_598;
			word32 s4_599;
			word32 s5_600;
			word32 s6_601;
			word32 s7_602;
			word32 s8_603;
			word32 s9_604;
			word32 s10_605;
			word32 s11_606;
			word32 t4_607;
			mbedtls_debug_print_msg(ra, s1_103, 0x01, a4_178, a5_177, out a1_594, out a2_595, out a3_596, out a4_597, out a5_143, out a7_598, out s4_599, out s5_600, out s6_601, out s7_602, out s8_603, out s9_604, out s10_605, out s11_606, out t4_607);
			s0_169.u0 = ~0x070000FF;
			goto l2305C5CE;
		}
		Eq_2 a0_113 = *((word32) s1_103 + 0x00A0);
		((word32) s1_103 + 0x00A4)->u0 = 0x17;
		*((word32) s1_103 + 0x00A8) = s2_101;
		Eq_2 a5_122;
		word32 a1_580;
		word32 a2_581;
		word32 a3_582;
		word32 a4_583;
		word32 a6_584;
		word32 a7_585;
		memcpy(a0_113, s6_118, s2_101, out a1_580, out a2_581, out a3_582, out a4_583, out a5_122, out a6_584, out a7_585);
		Eq_2 a0_164;
		word32 s0_586;
		word32 a1_587;
		word32 a2_588;
		word32 a3_589;
		word32 a4_590;
		word32 s4_591;
		word32 s5_592;
		word32 s11_593;
		ra = mbedtls_ssl_write_record(ra, s1_103, s1_103, a5_122, mstatus, out s0_586, out s1_103, out a0_164, out a1_587, out a2_588, out a3_589, out a4_590, out a5_143, out s2_101, out s3, out s4_591, out s5_592, out s11_593, out mstatus);
		s0_169 = a0_164;
		if (a0_164 != 0x00)
		{
			a5_172 = a0_164;
			a3_174.u0 = 0x01FFFB08;
l2305C60C:
			word32 a1_608;
			word32 a2_609;
			word32 a3_610;
			word32 a4_611;
			word32 s4_612;
			word32 s5_613;
			word32 s6_614;
			word32 s7_615;
			word32 s8_616;
			word32 s9_617;
			word32 s10_618;
			word32 s11_619;
			mbedtls_debug_print_ret(ra, 0x01, a3_174, a5_172, out a1_608, out a2_609, out a3_610, out a4_611, out a5_143, out s4_612, out s5_613, out s6_614, out s7_615, out s8_616, out s9_617, out s10_618, out s11_619);
l2305C5CE:
			word32 a1_571;
			word32 a2_572;
			word32 a5_573;
			word32 a7_574;
			word32 s4_575;
			word32 s6_576;
			word32 s8_577;
			word32 s11_578;
			word32 t4_579;
			mbedtls_debug_print_msg(ra, s1_103, 0x02, &g_t23089E94, a5_143, out a1_571, out a2_572, out a3_300, out a4_301, out a5_573, out a7_574, out s4_575, out s5_306, out s6_576, out s7_308, out s8_577, out s9_310, out s10_303, out s11_578, out t4_579);
l2305C580:
			0x00 = dwArgA8;
			s0Out = s1;
			a0Out = s0_169;
			a2Out = dwArg48;
			a3Out = a3_300;
			a4Out = a4_301;
			s2Out = s2_101;
			s3Out = s3;
			s5Out = s5_306;
			s7Out = s7_308;
			s9Out = s9_310;
			s10Out = s10_303;
			mstatusOut = mstatus;
			return ra;
		}
	}
	s0_169 = s2_101;
	goto l2305C5CE;
}

// 2305C674: Register (ptr32 ptr32) mbedtls_ssl_read_version(Register ptr32 a0, Register ptr32 a1, Register (ptr32 ptr32) a2, Register Eq_2 a3, Register out (ptr32 ptr32) a5Out)
// Called from:
//      mbedtls_ssl_read_record_layer
//      mbedtls_ssl_handshake_server_step
ptr32 * mbedtls_ssl_read_version(ptr32 a0, ptr32 a1, ptr32 * a2, Eq_2 a3, ptr32 & a5Out)
{
	ptr32 * a5_10;
	ptr32 * a4_14 = (word32) *a3;
	if (a2 == (ptr32 *) 0x01)
	{
		0x0101 - a4_14 = a0;
		a4_14 = (word32) *((word32) a3 + 1);
		a5_10 = 0x0100 - a4_14;
		if (a5_10 == a2)
			a5_10 = (ptr32 *) 0x02;
	}
	else
	{
		*a4_14 = a0;
		a5_10 = (word32) *((word32) a3 + 1);
	}
	*a5_10 = a1;
	a5Out = a5_10;
	return a4_14;
}

