pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305C6A4: Register Eq_2 mbedtls_ssl_read_record_layer(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 s2, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack ptr32 dwArg60, Stack word32 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Register out Eq_2 a0Out, Register out Eq_2 a4Out, Register out ptr32 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_ssl_read_record
Eq_2 mbedtls_ssl_read_record_layer(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 s2, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, ptr32 dwArg60, word32 dwArg64, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, union Eq_2 & a0Out, union Eq_2 & a4Out, ptr32 & s3Out, ptr32 & mstatusOut)
{
	Eq_2 a0_1699;
	Eq_2 a1_31 = *((word32) a0 + 0x0080);
	a0_1699 = a0;
	if (a1_31 != 0x00)
	{
		a0_1699 = *((word32) a2 + 112);
		if (a1_31 < a2)
		{
			struct Eq_28011 * a2_1751 = a2 - a1_31;
			a2_1751[112] = (struct Eq_28011) a0_1699;
			Eq_2 a0_1753 = *((word32) a0_1699 + 100);
			Eq_2 a5_1759;
			word32 a3_3162;
			word32 a4_3163;
			memmove(a0_1753, a1_31 + a0_1753, a2_1751, out a3_3162, out a4_3163, out a5_1759);
			word32 a2_3165;
			word32 a1_3164;
			word32 a3_3166;
			word32 a4_3167;
			word32 a7_3169;
			word32 a5_3168;
			mbedtls_debug_print_buf(ra, 0x04, a5_1759, out a1_3164, out a2_3165, out a3_3166, out a4_3167, out a5_3168, out a7_3169);
			goto l2305C700;
		}
	}
	((word32) a0 + 0x0080)->u0 = 0x00;
	s2_1043 = s2;
	while (true)
	{
		Eq_2 a5_1223;
		Eq_2 a3_1225;
		Eq_2 s2_1043;
		Eq_2 s0_46 = *a0_1699;
		Eq_2 a5_48;
		Eq_2 a0_55;
		word32 s0_3217;
		word32 s11_3226;
		word32 s5_3220;
		word32 s2_3218;
		word32 s4_3219;
		word32 s7_3222;
		word32 s9_3224;
		word32 s10_3225;
		word32 s6_3221;
		word32 s8_3223;
		ra = mbedtls_ssl_fetch_input(ra, s0_46, s0_46, mbedtls_ssl_hdr_len.isra.1(a0_1699, out a5_48), a5_48, s2_1043, mstatus, dwArg58, dwArg88, out s0_3217, out a0_55, out s2_3218, out s3, out s4_3219, out s5_3220, out s6_3221, out s7_3222, out s8_3223, out s9_3224, out s10_3225, out s11_3226, out mstatus);
		if (a0_55 != 0x00)
			break;
		struct Eq_274 * a4_1474;
		Eq_2 a5_1471;
		Eq_2 s0_1469;
		word32 s10_1497;
		word32 s9_1504;
		Eq_2 s8_1503;
		Eq_2 s6_1544;
		Eq_2 a0_1490;
		Eq_2 a5_90;
		mbedtls_ssl_hdr_len.isra.1(a0_55, out a5_90);
		byte * a3_103;
		struct Eq_306013 * a4_104;
		word32 a2_3171;
		word32 a1_3170;
		word32 a5_3172;
		word32 a7_3173;
		mbedtls_debug_print_buf(ra, 0x04, a5_90, out a1_3170, out a2_3171, out a3_103, out a4_104, out a5_3172, out a7_3173);
		word32 s0_111 = a4_104->dw005C;
		((word32[]) 0x006C)[(word32) *a3_103 / 4] = s0_111;
		uint32 a2_118 = (word32) a4_104->b0000;
		uint32 a5_120 = (word32) a4_104->b0001 << 8 | a2_118;
		((word32[]) 112)[(word32) (word16) (a5_120 >> 8 | a5_120 << 0x08) / 4] = s0_111;
		Eq_2 a5_132;
		mbedtls_ssl_read_version((word32) fp - 116, (word32) fp - 112, a2_118 >> 1 & 0x01, a3_103 + 1, out a5_132);
		struct Eq_306077 * a4_149;
		word32 s11_152;
		struct Eq_306079 * s4_153;
		word32 a7_3178;
		word32 a5_3177;
		word32 a2_3175;
		word32 a1_3174;
		word32 a3_3176;
		word32 s5_3179;
		word32 s8_3182;
		word32 s9_3183;
		word32 s6_3180;
		word32 s7_3181;
		word32 s10_3184;
		word32 t4_3185;
		Eq_2 a0_144 = mbedtls_debug_print_msg(ra, *((word32) a5_132 + 0x006C), 0x03, &g_t23089980, a5_132, out a1_3174, out a2_3175, out a3_3176, out a4_149, out a5_3177, out a7_3178, out s4_153, out s5_3179, out s6_3180, out s7_3181, out s8_3182, out s9_3183, out s10_3184, out s11_152, out t4_3185);
		s2_1043.u0 = 0x01000000;
		Eq_2 s0_163 = a4_149->t006C;
		Eq_2 a5_1563 = 0x03;
		if (a4_149 > (struct Eq_306077 *) ~0x16)
		{
			word32 s9_3196;
			Eq_2 a5_1591;
			word32 s11_3198;
			word32 a1_3186;
			word32 t4_3199;
			word32 s7_3194;
			word32 a2_3187;
			word32 a3_3188;
			word32 a4_3189;
			word32 s4_3191;
			word32 s5_3192;
			word32 s8_3195;
			word32 a7_3190;
			word32 s6_3193;
			word32 s10_3197;
			mbedtls_debug_print_msg(ra, s0_163, 0x01, &g_t230899BC, 0x03, out a1_3186, out a2_3187, out a3_3188, out a4_3189, out a5_1591, out a7_3190, out s4_3191, out s5_3192, out s6_3193, out s7_3194, out s8_3195, out s9_3196, out s10_3197, out s11_3198, out t4_3199);
			word32 s0_3200;
			word32 s1_3201;
			word32 a4_3202;
			word32 a5_3203;
			word32 s5_3204;
			ra = mbedtls_ssl_send_alert_message(ra, s0_163, 0x0A, a5_1591, mstatus, out s0_3200, out s1_3201, out a0_1490, out a4_3202, out a5_3203, out s2_1043, out s3, out s5_3204, out s8_1503, out s9_1504, out s10_1497, out mstatus);
			s6_1544 = a0_1490;
			if (a0_1490 == 0x00)
				goto l2305C81A;
			goto l2305C820;
		}
		struct Eq_274 * a4_1546;
		Eq_2 s0_1516 = a4_149->tFFFFFFF4;
		if (a4_149 != (struct Eq_306077 *) ~0x16)
		{
			a4_1546 = (struct Eq_274 *) &g_t230899D0;
			goto l2305C86E;
		}
		s0_1516 = *a0_144;
		struct Eq_306209 * a3_170 = (word32) *((word32) a0_144 + 113);
		if (a3_170 < (struct Eq_306209 *) 0x03)
		{
			a4_1546 = (struct Eq_274 *) &g_t230899E8;
			goto l2305C86E;
		}
		s0_1516 = a3_170->dw0050;
		Eq_2 s6_173 = *((word32) s0_1516 + 112);
		a5_1563 = s11_152 - (0x03 - a3_170);
		if (a5_1563 < s6_173)
		{
			a4_1546 = (struct Eq_274 *) &g_t23089A00;
			goto l2305C86E;
		}
		s0_1516 = *((word32) a5_1563 + 52);
		if (a5_1563 == 0x00)
		{
			a5_1563 = s6_173 + -1;
			if (s6_173 + -1 <u s4_153)
				goto l2305C902;
			a4_1546 = (struct Eq_274 *) &g_t23089A00;
			goto l2305C86E;
		}
		a5_1563 = *((word32) a5_1563 + 8);
		if (s6_173 < a5_1563)
		{
			a4_1546 = (struct Eq_274 *) &g_t23089A00;
			goto l2305C86E;
		}
		s0_1516 = a3_170->dw000C;
		if (a3_170 > null)
		{
			a3_170 = s4_153 + 0x0100;
			a5_1563 += s4_153 + 0x0100;
			if (a5_1563 >= s6_173)
				goto l2305C902;
			a4_1546 = (struct Eq_274 *) &g_t23089A00;
l2305C86E:
			word32 t4_3216;
			word32 s4_3211;
			word32 a7_3210;
			word32 a5_3209;
			word32 a4_3208;
			word32 s7_3214;
			word32 s5_3212;
			word32 s6_3213;
			word32 a1_3205;
			word32 a2_3206;
			word32 a3_3207;
			word32 s11_3215;
			a0_1490 = mbedtls_debug_print_msg(ra, s0_1516, 0x01, a4_1546, a5_1563, out a1_3205, out a2_3206, out a3_3207, out a4_3208, out a5_3209, out a7_3210, out s4_3211, out s5_3212, out s6_3213, out s7_3214, out s8_1503, out s9_1504, out s10_1497, out s11_3215, out t4_3216);
l2305C81A:
			s6_1544.u0 = ~0x070001FF;
			goto l2305C820;
		}
l2305C902:
		if (((word32) *((word32) a0_144 + 116) & 0x02) != 0x00)
		{
			struct Eq_274 * a4_1511;
			Eq_2 a5_1519;
			uint32 a5_197 = (word32) a3_170->b0001 << 8 | (word32) a3_170->b0000;
			s0_1516 = a3_170->dw0054;
			Eq_2 a6_203 = (word32) (word16) (a5_197 << 0x08 | a5_197 >> 8);
			if (a4_149 == (struct Eq_306077 *) 0x14)
			{
				s0_1516 = *(union Eq_2 *) 0x18;
				a5_1519.u0 = 0x08;
				if (false)
					goto l2305C978;
				a4_1511 = (struct Eq_274 *) &g_t23089A14;
				goto l2305C948;
			}
			if (a4_149 == (struct Eq_306077 *) 0x17)
			{
				s0_1516 = a4_149->t0004;
				a5_1519.u0 = 0x10;
				if (a4_149 == (struct Eq_306077 *) 0x10)
					goto l2305C978;
				a4_1511 = (struct Eq_274 *) &g_t23089A3C;
l2305C948:
				word32 a5_3267;
				word32 s4_3269;
				word32 s5_3270;
				word32 s6_3271;
				word32 s7_3272;
				word32 s11_3273;
				word32 t4_3274;
				word32 a7_3268;
				word32 a3_3265;
				word32 a4_3266;
				word32 a1_3263;
				word32 a2_3264;
				a0_1490 = mbedtls_debug_print_msg(ra, s0_1516, 0x01, a4_1511, a5_1519, out a1_3263, out a2_3264, out a3_3265, out a4_3266, out a5_3267, out a7_3268, out s4_3269, out s5_3270, out s6_3271, out s7_3272, out s8_1503, out s9_1504, out s10_1497, out s11_3273, out t4_3274);
				goto l2305C954;
			}
l2305C978:
			Eq_2 a5_217 = (word32) *((word32) s0_1516 + 0x0078);
			if (a6_203 == a5_217)
				goto l2305C99C;
			word32 a3_3253;
			word32 s4_3257;
			word32 a4_3254;
			word32 s5_3258;
			word32 s6_3259;
			word32 s11_3261;
			word32 t4_3262;
			word32 s7_3260;
			word32 a7_3256;
			word32 a5_3255;
			word32 a2_3252;
			word32 a1_3251;
			a0_1490 = mbedtls_debug_print_msg(ra, s0_1516, 0x01, &g_t23089A60, a5_217, out a1_3251, out a2_3252, out a3_3253, out a4_3254, out a5_3255, out a7_3256, out s4_3257, out s5_3258, out s6_3259, out s7_3260, out s8_1503, out s9_1504, out s10_1497, out s11_3261, out t4_3262);
l2305C954:
			s6_1544 = s3 + -0x0700;
l2305C820:
			s0_1469 = *a0_1490;
			if (((word32) *((word32) a0_1490 + 116) & 0x02) == 0x00 || s6_1544 == s8_1503)
				goto l2305C700;
			a5_1471 = s3 + -0x0700;
			if (s6_1544 == a5_1471)
			{
				Eq_2 a0_1672 = mbedtls_ssl_hdr_len.isra.1(a0_1490, out a5_1471);
				s0_1469 = *((word32) a5_1471 + 112);
				Mem1681[a0_1672 + a5_1471 + 0x007C:word32] = s0_1469;
				a4_1474 = s10_1497 + -1388;
			}
			else
			{
				*((word32) s0_1469 + 0x007C) = 0x00;
				*((word32) s0_1469 + 116) = 0x00;
				a4_1474 = s9_1504 + -0x0544;
			}
			goto l2305C84C;
		}
l2305C99C:
		Eq_2 a5_222;
		Eq_2 a0_243;
		struct Eq_306386 * s0_251;
		word32 s10_3249;
		word32 s7_3246;
		word32 s11_3250;
		word32 s2_3242;
		word32 s5_3244;
		word32 s6_3245;
		word32 s4_3243;
		word32 s8_3247;
		word32 s9_3248;
		ra = mbedtls_ssl_fetch_input(ra, s0_1516, s0_1516, mbedtls_ssl_hdr_len.isra.1(a0_144, out a5_222) + s6_173, a5_222, 0x01000000, mstatus, dwArg58, dwArg88, out s0_251, out a0_243, out s2_3242, out s3, out s4_3243, out s5_3244, out s6_3245, out s7_3246, out s8_3247, out s9_3248, out s10_3249, out s11_3250, out mstatus);
		if (a0_243 != 0x00)
		{
			a5_1223 = a0_243;
			a3_1225.u0 = 0x00FFFF11;
			goto l2305C75A;
		}
		Eq_2 s7_274 = s0_251->t0000;
		s2_1043 = s0_251->t0070;
		if (((word32) *((word32) s7_274 + 116) & 0x02) != 0x00)
		{
			word32 a5_3288;
			Mem283[mbedtls_ssl_hdr_len.isra.1(s7_274, out a5_3288) + s2_1043 + 0x007C:word32] = s0_251;
		}
		else
			s0_251->dw0074 = 0x00;
		Eq_2 a5_287;
		mbedtls_ssl_hdr_len.isra.1(s7_274, out a5_287);
		word32 a1_3339;
		word32 a3_3341;
		word32 a7_3342;
		word32 a2_3340;
		Eq_2 a5_1083;
		struct Eq_306748 * a4_1087;
		mbedtls_debug_print_buf(ra, 0x04, a5_287, out a1_3339, out a2_3340, out a3_3341, out a4_1087, out a5_1083, out a7_3342);
		Eq_2 s0_312 = *((word32) a5_1083 + 52);
		if (a5_1083 == 0x00)
		{
l2305D038:
			ui32 a5_1097 = (word32) *((word32) a5_1083 + 116);
			if ((a5_1097 & 0x02) == 0x00 || ((a5_1097 & 0x02) == 0x00 || a4_1087 != (struct Eq_306748 *) 0x10))
				goto l2305C700;
			Eq_2 s0_1103 = a4_1087->dw006C;
			Eq_2 a5_1104 = 22;
			if (a4_1087 == (struct Eq_306748 *) 22)
			{
				s0_1103 = *(union Eq_2 *) 122;
				a5_1104.u0 = 0x14;
				if ((word32) *(union Eq_2 *) 22 == 0x14)
				{
					Eq_2 a5_1170;
					word32 s9_3321;
					word32 s10_3322;
					word32 s11_3323;
					word32 t4_3324;
					word32 s8_3320;
					word32 s7_3319;
					word32 s4_3316;
					word32 s5_3317;
					word32 s6_3318;
					word32 a7_3315;
					word32 a4_3314;
					word32 a2_3312;
					word32 a3_3313;
					word32 a1_3311;
					mbedtls_debug_print_msg(ra, s0_1103, 0x02, &g_t23089CD4, 0x14, out a1_3311, out a2_3312, out a3_3313, out a4_3314, out a5_1170, out a7_3315, out s4_3316, out s5_3317, out s6_3318, out s7_3319, out s8_3320, out s9_3321, out s10_3322, out s11_3323, out t4_3324);
					word32 s2_1202;
					Eq_2 a0_1218;
					word32 s10_3337;
					word32 s11_3338;
					word32 s9_3336;
					word32 a5_3331;
					word32 s6_3334;
					word32 s7_3335;
					word32 s4_3332;
					word32 s5_3333;
					word32 a2_3328;
					word32 a3_3329;
					word32 a4_3330;
					word32 a1_3327;
					word32 s0_3325;
					word32 s1_3326;
					ra = mbedtls_ssl_resend(ra, s0_1103, s0_1103, a5_1170, 0x01000000, mstatus, dwArg88, out s0_3325, out s1_3326, out a0_1218, out a1_3327, out a2_3328, out a3_3329, out a4_3330, out a5_3331, out s2_1202, out s3, out s4_3332, out s5_3333, out s6_3334, out s7_3335, out s9_3336, out s10_3337, out s11_3338, out mstatus);
					if (a0_1218 == 0x00)
						goto l2305C700;
					a5_1223 = a0_1218;
					a3_1225 = s2_1202 + -0x008F;
					goto l2305C75A;
				}
			}
			ssl_handshake_wrapup_free_hs_transform(ra, s0_1103, a5_1104, mstatus, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8);
			goto l2305C700;
		}
		ui32 s6_1252;
		struct Eq_306602 * a5_1233;
		Eq_2 s6_1042;
		Eq_2 a1_321;
		Eq_2 s5_329;
		Eq_2 s7_331;
		word32 a3_3290;
		word32 s9_3296;
		word32 s11_3298;
		word32 t4_3299;
		word32 s10_3297;
		word32 s6_3294;
		word32 s8_3295;
		word32 a4_3291;
		word32 a7_3292;
		word32 s4_3293;
		word32 a2_3289;
		Eq_2 a5_1393;
		mbedtls_debug_print_msg(ra, s0_312, 0x02, &g_t23089AFC, a5_1083, out a1_321, out a2_3289, out a3_3290, out a4_3291, out a5_1393, out a7_3292, out s4_3293, out s5_329, out s6_3294, out s7_331, out s8_3295, out s9_3296, out s10_3297, out s11_3298, out t4_3299);
		Eq_2 s0_1320 = *((word32) a5_1393 + 32);
		if (a5_1393 != 0x00)
		{
			s0_1320 = *((word32) a5_1393 + 52);
			if (a5_1393 == 0x00)
				goto l2305CA3A;
			struct Eq_306650 * a3_340 = *((word32) a5_1393 + 144);
			struct Eq_306654 * a4_341 = null;
			if (a3_340 != null)
				a4_341 = (word32) a3_340->b0001;
			struct Eq_274 * a4_1350;
			s2_1043 = *((word32) s0_1320 + 112);
			if (s2_1043 < *((word32) a5_1393 + 8))
			{
				a4_1350 = (struct Eq_274 *) &g_t23089B0C;
				goto l2305CA86;
			}
			struct Eq_274 * a4_1313;
			ui32 s5_512;
			Eq_2 s7_447;
			Eq_2 s1_431;
			if (((char *) a4_341 - 6 & 0x00FD) == 0x00)
			{
				Eq_306721 a7_558 = 0x08;
				ui32 a4_559 = (word32) a4_341->b001C;
				if ((a4_559 & 0x02) == 0x00)
					a7_558.u0 = 0x10;
				Eq_306732 a5_565 = (a4_559 & 0x02)->ptr000C->t0010;
				if (s2_1043 < (word32) a7_558 + ((a4_559 & 0x02) - a5_565))
				{
					a4_1313 = (struct Eq_274 *) &g_t23089B2C;
					goto l2305CACC;
				}
				Eq_2 s0_574 = *((word32) a1_321 + 84);
				word32 s2_575 = s2_1043 + a5_565 - (a4_559 & 0x02) - a7_558;
				*((word32) s0_574 + 112) = s2_575;
				Eq_2 s7_581 = *((word32) s0_574 + 100);
				word32 a1_585;
				uint32 a2_586;
				word32 a7_3347;
				word32 a5_3345;
				word32 a6_3346;
				word32 a3_3343;
				word32 a4_3344;
				memcpy((word32) fp - 112, a1_321, 0x08, out a1_585, out a2_586, out a3_3343, out a4_3344, out a5_3345, out a6_3346, out a7_3347);
				mbedtls_ssl_write_version((word32) fp - 112, a1_585, a2_586 >> 1 & 0x01, (word32) fp - 0x0067);
				Eq_2 a1_624;
				struct Eq_306912 * a2_625;
				word32 a4_3349;
				word32 a5_3350;
				word32 a7_3351;
				word32 a3_3348;
				struct Eq_294369 * a0_622 = mbedtls_debug_print_buf(ra, 0x04, (word32) fp - 112, out a1_624, out a2_625, out a3_3348, out a4_3349, out a5_3350, out a7_3351);
				word32 a5_641;
				word32 a7_3357;
				word32 a4_3355;
				word32 a6_3356;
				word32 a3_3354;
				word32 a1_3352;
				word32 a2_3353;
				memcpy(a0_622 + (a2_625->dw000C + 40) / 20, a1_624, a2_625 - a0_622, out a1_3352, out a2_3353, out a3_3354, out a4_3355, out a5_641, out a6_3356, out a7_3357);
				word32 a7_3363;
				word32 a1_3358;
				word32 a4_3361;
				word32 a5_3362;
				word32 a2_3359;
				word32 a3_3360;
				mbedtls_debug_print_buf(ra, 0x04, a5_641 + 40, out a1_3358, out a2_3359, out a3_3360, out a4_3361, out a5_3362, out a7_3363);
				Eq_2 a2_688;
				word32 a1_3364;
				word32 a7_3368;
				word32 a3_3365;
				word32 a5_3367;
				word32 a4_3366;
				mbedtls_debug_print_buf(ra, 0x04, s7_581 + s2_575, out a1_3364, out a2_688, out a3_3365, out a4_3366, out a5_3367, out a7_3368);
				word32 a0_699 = *((word32) a2_688 + 0x0C);
				Eq_2 a0_712;
				ra = mbedtls_cipher_auth_decrypt(a0_699 + 144, a0_699 + 40, a2_688, 0x0D, s2_575, s7_581, s5_329, dwLoc7C, s2, s1, dwArg98, dwArgB4, out s0_1320, out s1_431, out a0_712, out a5_1393, out s2_1043, out s3);
				if (a0_712 != 0x00)
				{
					Eq_2 s5_1300;
					word32 a4_3372;
					word32 s7_3376;
					word32 a5_3373;
					word32 a1_3369;
					word32 s8_3377;
					word32 s9_3378;
					word32 s11_3380;
					word32 s10_3379;
					word32 s6_3375;
					word32 s4_3374;
					word32 a3_3371;
					word32 a2_3370;
					mbedtls_debug_print_ret(ra, 0x01, 1701, a0_712, out a1_3369, out a2_3370, out a3_3371, out a4_3372, out a5_3373, out s4_3374, out s5_1300, out s6_3375, out s7_3376, out s8_3377, out s9_3378, out s10_3379, out s11_3380);
					s6_1042 = s5_1300;
					if (s5_1300 == s3 + -0x0300)
						goto l2305CBE4;
					goto l2305CE16;
				}
				if (s2_1043 != a5_1393)
					goto l2305CA46;
				s2_1043.u0 = 0x01;
				s5_512 = 0x00;
				s7_447.u0 = 0x01;
				goto l2305CC06;
			}
			if (a4_341 != (struct Eq_306654 *) 0x02)
				goto l2305CA46;
			Eq_307026 a6_358 = *((word32) a5_1393 + 0x0C);
			s0_1320 = *(union Eq_2 *) 0x0E;
			Eq_2 a2_360 = 0x01;
			Eq_307026 a4_361 = a6_358;
			if (false)
				a4_361.u0 = 0x00;
			int32 a7_365 = *((word32) a5_1393 + 20);
			if (s2_1043 >=u a4_361 + a6_358)
			{
				Eq_2 a5_371 = (word32) a4_361.u0 + (a7_365 + 1);
				if (s2_1043 < a5_371)
					goto l2305CD9C;
				Eq_2 s5_372 = s2_1043 & a6_358;
				if (s5_372 != 0x00)
				{
					a4_1350 = (struct Eq_274 *) &g_t23089BC8;
l2305CA86:
					word32 s11_3424;
					word32 t4_3425;
					word32 a3_3413;
					word32 s10_3423;
					word32 s8_3421;
					word32 s9_3422;
					word32 s7_3420;
					word32 a5_3415;
					word32 a7_3416;
					word32 s4_3417;
					word32 s5_3418;
					word32 s6_3419;
					word32 a4_3414;
					word32 a1_3411;
					word32 a2_3412;
					mbedtls_debug_print_msg(ra, s0_1320, 0x01, a4_1350, s2_1043, out a1_3411, out a2_3412, out a3_3413, out a4_3414, out a5_3415, out a7_3416, out s4_3417, out s5_3418, out s6_3419, out s7_3420, out s8_3421, out s9_3422, out s10_3423, out s11_3424, out t4_3425);
					goto l2305CBE4;
				}
				Eq_2 s0_374 = *((word32) a5_371 + 100);
				if (true)
				{
					s2_1043 -= a6_358;
					*((word32) s0_374 + 112) = s2_1043;
					Eq_2 a4_378 = 0x00;
					while (true)
					{
						ptr32 a3_383 = *((word32) a2_360 + 0x0C);
						if (a4_378 >= a2_360)
							break;
						a2_360 = CONVERT(Mem380[a2_360 + a4_378:byte], byte, word32);
						(word32) a4_378 + a3_383 + 40 = (word32) (byte) a2_360;
						a4_378 = (word32) a4_378 + 1;
					}
				}
				ptr32 a0_406 = *((word32) a2_360 + 0x0C);
				Eq_2 a0_422;
				Eq_307202 a1_423;
				struct Eq_307203 * a2_424;
				up32 a3_425;
				up32 s4_434;
				ui32 s5_444;
				ra = mbedtls_cipher_crypt(ra, a0_406 + 144, a0_406 + 40, a2_360, a5_371, s2_1043, a5_371, (word32) fp - 112, s5_372, s7_331, dwLoc98, s2, dwLoc38, dwLoc18, s11, dwArg30, dwArg34, dwArg58, dwArg88, out s0_1320, out s1_431, out a0_422, out a1_423, out a2_424, out a3_425, out a5_1393, out s2_1043, out s3, out s4_434, out s5_444);
				s7_447 = a0_422;
				if (a0_422 != 0x00)
				{
					Eq_2 s7_540;
					word32 a5_3430;
					word32 s4_3431;
					word32 s5_3432;
					word32 s8_3434;
					word32 s9_3435;
					word32 s10_3436;
					word32 s11_3437;
					word32 s6_3433;
					word32 a4_3429;
					word32 a2_3427;
					word32 a3_3428;
					word32 a1_3426;
					mbedtls_debug_print_ret(ra, 0x01, 0x0723, a0_422, out a1_3426, out a2_3427, out a3_3428, out a4_3429, out a5_3430, out s4_3431, out s5_3432, out s6_3433, out s7_540, out s8_3434, out s9_3435, out s10_3436, out s11_3437);
					s6_1042 = s7_540;
					goto l2305CE16;
				}
				if (s2_1043 != a5_1393)
					goto l2305CA46;
				word32 a5_454 = CONVERT(Mem395[a1_423 + (a2_424 + -1):byte], byte, word32);
				ui32 a6_456 = 0x01;
				a5_1393 = a5_454 + 0x01;
				struct Eq_307203 * a4_458 = a5_454 + 0x01 + a3_425;
				if (a2_424 < a4_458)
				{
					a6_456 = 0x00;
					a5_1393.u0 = 0x00;
				}
				s0_1320 = a4_458->t000C;
				if (a4_458 <= null)
					goto l2305CA46;
				uint32 a0_470 = (char *) a2_424 - 1 - a5_1393;
				ui32 a4_480 = ((word32) (a2_424 < (word16) a5_1393.u0 + 1) ^ 1) & (word32) (a0_470 < a3_425 + s4_434) & a6_456;
				Eq_307317 a6_481 = a0_470 + a4_480;
				ui32 t3_482 = 0x01;
				Eq_2 a0_483 = 0x01;
				ptr32 t5_484 = (word16) a5_1393.u0 - 1;
				do
				{
					t3_482 &= (word32) (a5_1393 < a0_483) ^ 1;
					a0_483 = (word32) a0_483 + 1;
					s5_444 += CONVERT(CONVERT(Mem395[a6_481 + a0_483 + a1_423:byte], byte, word32) - t5_484 <u 1, bool, word32) + t3_482;
				} while (a0_483 != 0x0101);
				s2_1043 = (word32) (a5_1393 - s5_444 < 1) & a4_480;
				s5_512 = (word16) s2_1043.u0 + 511 & a5_1393;
				(a2_424 - s5_512)->t0070 = s0_1320;
l2305CC06:
				word32 a1_762;
				Eq_2 a2_763;
				struct Eq_307359 * a4_765;
				word32 a7_3438;
				struct Eq_307361 * a5_761;
				struct Eq_307362 * a3_1854;
				mbedtls_debug_print_buf(ra, 0x04, a5_1393, out a1_762, out a2_763, out a3_1854, out a4_765, out a5_761, out a7_3438);
				if (s7_447 == 0x00)
				{
					struct Eq_307380 * a4_780 = a4_765->ptr0014;
					struct Eq_307384 * a5_781 = a5_761 - a4_780;
					a5_781->dw0070 = a4_780->dw005C;
					a4_780->b0000 = (byte) (a5_781 >> 8);
					(a5_781 >> 8)->b0001 = (byte) a4_780;
					struct Eq_295064 * a4_794;
					word32 a1_797;
					word32 a3_3440;
					word32 a7_3442;
					word32 a6_3441;
					word32 a2_3439;
					memcpy((word32) fp - 112, a1_762 + (a5_781 >> 8), a2_763, out a1_797, out a2_3439, out a3_3440, out a4_794, out a5_1393, out a6_3441, out a7_3442);
					s0_1320 = *((word16) a5_1393.u0 + 0x0C);
					if (a5_1393 <= 0x00)
						goto l2305CA46;
					Eq_2 a5_822 = (word16) s2_1043.u0 + 0x00FF;
					word32 s5_825 = a5_822 & (s5_512 + (a5_1393 + 0x15) >>u 0x06) - (a5_1393 + 0x15 >>u 6);
					word32 a0_826;
					struct Eq_295064 * a4_828;
					Eq_2 a5_829;
					word32 a0_835;
					struct Eq_295064 * a4_837;
					Eq_2 a5_838;
					word32 a0_844;
					struct Eq_295064 * a4_846;
					Eq_2 a5_847;
					struct Eq_307450 * a0_854;
					ptr32 a4_856;
					struct Eq_295070 * a5_857;
					struct Eq_295080 * a1_865;
					word32 s1_3443;
					word32 a2_3444;
					word32 a4_3445;
					word32 a5_3446;
					word32 a0_864;
					Eq_2 ra_869 = mbedtls_md_hmac_finish(mbedtls_md_hmac_update(mbedtls_md_hmac_update(mbedtls_md_hmac_update(mbedtls_md_hmac_update(ra, (word32) fp - 44, a4_794, a5_822, dwLoc90, out a0_826, out a4_828, out a5_829), a0_826 + 0x0044, a4_828, a5_829, dwLoc90, out a0_835, out a4_837, out a5_838), a0_835 + 0x0044, a4_837, a5_838, dwLoc90, out a0_844, out a4_846, out a5_847), a0_844 + 0x0044, a4_846, a5_847, dwLoc90, out a0_854, out a4_856, out a5_857), a0_854->dw0034, s1_431, &a0_854->dw0034 + 4, a5_857 + a1_797 / 0x0C, a4_856, a5_857, s2_1043, dwArg60, dwArg64, dwArg88, out s1_3443, out a0_864, out a1_865, out a2_3444, out a4_3445, out a5_3446, out s2_1043);
					struct Eq_307504 * a5_874 = null;
					do
					{
						up32 a5_887;
						ra_869 = mbedtls_md_process(ra_869, a0_864 + 0x0044, a5_874, dwLoc90, out a0_864, out a5_887);
						a5_874 = a5_887 + 0x01;
					} while (a5_887 + 0x01 < s5_825 + 0x01);
					word32 a4_3448;
					word32 a5_3449;
					word32 s0_3447;
					ra = mbedtls_md_hmac_reset(ra_869, a0_864 + 0x0044, a1_865, a5_887 + 0x01, out s0_3447, out a4_3448, out a5_3449);
					word32 a5_914;
					word32 a4_918;
					word32 a2_3451;
					word32 a3_3452;
					word32 a7_3453;
					word32 a1_3450;
					mbedtls_debug_print_buf(ra, 0x04, (word32) fp - 112, out a1_3450, out a2_3451, out a3_3452, out a4_918, out a5_914, out a7_3453);
					int32 a1_937;
					struct Eq_307361 * a2_938;
					word32 a7_3456;
					word32 a4_3454;
					word32 a5_3455;
