pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
					struct Eq_294369 * a0_935 = mbedtls_debug_print_buf(ra, 0x04, a5_914 + a4_918, out a1_937, out a2_938, out a3_1854, out a4_3454, out a5_3455, out a7_3456);
					ui32 a4_950 = 0x00;
					for (a5_761 = null; a2_938 != a5_761; ++a5_761)
					{
						a3_1854 = CONVERT(Mem882[a0_935 + a5_761 + a1_937:byte], byte, word32) ^ CONVERT(Mem882[(fp + -112) + a5_761:byte], byte, word32);
						a4_950 |= a3_1854;
					}
					if (a4_950 == 0x00 && s2_1043 != 0x00)
						goto l2305CD3C;
					goto l2305CBE4;
				}
l2305CD3C:
				Eq_2 s0_972 = a5_761[112];
				if (a5_761 == null)
				{
					Eq_2 a5_974 = *((word32) s0_972 + 0x0084);
					*((word32) s0_972 + 0x0084) = (word32) a5_974 + 1;
					a5_761 = (word32) a5_974 + 1;
					if (a5_974 <= ~0x01)
						goto l2305CF7A;
					word32 a1_3457;
					word32 a2_3458;
					word32 a3_3459;
					word32 a5_3461;
					word32 s8_3467;
					word32 s10_3469;
					word32 s11_3470;
					word32 t4_3471;
					word32 s9_3468;
					word32 s6_3465;
					word32 s7_3466;
					word32 a7_3462;
					word32 s4_3463;
					word32 s5_3464;
					word32 a4_3460;
					mbedtls_debug_print_msg(ra, s0_972, 0x01, &g_t23089C14, (word32) a5_974 + 1, out a1_3457, out a2_3458, out a3_3459, out a4_3460, out a5_3461, out a7_3462, out s4_3463, out s5_3464, out s6_3465, out s7_3466, out s8_3467, out s9_3468, out s10_3469, out s11_3470, out t4_3471);
					goto l2305CBE4;
				}
				((word32) s0_972 + 0x0084)->u0 = 0x00;
l2305CF7A:
				ui32 a5_982 = (word32) a5_761[116];
				Eq_2 s0_1001 = a5_761->dw0000;
				uint32 a4_981 = 0x08;
				Eq_2 a5_1003 = a5_982 & 0x02;
				if ((a5_982 & 0x02) != 0x00)
				{
l2305CF86:
					word32 s11_3483;
					Eq_2 a5_1055;
					Eq_2 s4_1063;
					word32 t4_3484;
					word32 s10_3482;
					word32 s5_3477;
					word32 s8_3480;
					word32 s9_3481;
					word32 s6_3478;
					word32 s7_3479;
					word32 a4_3475;
					word32 a7_3476;
					word32 a3_3474;
					word32 a1_3472;
					word32 a2_3473;
					mbedtls_debug_print_msg(ra, s0_1001, 0x02, &g_t23089C78, a5_1003, out a1_3472, out a2_3473, out a3_3474, out a4_3475, out a5_1055, out a7_3476, out s4_1063, out s5_3477, out s6_3478, out s7_3479, out s8_3480, out s9_3481, out s10_3482, out s11_3483, out t4_3484);
					word32 a1_3485;
					word32 a3_3487;
					word32 a7_3488;
					word32 a2_3486;
					mbedtls_debug_print_buf(ra, 0x04, a5_1055, out a1_3485, out a2_3486, out a3_3487, out a4_1087, out a5_1083, out a7_3488);
					s2_1043.u0 = 0x01000000;
					Eq_2 s0_1093 = *((word32) a5_1083 + 112);
					if (s4_1063 >= a5_1083)
						goto l2305D038;
					word32 a7_3493;
					word32 t4_3502;
					word32 s5_3495;
					word32 s6_3496;
					word32 s7_3497;
					word32 s8_3498;
					word32 s9_3499;
					word32 s10_3500;
					word32 s11_3501;
					word32 s4_3494;
					word32 a3_3491;
					word32 a4_3492;
					word32 a1_3489;
					word32 a2_3490;
					mbedtls_debug_print_msg(ra, s0_1093, 0x01, &g_t23089A00, a5_1083, out a1_3489, out a2_3490, out a3_3491, out a4_3492, out a5_1233, out a7_3493, out s4_3494, out s5_3495, out s6_3496, out s7_3497, out s8_3498, out s9_3499, out s10_3500, out s11_3501, out t4_3502);
					s6_1252 = ~0x070001FF;
					goto l2305CE32;
				}
				while (true)
				{
					ui32 a5_987 = (word32) *((word32) a5_1003 + 116);
					a5_1003 = a5_987 & 0x02;
					if ((a5_987 & 0x02) >= a4_981)
						break;
					uint32 a2_992 = a4_981 + -1;
					a3_1854 += a2_992 / 0x0700;
					a5_1003 = (word32) a3_1854->b0000 + 0x01 & 0x00FF;
					a3_1854->b0000 = (byte) a5_1003;
					if (a5_1003 != 0x00)
						break;
					a4_981 = a2_992;
				}
				ui32 a5_1002 = (word32) *((word32) a5_1003 + 116);
				s0_1001 = *a5_1003;
				a5_1003 = a5_1002 & 0x02;
				if (a4_981 != (a5_1002 & 0x02))
					goto l2305CF86;
				word32 t4_3517;
				word32 s5_3510;
				word32 s10_3515;
				word32 s11_3516;
				word32 s6_3511;
				word32 s8_3513;
				word32 s9_3514;
				word32 s7_3512;
				word32 a4_3506;
				word32 a5_3507;
				word32 a7_3508;
				word32 s4_3509;
				word32 a1_3503;
				word32 a2_3504;
				word32 a3_3505;
				mbedtls_debug_print_msg(ra, s0_1001, 0x01, &g_t23089C54, a5_1002 & 0x02, out a1_3503, out a2_3504, out a3_3505, out a4_3506, out a5_3507, out a7_3508, out s4_3509, out s5_3510, out s6_3511, out s7_3512, out s8_3513, out s9_3514, out s10_3515, out s11_3516, out t4_3517);
				s6_1042.u0 = 0xF9000480;
			}
			else
			{
l2305CD9C:
				a4_1313 = (struct Eq_274 *) &g_t23089B88;
l2305CACC:
				word32 s5_3403;
				word32 s6_3404;
				word32 s7_3405;
				word32 s9_3407;
				word32 s10_3408;
				word32 s11_3409;
				word32 t4_3410;
				word32 s8_3406;
				word32 s4_3402;
				word32 a2_3397;
				word32 a5_3400;
				word32 a7_3401;
				word32 a3_3398;
				word32 a4_3399;
				word32 a1_3396;
				mbedtls_debug_print_msg(ra, s0_1320, 0x01, a4_1313, s2_1043, out a1_3396, out a2_3397, out a3_3398, out a4_3399, out a5_3400, out a7_3401, out s4_3402, out s5_3403, out s6_3404, out s7_3405, out s8_3406, out s9_3407, out s10_3408, out s11_3409, out t4_3410);
l2305CBE4:
				s6_1042.u0 = ~0x0700017F;
			}
		}
		else
		{
l2305CA3A:
l2305CA46:
			word32 a7_3386;
			word32 s11_3394;
			word32 t4_3395;
			word32 s10_3393;
			word32 s5_3388;
			word32 s6_3389;
			word32 s7_3390;
			word32 s8_3391;
			word32 s9_3392;
			word32 s4_3387;
			word32 a4_3384;
			word32 a5_3385;
			word32 a1_3381;
			word32 a2_3382;
			word32 a3_3383;
			mbedtls_debug_print_msg(ra, s0_1320, 0x01, &g_t23088F14, a5_1393, out a1_3381, out a2_3382, out a3_3383, out a4_3384, out a5_3385, out a7_3386, out s4_3387, out s5_3388, out s6_3389, out s7_3390, out s8_3391, out s9_3392, out s10_3393, out s11_3394, out t4_3395);
			s6_1042.u0 = 0xF9000400;
		}
l2305CE16:
		word32 s10_3309;
		word32 s11_3310;
		word32 s7_3306;
		word32 s8_3307;
		word32 s9_3308;
		word32 s5_3305;
		word32 a1_3300;
		word32 a2_3301;
		word32 a3_3302;
		word32 a4_3303;
		word32 s4_3304;
		mbedtls_debug_print_ret(ra, 0x01, 0x00FFFE79, s6_1042, out a1_3300, out a2_3301, out a3_3302, out a4_3303, out a5_1233, out s4_3304, out s5_3305, out s6_1252, out s7_3306, out s8_3307, out s9_3308, out s10_3309, out s11_3310);
l2305CE32:
		if (((word32) a5_1233->w0074 & 0x02) == 0x00 || (s6_1252 & -0x0081) != ~0x070001FF)
			goto l2305C700;
		s0_1469 = *(union Eq_2 *) ~0x070001FB;
		a5_1471.u0 = ~0x0700020A;
		if (false)
			goto l2305C700;
		a4_1474 = (struct Eq_274 *) &g_t23089CB4;
l2305C84C:
		word32 s8_3237;
		word32 a1_3227;
		word32 s9_3238;
		word32 a2_3228;
		word32 s5_3234;
		word32 a5_3231;
		word32 a3_3229;
		word32 a7_3232;
		word32 s4_3233;
		word32 a4_3230;
		word32 t4_3241;
		word32 s6_3235;
		word32 s7_3236;
		word32 s10_3239;
		word32 s11_3240;
		a0_1699 = mbedtls_debug_print_msg(ra, s0_1469, 0x01, a4_1474, a5_1471, out a1_3227, out a2_3228, out a3_3229, out a4_3230, out a5_3231, out a7_3232, out s4_3233, out s5_3234, out s6_3235, out s7_3236, out s8_3237, out s9_3238, out s10_3239, out s11_3240, out t4_3241);
	}
	a5_1223 = a0_55;
	a3_1225.u0 = 0x00FFFEE7;
l2305C75A:
	word32 s10_3286;
	word32 s11_3287;
	word32 s9_3285;
	word32 s4_3280;
	word32 s7_3283;
	word32 s8_3284;
	word32 s5_3281;
	word32 s6_3282;
	word32 a3_3277;
	word32 a4_3278;
	word32 a5_3279;
	word32 a2_3276;
	word32 a1_3275;
	mbedtls_debug_print_ret(ra, 0x01, a3_1225, a5_1223, out a1_3275, out a2_3276, out a3_3277, out a4_3278, out a5_3279, out s4_3280, out s5_3281, out s6_3282, out s7_3283, out s8_3284, out s9_3285, out s10_3286, out s11_3287);
l2305C700:
	a0Out = dwLoc18;
	a4Out = dwLoc38;
	s3Out = s3;
	mstatusOut = mstatus;
	return ra;
}

// 2305D0B0: Register Eq_2 mbedtls_ssl_read_record(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack ptr32 dwArg40, Stack word32 dwArg44, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack word32 dwArg0168, Register out Eq_2 a0Out, Register out (ptr32 Eq_307850) a1Out, Register out ptr32 a3Out, Register out (ptr32 Eq_307852) a4Out, Register out (ptr32 Eq_307853) a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      mbedtls_ssl_parse_certificate
//      mbedtls_ssl_parse_change_cipher_spec
//      mbedtls_ssl_parse_finished
//      mbedtls_ssl_read
Eq_2 mbedtls_ssl_read_record(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg38, ptr32 dwArg40, word32 dwArg44, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0128, word32 dwArg0168, union Eq_2 & a0Out, struct Eq_307850 & a1Out, ptr32 & a3Out, struct Eq_307852 & a4Out, struct Eq_307853 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	word32 a1_318;
	word32 a3_319;
	word32 a4_320;
	word32 a5_321;
	word32 a7_322;
	word32 s4_323;
	word32 s5_324;
	word32 s6_325;
	word32 s7_326;
	word32 s8_327;
	word32 s9_328;
	word32 s10_329;
	word32 t4_330;
	Eq_2 s11_34;
	Eq_2 a2_29;
	mbedtls_debug_print_msg(ra, a0, 0x02, &g_t230898D8, a5, out a1_318, out a2_29, out a3_319, out a4_320, out a5_321, out a7_322, out s4_323, out s5_324, out s6_325, out s7_326, out s8_327, out s9_328, out s10_329, out s11_34, out t4_330);
	Eq_2 s2_162 = 0x2308A000;
	Eq_2 s1_23 = a0;
	do
	{
		ptr32 s6_144;
		ptr32 s9_147;
		ptr32 s7_145;
		ptr32 s5_143;
		struct Eq_307850 * a1_135;
		ptr32 a3_137;
		struct Eq_307852 * a4_138;
		struct Eq_307853 * a5_134;
		Eq_2 a5_154;
		Eq_2 a3_156;
		ptr32 s11_141;
		ptr32 s10_140;
		Eq_2 a0_54;
		struct Eq_302558 * a4_58;
		Eq_2 s3_281;
		ra = mbedtls_ssl_read_record_layer(ra, s1_23, s1_23, a2_29, s2_162, s11_34, mstatus, dwArg10, dwArg14, dwArg38, dwArg40, dwArg44, s1, dwArg78, dwArg88, dwArg94, dwArgA8, dwArgB8, dwArgC8, out a0_54, out a4_58, out s3_281, out mstatus);
		Eq_2 s0_114 = a0_54;
		if (a0_54 != 0x00)
		{
			a5_154 = a0_54;
			a3_156.u0 = 0x00FFFEB0;
			goto l2305D0FA;
		}
		Eq_2 a0_85;
		word32 a1_86;
		struct Eq_296880 * a4_89;
		ra = mbedtls_ssl_handle_message_type(ra, a4_58, mstatus, dwArg18, dwArgA8, dwArgB8, dwArgE8, dwArg0128, dwArg0168, out s1_23, out a0_85, out a1_86, out a2_29, out a4_89, out s2_162, out s3_281, out s11_34, out mstatus);
		s0_114 = a0_85;
	} while (a0_85 == s3_281);
	if (a0_85 != 0x00)
	{
		a5_154 = a0_85;
		a3_156.u0 = 0x00FFFEBA;
l2305D0FA:
		word32 a2_331;
		word32 s4_332;
		word32 s8_333;
		mbedtls_debug_print_ret(ra, 0x01, a3_156, a5_154, out a1_135, out a2_331, out a3_137, out a4_138, out a5_134, out s4_332, out s5_143, out s6_144, out s7_145, out s8_333, out s9_147, out s10_140, out s11_141);
	}
	else
	{
		Eq_2 s1_115 = a4_89->t006C;
		Eq_2 a5_116 = 22;
		if (a4_89 == (struct Eq_296880 *) 22)
			a5_116 = mbedtls_ssl_update_handshake_status(ra, a1_86, a4_89);
		word32 a2_334;
		word32 a7_335;
		word32 s4_336;
		word32 s8_337;
		word32 t4_338;
		mbedtls_debug_print_msg(ra, s1_115, 0x02, &g_t23089928, a5_116, out a1_135, out a2_334, out a3_137, out a4_138, out a5_134, out a7_335, out s4_336, out s5_143, out s6_144, out s7_145, out s8_337, out s9_147, out s10_140, out s11_141, out t4_338);
	}
	a0Out = s0_114;
	a1Out = a1_135;
	a3Out = a3_137;
	a4Out = a4_138;
	a5Out = a5_134;
	s2Out = s2_162;
	s3Out = s3_281;
	s4Out = dwArg04;
	s5Out = s5_143;
	s6Out = s6_144;
	s7Out = s7_145;
	s9Out = s9_147;
	s10Out = s10_140;
	s11Out = s11_141;
	mstatusOut = mstatus;
	return ra;
}

