pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305D160: void mbedtls_ssl_parse_certificate(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_308003) s1, Register (ptr32 Eq_2) a5, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack ptr32 dwArg10, Stack word32 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack word32 dwArg0114, Stack Eq_2 dwArg0128, Stack word32 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void mbedtls_ssl_parse_certificate(Eq_2 ra, Eq_2 s0, struct Eq_308003 * s1, union Eq_2 * a5, Eq_2 s2, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg08, ptr32 dwArg10, word32 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, word32 dwArg0114, Eq_2 dwArg0128, word32 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 a0_27 = *a5;
	struct Eq_308036 * s5_45;
	word32 a3_1543;
	word32 a5_1545;
	word32 a4_1544;
	word32 a1_1541;
	word32 a2_1542;
	word32 s4_1547;
	word32 s7_1549;
	word32 s6_1548;
	word32 a7_1546;
	word32 s11_1553;
	word32 t4_1554;
	word32 s8_1550;
	word32 s9_1551;
	word32 s10_1552;
	mbedtls_debug_print_msg(ra, a0_27, 0x02, &g_t23089350, s1->t0074, out a1_1541, out a2_1542, out a3_1543, out a4_1544, out a5_1545, out a7_1546, out s4_1547, out s5_45, out s6_1548, out s7_1549, out s8_1550, out s9_1551, out s10_1552, out s11_1553, out t4_1554);
	word32 a3_54 = (word32) s5_45->b000A;
	Eq_2 s0_34 = a0_27;
	Eq_2 s1_56 = s1 >> 2 & 0x03;
	struct Eq_308084 * a4_58 = a3_54 + -5 & 0x00FF;
	Eq_2 a5_59 = 0x06;
	if (a4_58 <= (struct Eq_308084 *) 0x06)
	{
		uint32 a5_62 = 75 >> a4_58;
		a5_59 = a5_62 & 0x01;
		if ((a5_62 & 0x01) != 0x00)
			goto l2305D1D0;
	}
	ui32 a5_67 = (word32) *((word32) a5_59 + 116);
	s0_34 = *a5_59;
	a5_59 = a5_67 & 0x01;
	if ((a5_67 & 0x01) != 0x00)
	{
		a4_58 = (struct Eq_308084 *) 0x07;
		if (a3_54 == 0x07)
			goto l2305D216;
	}
	Eq_2 s0_74 = a4_58->t0030;
	Eq_2 s4_75 = a4_58->t000C;
	if (s4_75 == 0x03)
		s4_75 = s1_56;
	if ((a5_67 & 0x01) != 0x00 && s4_75 == 0x00)
	{
		s0_34 = (a5_67 & 0x01)->t002C;
		*(struct Eq_50194 **) 0xE0 = a5_67 & 0x01;
l2305D1D0:
		struct Eq_308127 * a5_864;
		word32 s9_1565;
		word32 a3_1557;
		word32 a2_1556;
		word32 a1_1555;
		word32 s7_1563;
		word32 s6_1562;
		word32 s5_1561;
		word32 a4_1558;
		word32 a7_1559;
		word32 s4_1560;
		word32 s11_1567;
		word32 s8_1564;
		word32 s10_1566;
		word32 t4_1568;
		mbedtls_debug_print_msg(ra, s0_34, 0x02, &g_t23089368, a5_59, out a1_1555, out a2_1556, out a3_1557, out a4_1558, out a5_864, out a7_1559, out s4_1560, out s5_1561, out s6_1562, out s7_1563, out s8_1564, out s9_1565, out s10_1566, out s11_1567, out t4_1568);
		a5_864->dw0005 = a5_864->dw0004;
		goto l2305D1E0;
	}
	Eq_2 a5_352;
	Eq_2 a3_354;
	struct Eq_308172 * a5_108;
	word32 s2_1571;
	word32 a4_1570;
	word32 s6_1574;
	word32 s3_1572;
	word32 s4_1573;
	word32 a3_1569;
	word32 s7_1575;
	word32 s9_1576;
	Eq_2 a0_133;
	Eq_2 a1_104;
	Eq_2 s5_120;
	ptr32 mstatus_111;
	Eq_2 s10_115;
	Eq_2 s11_116;
	Eq_2 ra_112 = mbedtls_ssl_read_record(ra, s1_56, s0_74, a5_67 & 0x01, mstatus, s2, s0, dwLoc18, dwArg08, dwArg10, dwArg14, dwArg48, s5, ra, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgF8, dwArg0138, out a0_133, out a1_104, out a3_1569, out a4_1570, out a5_108, out s2_1571, out s3_1572, out s4_1573, out s5_120, out s6_1574, out s7_1575, out s9_1576, out s10_115, out s11_116, out mstatus_111);
	Eq_2 s1_134 = a0_133;
	if (a0_133 != 0x00)
	{
		a5_352 = a0_133;
		a3_354.u0 = 0x010000BF;
		goto l2305D262;
	}
	Eq_2 s0_150;
	a5_108->dw0005 = a5_108->dw0004;
	ui32 a5_139 = (word32) a5_108->w0075;
	struct Eq_308232 * a4_140 = a5_139 & 1;
	if ((a5_139 & 1) != 0x00)
	{
		struct Eq_308245 * s0_141 = (a5_139 & 1)->ptr000C;
		if ((a5_139 & 1) != 0x00)
		{
			struct Eq_308253 * a3_143 = s0_141->ptr0080;
			a4_140 = (struct Eq_308232 *) 0x04;
			if ((a5_139 & 0x02) != 0x00)
				a4_140 = (struct Eq_308232 *) 0x0C;
			if (a3_143 == &a4_140->b0000 + 3)
			{
				s0_150 = a3_143->t006C;
				if (a3_143 != (struct Eq_308253 *) 22)
				{
l2305D2A2:
					word32 a4_1580;
					word32 s9_1588;
					word32 s11_1590;
					word32 a5_1581;
					word32 s7_1586;
					word32 t4_1591;
					word32 a1_1577;
					word32 a2_1578;
					word32 a3_1579;
					word32 s8_1587;
					word32 s6_1585;
					word32 s4_1583;
					word32 s5_1584;
					word32 a7_1582;
					word32 s10_1589;
					mbedtls_debug_print_msg(ra_112, s0_150, 0x01, &g_t2308939C, 22, out a1_1577, out a2_1578, out a3_1579, out a4_1580, out a5_1581, out a7_1582, out s4_1583, out s5_1584, out s6_1585, out s7_1586, out s8_1587, out s9_1588, out s10_1589, out s11_1590, out t4_1591);
					goto l2305D1E0;
				}
				Eq_2 s0_153 = *((word32) a0_133 + 100);
				if ((word32) *a0_133 != 11)
				{
l2305D31C:
					Eq_2 s0_173 = a4_140->t0064;
					Eq_2 a5_174 = 11;
					if ((word32) a4_140->b0000 == 11)
					{
						s0_173 = *(union Eq_2 *) 11;
						Eq_2 a3_177 = *((word32) s0_173 + 0x0080);
						int32 s3_178 = 0x04;
						if (((word32) *(uint16 *) 0x7F & 0x02) != 0x00)
							s3_178 = 0x0C;
						a5_174 = s3_178 + 6;
						if (a3_177 >= a5_174)
						{
							struct Eq_308347 * a4_186 = a4_140 + s3_178 / 112;
							Eq_2 a4_190 = (word32) a4_186->b0000;
							a5_174 = (word32) a4_186->b0001 << 8 | (word32) a4_186->b0002;
							if (a4_190 == 0x00)
							{
								a5_174 = (word32) a5_174 + (s3_178 + 0x03);
								if (a3_177 == a5_174)
								{
									Eq_2 a5_199 = *((word32) a0_133 + 92);
									if (a0_133 != 0x00)
									{
										Eq_2 a0_216;
										Eq_2 a2_218;
										word32 s1_1630;
										word32 a5_1632;
										word32 s3_1633;
										word32 a1_1631;
										word32 s0_1629;
										word32 s4_1634;
										word32 s8_1635;
										ra_112 = mbedtls_x509_crt_free(ra_112, a0_133, a1_104, a5_199, mstatus_111, dwArg0108, dwArg0148, out s0_1629, out s1_1630, out a0_216, out a1_1631, out a2_218, out a5_1632, out s3_1633, out s4_1634, out s8_1635);
										word32 t3_1642;
										word32 s4_1641;
										word32 a6_1640;
										word32 a2_1639;
										word32 s0_1636;
										word32 a0_1637;
										word32 a1_1638;
										vPortFree(a0_216, a2_218, *((word32) a0_216 + 92), mstatus_111, dwArg0128, dwArg0168, out s0_1636, out s1_134, out a0_1637, out a1_1638, out a2_1639, out a3_177, out a4_190, out a5_199, out a6_1640, out s4_1641, out t3_1642);
									}
									struct Eq_308464 * a5_265;
									Eq_2 s0_268;
									word32 s1_269;
									word32 s2_1626;
									word32 s8_1628;
									word32 s4_1627;
									word32 a1_1622;
									word32 a2_1623;
									word32 a3_1624;
									word32 a4_1625;
									struct Eq_308474 * s3_271;
									Eq_2 ra_267 = mycalloc(ra_112, s1_134, 0x01, 308, a3_177, a4_190, a5_199, mstatus_111, dwLoc10, dwLoc0C, dwArgE8, dwArg0128, out s0_268, out s1_269, out a1_1622, out a2_1623, out a3_1624, out a4_1625, out a5_265, out s2_1626, out s3_271, out s4_1627, out s8_1628);
									*(word32 *) 0x5D = s1_269;
									if (false)
									{
										word32 s11_1657;
										word32 t4_1658;
										word32 s10_1656;
										word32 s9_1655;
										word32 s8_1654;
										word32 s4_1650;
										word32 s5_1651;
										word32 s6_1652;
										word32 s7_1653;
										word32 a5_1648;
										word32 a7_1649;
										word32 a2_1645;
										word32 a3_1646;
										word32 a4_1647;
										word32 a1_1644;
										mbedtls_debug_print_msg(ra_267, s0_268, 0x01, &g_t23089DD4, 308, out a1_1644, out a2_1645, out a3_1646, out a4_1647, out a5_1648, out a7_1649, out s4_1650, out s5_1651, out s6_1652, out s7_1653, out s8_1654, out s9_1655, out s10_1656, out s11_1657, out t4_1658);
										goto l2305D1E0;
									}
									struct Eq_308539 * s0_279 = a5_265->ptr002C;
									Eq_2 s7_283 = 0x007F;
									Eq_2 s6_284 = ~0x0200062D;
									word32 a3_1643;
									struct Eq_308548 * a1_286;
									Eq_2 a0_285;
									struct Eq_308550 * a5_290;
									ra_112 = mbedtls_x509_crt_init(ra_267, 0x01, out a0_285, out a1_286, out a3_1643, out a5_290);
									do
									{
										struct Eq_308474 * a4_296 = s0_279->dw0080;
										if (s3_271 >= a4_296)
										{
											struct Eq_308604 * a0_374;
											Eq_2 s1_378;
											Eq_2 s9_380;
											Eq_2 a1_386;
											struct Eq_308608 * a2_387;
											Eq_2 s10_391;
											Eq_2 s11_392;
											Eq_308611 s3_393;
											word32 s4_394;
											Eq_2 s7_395;
											struct Eq_308614 * a3_375;
											Eq_2 s0_390;
											Eq_2 a5_384;
											Eq_2 ra_377 = mbedtls_debug_print_crt(ra_112, 0x03, 0x230893F0, a5_290->dw005C, out s0_390, out s1_378, out a0_374, out a1_386, out a2_387, out a3_375, out a5_384, out s3_393, out s4_394, out s7_395, out s9_380, out s10_391, out s11_392);
											if (s4_394 != 0x00)
											{
												Eq_2 s0_402 = a3_375->t0000;
												Eq_2 a5_403 = *((word32) a1_386 + 20);
												if (a1_386 == 0x00)
												{
													a3_375 = a2_387->ptr0054;
													if (a1_386 == 0x00)
													{
														word32 s8_1740;
														word32 s9_1741;
														word32 s10_1742;
														word32 s11_1743;
														word32 t4_1744;
														word32 a7_1735;
														word32 s4_1736;
														word32 s7_1739;
														word32 s5_1737;
														word32 s6_1738;
														word32 a2_1731;
														word32 a3_1732;
														word32 a5_1734;
														word32 a4_1733;
														word32 a1_1730;
														mbedtls_debug_print_msg(ra_377, s0_402, 0x01, &g_t23089404, a5_403, out a1_1730, out a2_1731, out a3_1732, out a4_1733, out a5_1734, out a7_1735, out s4_1736, out s5_1737, out s6_1738, out s7_1739, out s8_1740, out s9_1741, out s10_1742, out s11_1743, out t4_1744);
														goto l2305D1E0;
													}
												}
												Eq_2 a0_454;
												Eq_2 a5_459;
												struct Eq_308725 * a4_458;
												struct Eq_299479 * s5_471;
												ra_377 = mbedtls_x509_crt_verify_with_profile(ra_377, s1_378, a0_374->t005C, a1_386, a3_375->t0048, a0_374->ptr002C->t00B4, (char *) &a0_374->t005C + 4, a3_375->t0034, a3_375->t0038, s3_393, s7_395, s9_380, s10_391, s11_392, mstatus_111, dwLoc2C, dwLoc08, dwArg28, dwArg78, dwArg88, dwArg98, out a0_454, out a4_458, out a5_459, out s5_471);
												if (a0_454 != 0x00)
												{
													word32 s7_1680;
													word32 s8_1681;
													word32 s9_1682;
													word32 s10_1683;
													word32 s11_1684;
													word32 s4_1678;
													word32 s6_1679;
													word32 a1_1675;
													word32 a2_1676;
													word32 a3_1677;
													mbedtls_debug_print_ret(ra_377, 0x01, 0x01000180, a0_454, out a1_1675, out a2_1676, out a3_1677, out a4_458, out a5_459, out s4_1678, out s5_471, out s6_1679, out s7_1680, out s8_1681, out s9_1682, out s10_1683, out s11_1684);
												}
												Eq_2 s0_514 = *((word32) a5_459 + 44);
												Eq_2 s3_516 = *((word32) a5_459 + 92);
												word32 a5_1674;
												Eq_2 a0_518 = mbedtls_pk_can_do((word32) s3_516 + 188, 0x02, a5_459, out a5_1674);
												if (a0_518 != 0x00)
												{
													Eq_27976 a5_522 = *((word32) s3_516 + 0x00C0);
													Eq_2 a5_527;
													a0_518 = mbedtls_ssl_check_curve((word32) *a5_522, a5_522, out a4_458, out a5_527);
													if (a0_518 != 0x00)
													{
														word32 t4_1702;
														word32 s11_1701;
														word32 s6_1696;
														word32 s7_1697;
														word32 s8_1698;
														word32 s9_1699;
														word32 s10_1700;
														word32 a7_1694;
														word32 s4_1695;
														word32 a2_1691;
														word32 a3_1692;
														word32 a5_1693;
														word32 a1_1690;
														a0_518 = mbedtls_debug_print_msg(ra_377, s0_514, 0x01, &g_t23089428, a5_527, out a1_1690, out a2_1691, out a3_1692, out a4_458, out a5_1693, out a7_1694, out s4_1695, out s5_471, out s6_1696, out s7_1697, out s8_1698, out s9_1699, out s10_1700, out s11_1701, out t4_1702);
													}
												}
												word32 a0_574;
												Eq_2 a5_579;
												word32 s1_582;
												word32 s3_1688;
												word32 s8_1689;
												word32 s4_585;
												s0_390 = mbedtls_ssl_check_cert_usage(a0_518, s5_471, ~(word32) a4_458->w0074 & 0x01, out s1_582, out a0_574, out a5_579, out s3_1688, out s4_585, out s8_1689);
												if (a0_574 != 0x00)
												{
													word32 a1_1716;
													word32 s6_1723;
													word32 s11_1728;
													word32 t4_1729;
													word32 s10_1727;
													word32 s8_1725;
													word32 s9_1726;
													word32 s7_1724;
													word32 s5_1722;
													word32 a2_1717;
													word32 a3_1718;
													word32 a4_1719;
													word32 a5_1720;
													word32 a7_1721;
													mbedtls_debug_print_msg(ra_377, s0_390, 0x01, &g_t23089448, a5_579, out a1_1716, out a2_1717, out a3_1718, out a4_1719, out a5_1720, out a7_1721, out s4_585, out s5_1722, out s6_1723, out s7_1724, out s8_1725, out s9_1726, out s10_1727, out s11_1728, out t4_1729);
												}
												a5_384.u0 = 0x01;
											}
											word32 s11_1672;
											word32 t4_1673;
											word32 s10_1671;
											word32 s9_1670;
											word32 s8_1669;
											word32 s4_1665;
											word32 s5_1666;
											word32 s6_1667;
											word32 s7_1668;
											word32 a5_1663;
											word32 a7_1664;
											word32 a2_1660;
											word32 a3_1661;
											word32 a4_1662;
											word32 a1_1659;
											mbedtls_debug_print_msg(ra_377, s0_390, 0x02, &g_t2308946C, a5_384, out a1_1659, out a2_1660, out a3_1661, out a4_1662, out a5_1663, out a7_1664, out s4_1665, out s5_1666, out s6_1667, out s7_1668, out s8_1669, out s9_1670, out s10_1671, out s11_1672, out t4_1673);
											goto l2305D1E0;
										}
										a5_174 = a1_286 + s3_271;
										s0_173 = a1_286->dw0064;
										Eq_2 a3_301 = (word32) *a5_174;
										if (a3_301 != 0x00)
											goto l2305D350;
										Eq_2 a2_305 = (word32) *((word32) a5_174 + 1) << 8 | (word32) (*((word32) a5_174 + 2));
										a5_174 = (char *) s3_271 + 3;
										if (s7_283 >= a2_305 || a4_296 <u a2_305 + a5_174)
											goto l2305D350;
										word32 s9_1687;
										word32 s8_1686;
										word32 a2_1685;
										ra_112 = mbedtls_x509_crt_parse_der(ra_112, a4_296->t002C, a0_285, a1_286 + a5_174, a2_305, a3_301, Mem278[a0_285 + 92:word32], a5_174, s5_120, s6_284, s7_283, s10_115, s11_116, mstatus_111, dwLoc2C, s6, s0, dwLoc18, dwArg08, dwArg18, dwArg24, dwArg28, dwArg38, dwArg48, s5, dwArg68, dwArg78, dwArg94, dwArg98, dwArgB8, dwArgD8, dwArg0114, out s0_279, out a0_285, out a1_286, out a2_1685, out a5_290, out s3_271, out s5_120, out s6_284, out s7_283, out s8_1686, out s9_1687, out s10_115, out s11_116, out mstatus_111);
									} while (a0_285 == 0x00 || a0_285 == s6_284);
									a5_352 = a0_285;
									a3_354.u0 = 0x01000138;
l2305D262:
									word32 s7_1711;
									word32 s8_1712;
									word32 s11_1715;
									word32 s9_1713;
									word32 s10_1714;
									word32 a5_1707;
									word32 s4_1708;
									word32 s6_1710;
									word32 s5_1709;
									word32 a2_1704;
									word32 a4_1706;
									word32 a3_1705;
									word32 a1_1703;
									mbedtls_debug_print_ret(ra_112, 0x01, a3_354, a5_352, out a1_1703, out a2_1704, out a3_1705, out a4_1706, out a5_1707, out s4_1708, out s5_1709, out s6_1710, out s7_1711, out s8_1712, out s9_1713, out s10_1714, out s11_1715);
l2305D1E0:
									0x00 = (uint16) dwArg0128;
									return;
								}
							}
l2305D350:
							word32 s4_1613;
							word32 a5_1611;
							word32 a7_1612;
							word32 s8_1617;
							word32 s9_1618;
							word32 s10_1619;
							word32 s11_1620;
							word32 t4_1621;
							word32 a2_1608;
							word32 a3_1609;
							word32 a4_1610;
							word32 a1_1607;
							word32 s6_1615;
							word32 s7_1616;
							word32 s5_1614;
							mbedtls_debug_print_msg(ra_112, s0_173, 0x01, &g_t2308939C, a5_174, out a1_1607, out a2_1608, out a3_1609, out a4_1610, out a5_1611, out a7_1612, out s4_1613, out s5_1614, out s6_1615, out s7_1616, out s8_1617, out s9_1618, out s10_1619, out s11_1620, out t4_1621);
							goto l2305D1E0;
						}
					}
					goto l2305D350;
				}
				Eq_2 a5_161;
				word32 a2_1592;
				word32 a3_1593;
				a0_133 = memcmp(a0_133 + a4_140, 587763268, 0x03, out a1_104, out a2_1592, out a3_1593, out a4_140, out a5_161);
				s1_134 = a0_133;
				if (a0_133 == 0x00)
				{
					word32 a5_744;
					word32 s4_752;
					word32 a7_1598;
					word32 s8_1602;
					word32 a3_1596;
					word32 a1_1594;
					word32 a2_1595;
					word32 a4_1597;
					word32 s9_1603;
					word32 t4_1606;
					word32 s10_1604;
					word32 s11_1605;
					word32 s6_1600;
					word32 s7_1601;
					word32 s5_1599;
					mbedtls_debug_print_msg(ra_112, s0_153, 0x01, &g_t230893B4, a5_161, out a1_1594, out a2_1595, out a3_1596, out a4_1597, out a5_744, out a7_1598, out s4_752, out s5_1599, out s6_1600, out s7_1601, out s8_1602, out s9_1603, out s10_1604, out s11_1605, out t4_1606);
					*(word32 *) 0xA0 = a5_744;
					goto l2305D1E0;
				}
			}
		}
	}
	s0_150 = a4_140->t006C;
	if (a4_140 != (struct Eq_308232 *) 22)
		goto l2305D2A2;
	goto l2305D31C;
}

