pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305D598: void mbedtls_ssl_parse_change_cipher_spec(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack ptr32 dwArg20, Stack word32 dwArg24, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack word32 dwArg0148)
void mbedtls_ssl_parse_change_cipher_spec(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg18, ptr32 dwArg20, word32 dwArg24, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0108, word32 dwArg0148)
{
	Eq_2 a5_27;
	word32 s11_414;
	word32 t4_415;
	word32 s7_410;
	word32 s10_413;
	word32 s8_411;
	word32 s9_412;
	word32 a7_406;
	word32 s6_409;
	word32 s4_407;
	word32 s5_408;
	word32 a1_402;
	word32 a4_405;
	word32 a2_403;
	word32 a3_404;
	mbedtls_debug_print_msg(ra, a0, 0x02, &g_t23089484, a5, out a1_402, out a2_403, out a3_404, out a4_405, out a5_27, out a7_406, out s4_407, out s5_408, out s6_409, out s7_410, out s8_411, out s9_412, out s10_413, out s11_414, out t4_415);
	struct Eq_309118 * a4_50;
	word32 s3_61;
	Eq_2 a0_76;
	word32 a5_418;
	word32 s4_420;
	word32 s5_421;
	word32 s2_419;
	word32 s6_422;
	word32 s9_424;
	word32 s10_425;
	word32 s7_423;
	word32 mstatus_427;
	word32 s11_426;
	word32 a3_417;
	word32 a1_416;
	Eq_2 ra_126 = mbedtls_ssl_read_record(ra, s1, a0, a5_27, mstatus, dwLoc10, dwLoc0C, dwLoc08, dwArg18, dwArg20, dwArg24, dwArg58, s1, dwArg74, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArg0108, dwArg0148, out a0_76, out a1_416, out a3_417, out a4_50, out a5_418, out s2_419, out s3_61, out s4_420, out s5_421, out s6_422, out s7_423, out s9_424, out s10_425, out s11_426, out mstatus_427);
	if (a0_76 == 0x00)
	{
		Eq_2 s0_78 = a4_50->t006C;
		if (a4_50 == (struct Eq_309118 *) 0x14)
		{
			Eq_2 s0_215 = *(union Eq_2 *) 0x84;
			if (false)
			{
				s0_215 = *(union Eq_2 *) 101;
				if ((word32) *(union Eq_2 *) 0x01 == 0x14)
				{
					struct Eq_309274 * a5_125;
					struct Eq_309275 * a5_92;
					word32 a1_471;
					word32 a2_472;
					word32 a4_473;
					word32 a7_474;
					word32 s4_475;
					word32 s5_476;
					word32 s6_477;
					word32 s7_478;
					word32 s8_479;
					word32 s9_480;
					word32 s10_481;
					word32 s11_482;
					word32 t4_483;
					struct Eq_309289 * a3_123;
					Eq_2 a0_91 = mbedtls_debug_print_msg(ra_126, s0_215, 0x03, &g_t230894C0, 0x14, out a1_471, out a2_472, out a3_123, out a4_473, out a5_92, out a7_474, out s4_475, out s5_476, out s6_477, out s7_478, out s8_479, out s9_480, out s10_481, out s11_482, out t4_483);
					a5_92->dw0034 = a5_92->dw0040;
					a5_92->dw0020 = a5_92->dw002C;
					Eq_2 s0_114 = a5_92->t0000;
					if (((word32) a5_92->w0074 & 0x02) != 0x00)
					{
						uint32 a5_131 = (word32) *((word32) s0_114 + 0x0078) + 0x01 << 16;
						*((word32) s0_114 + 0x0078) = (word16) (a5_131 >> 16);
						a5_125 = a5_131 >> 16;
						if (a5_131 >> 16 == 0x00)
						{
							word32 a1_489;
							word32 a2_490;
							word32 a3_491;
							word32 a4_492;
							word32 a5_493;
							word32 a7_494;
							word32 s4_495;
							word32 s5_496;
							word32 s6_497;
							word32 s7_498;
							word32 s8_499;
							word32 s9_500;
							word32 s10_501;
							word32 s11_502;
							word32 t4_503;
							mbedtls_debug_print_msg(ra_126, s0_114, 0x01, &g_t23089FB8, a5_131 >> 16, out a1_489, out a2_490, out a3_491, out a4_492, out a5_493, out a7_494, out s4_495, out s5_496, out s6_497, out s7_498, out s8_499, out s9_500, out s10_501, out s11_502, out t4_503);
							return;
						}
					}
					else
					{
						word32 t1_484;
						word32 a0_485;
						word32 a1_486;
						word32 a2_487;
						word32 a4_488;
						ra_126 = memset(ra_126, a0_91, 0x00, 0x08, out t1_484, out a0_485, out a1_486, out a2_487, out a3_123, out a4_488, out a5_125);
					}
					word32 s0_139 = a5_125->dw0060;
					if (a3_123 > (struct Eq_309289 *) 0x01)
					{
						s0_139 = a3_123->dw0040;
						a5_125 += (0x01 - *((word32) (*((union Eq_2 *) 0x0D)) + 16)) / 0x0068;
					}
					a5_125->dw0064 = s0_139;
					Eq_2 s0_148 = a5_125->t0004;
					Eq_2 a5_151 = (char *) a5_125 + 1;
					*((word32) a5_151 + 4) = s0_148;
					word32 a1_504;
					word32 a2_505;
					word32 a3_506;
					word32 a4_507;
					word32 a5_508;
					word32 a7_509;
					word32 s4_510;
					word32 s5_511;
					word32 s6_512;
					word32 s7_513;
					word32 s8_514;
					word32 s9_515;
					word32 s10_516;
					word32 s11_517;
					word32 t4_518;
					mbedtls_debug_print_msg(ra_126, s0_148, 0x02, &g_t230894F4, a5_151, out a1_504, out a2_505, out a3_506, out a4_507, out a5_508, out a7_509, out s4_510, out s5_511, out s6_512, out s7_513, out s8_514, out s9_515, out s10_516, out s11_517, out t4_518);
					return;
				}
			}
			word32 a1_456;
			word32 a2_457;
			word32 a3_458;
			word32 a4_459;
			word32 a5_460;
			word32 a7_461;
			word32 s4_462;
			word32 s5_463;
			word32 s6_464;
			word32 s7_465;
			word32 s8_466;
			word32 s9_467;
			word32 s10_468;
			word32 s11_469;
			word32 t4_470;
			mbedtls_debug_print_msg(ra_126, s0_215, 0x01, &g_t230894A0, 0x14, out a1_456, out a2_457, out a3_458, out a4_459, out a5_460, out a7_461, out s4_462, out s5_463, out s6_464, out s7_465, out s8_466, out s9_467, out s10_468, out s11_469, out t4_470);
		}
		else
		{
			word32 a1_441;
			word32 a2_442;
			word32 a3_443;
			word32 a4_444;
			word32 a5_445;
			word32 a7_446;
			word32 s4_447;
			word32 s5_448;
			word32 s6_449;
			word32 s7_450;
			word32 s8_451;
			word32 s9_452;
			word32 s10_453;
			word32 s11_454;
			word32 t4_455;
			mbedtls_debug_print_msg(ra_126, s0_78, 0x01, &g_t230894A0, 0x14, out a1_441, out a2_442, out a3_443, out a4_444, out a5_445, out a7_446, out s4_447, out s5_448, out s6_449, out s7_450, out s8_451, out s9_452, out s10_453, out s11_454, out t4_455);
		}
	}
	else
	{
		word32 a1_428;
		word32 a2_429;
		word32 a3_430;
		word32 a4_431;
		word32 a5_432;
		word32 s4_433;
		word32 s5_434;
		word32 s6_435;
		word32 s7_436;
		word32 s8_437;
		word32 s9_438;
		word32 s10_439;
		word32 s11_440;
		mbedtls_debug_print_ret(ra_126, 0x01, s3_61 + 463, a0_76, out a1_428, out a2_429, out a3_430, out a4_431, out a5_432, out s4_433, out s5_434, out s6_435, out s7_436, out s8_437, out s9_438, out s10_439, out s11_440);
	}
}

// 2305D6F4: void mbedtls_ssl_parse_finished(Register Eq_2 ra, Register Eq_2 s0, Register word32 s1, Register Eq_2 a0, Register Eq_2 a5, Register Eq_2 s2, Register word32 s3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack ptr32 dwArg10, Stack word32 dwArg14, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack word32 dwArg0128, Stack word32 dwArg0138, Stack Eq_2 dwArg0148)
void mbedtls_ssl_parse_finished(Eq_2 ra, Eq_2 s0, word32 s1, Eq_2 a0, Eq_2 a5, Eq_2 s2, word32 s3, ptr32 mstatus, Eq_2 dwArg08, ptr32 dwArg10, word32 dwArg14, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgF8, Eq_2 dwArg0108, word32 dwArg0128, word32 dwArg0138, Eq_2 dwArg0148)
{
	word32 a5_27;
	struct Eq_309492 * a2_29;
	word32 s4_35;
	word32 s10_548;
	word32 s11_549;
	word32 t4_550;
	word32 a1_539;
	word32 s6_544;
	word32 s8_546;
	word32 s9_547;
	word32 s7_545;
	word32 a3_540;
	word32 a4_541;
	word32 a7_542;
	word32 s5_543;
	mbedtls_debug_print_msg(ra, a0, 0x02, &g_t23089510, a5, out a1_539, out a2_29, out a3_540, out a4_541, out a5_27, out a7_542, out s4_35, out s5_543, out s6_544, out s7_545, out s8_546, out s9_547, out s10_548, out s11_549, out t4_550);
	struct Eq_309525 * a5_48 = a2_29->ptr0074;
	<anonymous> * a5_51 = a5_48->ptr00CC;
	Eq_2 ra_60;
	Eq_2 s0_61;
	Eq_2 s1_62;
	Eq_2 a5_65;
	a5_51();
	struct Eq_309537 * a3_84;
	struct Eq_309538 * a4_85;
	ptr32 mstatus_89;
	word32 s4_97;
	Eq_2 a0_111;
	word32 s7_557;
	word32 s9_558;
	word32 s10_559;
	word32 s11_560;
	word32 s2_553;
	word32 s5_555;
	word32 s6_556;
	word32 s3_554;
	word32 a1_551;
	word32 a5_552;
	Eq_2 ra_197 = mbedtls_ssl_read_record(ra_60, s1_62, s0_61, a5_65, mstatus, s2, s0, dwLoc18, dwArg08, dwArg10, dwArg14, dwArg48, dwArg58, ra, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgF8, dwArg0138, out a0_111, out a1_551, out a3_84, out a4_85, out a5_552, out s2_553, out s3_554, out s4_97, out s5_555, out s6_556, out s7_557, out s9_558, out s10_559, out s11_560, out mstatus_89);
	if (a0_111 != 0x00)
	{
		word32 s4_566;
		word32 s9_571;
		word32 s11_573;
		word32 s10_572;
		word32 s5_567;
		word32 s6_568;
		word32 s7_569;
		word32 s8_570;
		word32 a2_562;
		word32 a4_564;
		word32 a5_565;
		word32 a3_563;
		word32 a1_561;
		mbedtls_debug_print_ret(ra_197, 0x01, s4_97 + 1164, a0_111, out a1_561, out a2_562, out a3_563, out a4_564, out a5_565, out s4_566, out s5_567, out s6_568, out s7_569, out s8_570, out s9_571, out s10_572, out s11_573);
		goto l2305D75A;
	}
	Eq_2 s0_113 = a4_85->t006C;
	if (a4_85 != (struct Eq_309538 *) 22)
	{
		word32 s8_584;
		word32 s9_585;
		word32 s10_586;
		word32 s11_587;
		word32 t4_588;
		word32 a2_575;
		word32 s4_580;
		word32 s6_582;
		word32 s7_583;
		word32 s5_581;
		word32 a3_576;
		word32 a4_577;
		word32 a5_578;
		word32 a7_579;
		word32 a1_574;
		mbedtls_debug_print_msg(ra_197, s0_113, 0x01, &g_t23089524, 22, out a1_574, out a2_575, out a3_576, out a4_577, out a5_578, out a7_579, out s4_580, out s5_581, out s6_582, out s7_583, out s8_584, out s9_585, out s10_586, out s11_587, out t4_588);
		goto l2305D75A;
	}
	Eq_2 a6_115 = *((word32) s0_113 + 100);
	Eq_2 a5_116 = 0x14;
	if ((word32) *a6_115 != 0x14)
	{
l2305D7C6:
		goto l2305D7D4;
	}
	s0_113 = a3_84->t0000;
	Eq_2 t1_120 = *((word32) s0_113 + 0x0080);
	word32 a0_121 = 0x04;
	ui32 a4_122 = (word32) a3_84->w0074;
	if ((a4_122 & 2) != 0x00)
		a0_121 = 0x0C;
	Eq_2 a2_127 = 0x00;
	a5_116.u0 = 0x00;
	if (t1_120 != a0_121 + 0x0C)
		goto l2305D7C6;
	do
	{
		a5_116 = (word16) a5_116.u0 + 1;
		a2_127 |= (word32) *((word32) a6_115 + ((word32) a5_116 + a0_121)) ^ (word32) (*((word32) a5_116 + (fp - 44)));
	} while (a5_116 != 0x0C);
	if (a2_127 != 0x00)
	{
l2305D7D4:
		word32 s10_601;
		word32 t4_603;
		word32 s7_598;
		word32 s9_600;
		word32 a5_593;
		word32 s6_597;
		word32 s8_599;
		word32 a7_594;
		word32 s11_602;
		word32 s5_596;
		word32 s4_595;
		word32 a4_592;
		word32 a1_589;
		word32 a3_591;
		word32 a2_590;
		mbedtls_debug_print_msg(ra_197, s0_113, 0x01, &g_t23089524, a5_116, out a1_589, out a2_590, out a3_591, out a4_592, out a5_593, out a7_594, out s4_595, out s5_596, out s6_597, out s7_598, out s8_599, out s9_600, out s10_601, out s11_602, out t4_603);
		goto l2305D75A;
	}
	struct Eq_309701 * a5_150;
	Eq_2 s0_147 = *((word32) a5_116 + 48);
	struct Eq_309706 * a5_148 = *((word32) a5_116 + 328);
	if (a5_148 != null)
	{
		if ((a4_122 & 0x01) == 0x00)
		{
			*(union Eq_2 *) 0x0E = s0_147;
			if (((word32) a3_84->w0074 & 0x01) == 0x00)
				goto l2305D838;
		}
		a5_150 = (struct Eq_309701 *) 0x0F;
	}
	else
	{
		s0_147 = a5_148->t0004;
		a5_150 = (struct Eq_309701 *) ((char *) a5_148 + 1);
	}
	a5_150->t0004 = s0_147;
l2305D838:
	ui32 a5_169 = (word32) a3_84->w0074;
	Eq_2 a5_170 = a5_169 & 0x02;
	if ((a5_169 & 0x02) != 0x00)
	{
		word32 s10_619;
		ra_197 = mbedtls_ssl_recv_flight_completed(ra_197, a2_127, a5_169 & 0x02, mstatus_89, dwLoc30, dwLoc2C, dwArg0108, dwArg0148, out a5_170, out s10_619);
	}
	word32 s5_611;
	word32 a4_607;
	word32 a3_606;
	word32 a2_605;
	word32 a1_604;
	word32 s4_610;
	word32 a7_609;
	word32 s6_612;
	word32 a5_608;
	word32 s7_613;
	word32 s8_614;
	word32 s9_615;
	word32 s10_616;
	word32 s11_617;
	word32 t4_618;
	mbedtls_debug_print_msg(ra_197, s0_147, 0x02, &g_t2308953C, a5_170, out a1_604, out a2_605, out a3_606, out a4_607, out a5_608, out a7_609, out s4_610, out s5_611, out s6_612, out s7_613, out s8_614, out s9_615, out s10_616, out s11_617, out t4_618);
l2305D75A:
	0x00 = dwArg0128;
}

// 2305D868: Register Eq_2 mbedtls_ssl_read(Register Eq_2 ra, Register ptr32 a0, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg84, Stack Eq_2 dwArg0108, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_269432) a4Out, Register out Eq_2 s2Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out (ptr32 word32) s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      iot_tls_read
Eq_2 mbedtls_ssl_read(Eq_2 ra, ptr32 a0, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg84, Eq_2 dwArg0108, union Eq_2 & a0Out, ptr32 & a2Out, ptr32 & a3Out, struct Eq_269432 & a4Out, union Eq_2 & s2Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, word32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 s0_117;
	struct Eq_309824 * sp_194 = fp + ~0x1F;
	if (a0 != 0x00)
	{
		Eq_2 a0_18 = *a5;
		if (a5 != 0x00)
		{
			struct Eq_309837 * a5_34;
			word32 a3_836;
			word32 s9_842;
			word32 s11_844;
			word32 t4_845;
			word32 s10_843;
			word32 s8_841;
			word32 a7_837;
			word32 s5_838;
			word32 s6_839;
			word32 s7_840;
			word32 a2_127;
			Eq_2 a1_134;
			Eq_2 s4_102;
			Eq_2 a0_116 = mbedtls_debug_print_msg(ra, a0_18, 0x02, &g_t23089880, a5, out a1_134, out a2_127, out a3_836, out a4, out a5_34, out a7_837, out s4_102, out s5_838, out s6_839, out s7_840, out s8_841, out s9_842, out s10_843, out s11_844, out t4_845);
			s2.u0 = 0x2308A000;
			Eq_2 s3_101 = a2;
			Eq_2 s1_52 = a5_34->t0000;
			ui32 a5_53 = (word32) a5_34->w0074;
			if ((a5_53 & 0x02) != 0x00)
			{
				struct Eq_309888 * a5_61;
				word32 s1_846;
				mbedtls_ssl_flush_output(ra, s1_52, a5_53 & 0x02, dwArg0108, out s1_846, out a0_116, out a1_134, out a2_127, out a3, out a4, out a5_61, out s2, out s3_101, out s4_102, out s5, out s6, out s7, out s9, out s10, out s11);
				s0_117 = a0_116;
				if (a0_116 != 0x00)
					goto l2305D908;
				Eq_2 s1_82 = a5_61->t0030;
				if (a5_61 != null)
				{
					a4 = (word32) a5_61->b0034;
					if (a4 == (struct Eq_269432 *) 0x01)
					{
						word32 a5_855;
						word32 s1_854;
						word32 s0_853;
						ra = mbedtls_ssl_resend(ra, a0_116, s1_82, 0x01, s2, mstatus, dwArg0108, out s0_853, out s1_854, out a0_116, out a1_134, out a2_127, out a3, out a4, out a5_855, out s2, out s3_101, out s4_102, out s5, out s6, out s7, out s9, out s10, out s11, out mstatus);
						s0_117 = a0_116;
						if (a0_116 != 0x00)
							goto l2305D908;
					}
				}
			}
			Eq_2 a5_514;
			Eq_2 a3_516;
			Eq_2 s1_120 = a4->t0004;
			Eq_2 a5_121 = 0x10;
			if (a4 != (struct Eq_269432 *) 0x10)
			{
				word32 a3_849;
				word32 a5_850;
				word32 s5_851;
				word32 s6_852;
				word32 s1_848;
				word32 s0_847;
				ra = mbedtls_ssl_handshake(ra, s1_120, 0x10, mstatus, dwArg38, dwArg84, out s0_847, out s1_848, out a0_116, out a1_134, out a2_127, out a3_849, out a4, out a5_850, out s2, out s3_101, out s4_102, out s5_851, out s6_852, out mstatus);
				a5_121.u0 = 0xF9000500;
				s0_117 = a0_116;
				if (a0_116 == 0xF9000500)
				{
					s0_117.u0 = 0x01;
l2305D91C:
					if (a5_121 == 0x00)
					{
						Eq_2 s1_167 = *((word16) a5_121.u0 + 76);
						if (a5_121 != 0x00)
						{
							word32 a0_201;
							word32 a3_204;
							word32 a7_210;
							word32 s10_211;
							word32 s11_212;
							word32 s5_213;
							word32 s6_214;
							word32 s7_215;
							word32 s9_216;
							word32 t0_217;
							word32 t1_218;
							word32 t4_219;
							word32 tp_220;
							word32 t2_222;
							word32 t5_223;
							word32 t6_224;
							word32 gp_225;
							a5_121();
							a5_121.u0 = ~0x00;
							if (a0_201 == ~0x00)
							{
								word32 s11_862;
								word32 s10_861;
								word32 s5_857;
								word32 s6_858;
								word32 s9_860;
								word32 s7_859;
								word32 a3_856;
								ra = ssl_set_timer(ra, s0_117, a1_134, *((word32) a1_134 + 100), sp_194->t0010, sp_194->t0014, out s0_117, out s1_167, out a1_134, out a3_856, out a4, out a5_121, out s4_102, out s5_857, out s6_858, out s7_859, out s9_860, out s10_861, out s11_862);
							}
						}
						if (s0_117 == 0x00)
						{
							Eq_2 a0_290;
							ra = mbedtls_ssl_read_record(ra, s1_167, s1_167, a5_121, mstatus, sp_194->t0010, sp_194->t0014, sp_194->t0018, sp_194->t0038, sp_194->ptr0040, sp_194->dw0044, sp_194->t0078, sp_194->t0088, sp_194->t0094, sp_194->t00A8, sp_194->t00B8, sp_194->t00C8, sp_194->t00E8, sp_194->t0128, sp_194->dw0168, out a0_290, out a1_134, out a3, out a4, out a5_121, out s2, out s3_101, out s4_102, out s5, out s6, out s7, out s9, out s10, out s11, out mstatus);
							s0_117 = a0_290;
							if (a0_290 != 0x00)
							{
								if (a0_290 == ~0x0700027F)
									goto l2305D94E;
								a5_514 = a0_290;
								a3_516.u0 = 0x01FFFA17;
								goto l2305D8D8;
							}
						}
						if (a5_121 == 0x00)
						{
							Eq_2 s1_299 = a4->t006C;
							a5_121.u0 = 0x17;
							if (a4 == (struct Eq_269432 *) 0x17)
							{
								Eq_2 a0_334;
								ra = mbedtls_ssl_read_record(ra, s1_299, s1_299, 0x17, mstatus, sp_194->t0010, sp_194->t0014, sp_194->t0018, sp_194->t0038, sp_194->ptr0040, sp_194->dw0044, sp_194->t0078, sp_194->t0088, sp_194->t0094, sp_194->t00A8, sp_194->t00B8, sp_194->t00C8, sp_194->t00E8, sp_194->t0128, sp_194->dw0168, out a0_334, out a1_134, out a3, out a4, out a5_121, out s2, out s3_101, out s4_102, out s5, out s6, out s7, out s9, out s10, out s11, out mstatus);
								s0_117 = a0_334;
								if (a0_334 != 0x00)
								{
									if (a0_334 == ~0x0700027F)
									{
l2305D94E:
										s0_117.u0 = 0x00;
										goto l2305D908;
									}
									a5_514 = a0_334;
									a3_516.u0 = 33552935;
l2305D8D8:
									word32 s4_872;
									word32 a1_869;
									word32 s8_873;
									word32 a5_871;
									word32 a2_870;
									mbedtls_debug_print_ret(ra, 0x01, a3_516, a5_514, out a1_869, out a2_870, out a3, out a4, out a5_871, out s4_872, out s5, out s6, out s7, out s8_873, out s9, out s10, out s11);
									goto l2305D908;
								}
							}
						}
						Eq_2 s1_338 = *((word16) a5_121.u0 + 0x006C);
						if (a5_121 == 0x15)
						{
							word32 a2_882;
							word32 s4_885;
							word32 s8_886;
							word32 a5_883;
							word32 a7_884;
							word32 a1_881;
							word32 t4_887;
							mbedtls_debug_print_msg(ra, s1_338, 0x02, &g_t23089888, a5_121, out a1_881, out a2_882, out a3, out a4, out a5_883, out a7_884, out s4_885, out s5, out s6, out s7, out s8_886, out s9, out s10, out s11, out t4_887);
							s0_117.u0 = 0xF9000700;
							goto l2305D908;
						}
						if (a5_121 != 0x17)
						{
							word32 s4_892;
							word32 a7_891;
							word32 a5_890;
							word32 a2_889;
							word32 s8_893;
							word32 t4_894;
							word32 a1_888;
							mbedtls_debug_print_msg(ra, s1_338, 0x01, &g_t230898B0, a5_121, out a1_888, out a2_889, out a3, out a4, out a5_890, out a7_891, out s4_892, out s5, out s6, out s7, out s8_893, out s9, out s10, out s11, out t4_894);
							s0_117.u0 = ~0x070006FF;
							goto l2305D908;
						}
						*((word16) a5_121.u0 + 0x0068) = *(union Eq_2 *) 0x1B;
						if (false)
						{
							word32 s1_895;
							word32 a5_898;
							word32 s5_899;
							word32 a4_897;
							word32 a3_896;
							word32 s6_900;
							word32 s7_901;
							word32 s9_902;
							word32 s10_903;
							word32 s11_904;
							ra = ssl_set_timer(ra, s0_117, 0x00, 0x10, sp_194->t0010, sp_194->t0014, out s0_117, out s1_895, out a1_134, out a3_896, out a4_897, out a5_898, out s4_102, out s5_899, out s6_900, out s7_901, out s9_902, out s10_903, out s11_904);
						}
					}
					if (s3_101 < s0_117)
						s0_117 = s3_101;
					word32 a2_864;
					struct Eq_310133 * a4_397;
					word32 a1_863;
					word32 a6_867;
					word32 a7_868;
					word32 a3_865;
					word32 a5_866;
					memcpy(s4_102, a1_134, s0_117, out a1_863, out a2_864, out a3_865, out a4_397, out a5_866, out a6_867, out a7_868);
					Eq_2 s1_410 = a4_397->t0070;
					struct Eq_310152 * a4_412 = a4_397 - s0_117;
					a4_412->t0070 = s1_410;
					Eq_2 a5_411 = 0x00;
					if (a4_412 != null)
					{
						s1_410 = *(union Eq_2 *) 0x68;
						a5_411 = s0_117;
					}
					*((word32) a5_411 + 0x0068) = s1_410;
					word32 a1_874;
					word32 s8_879;
					word32 a7_877;
					word32 s4_878;
					word32 a5_876;
					word32 t4_880;
					word32 a2_875;
					mbedtls_debug_print_msg(ra, s1_410, 0x02, &g_t230898D0, a5_411, out a1_874, out a2_875, out a3, out a4, out a5_876, out a7_877, out s4_878, out s5, out s6, out s7, out s8_879, out s9, out s10, out s11, out t4_880);
l2305D908:
					a0Out = s0_117;
					a2Out = dwArg48;
					a3Out = a3;
					a4Out = a4;
					s2Out = s2;
					s5Out = s5;
					s6Out = s6;
					s7Out = s7;
					s8Out = s4;
					s9Out = s9;
					s10Out = s10;
					s11Out = s11;
					mstatusOut = mstatus;
					return ra;
				}
				if (a0_116 != 0x00)
				{
					a5_514 = a0_116;
					a3_516.u0 = 0x01FFFA02;
					goto l2305D8D8;
				}
			}
			s0_117.u0 = 0x00;
			goto l2305D91C;
		}
	}
	s0_117.u0 = ~0x070000FF;
	goto l2305D908;
}

// 2305DA46: void mbedtls_ssl_set_calc_verify_md(Register word32 a1, Register (ptr32 Eq_310391) a4)
void mbedtls_ssl_set_calc_verify_md(word32 a1, struct Eq_310391 * a4)
{
	if (a4 != (struct Eq_310391 *) 0x03 || a1 != 0x04)
		return;
	a4->dw00C8 = 0x2305989C;
}

// 2305DA6E: Register Eq_2 mbedtls_zeroize(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 a1Out)
// Called from:
//      mbedtls_x509_crt_free
//      mbedtls_x509_crt_parse_file
Eq_2 mbedtls_zeroize(Eq_2 a0, Eq_2 a1, union Eq_2 & a1Out)
{
	word32 a1_5 = a1 + a0;
	while (a0 != a1_5)
	{
		a0->u1 = 0x00;
		a0 = (word32) a0 + 1;
	}
	a1Out = a1_5;
	return a0;
}

