pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305DA7E: Register Eq_2 x509_memcasecmp(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out (ptr32 Eq_310415) a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_310415) a5Out, Register out Eq_2 a7Out)
// Called from:
//      x509_name_cmp
//      x509_check_wildcard
//      mbedtls_x509_crt_verify_with_profile
Eq_2 x509_memcasecmp(Eq_2 a0, Eq_2 a1, Eq_2 a2, struct Eq_310415 & a3Out, union Eq_2 & a4Out, struct Eq_310415 & a5Out, union Eq_2 & a7Out)
{
	Eq_2 a4_23 = 0x00;
	while (a4_23 != a2)
	{
		a5 = CONVERT(Mem0[a0 + a4_23:byte], byte, word32);
		a3 = CONVERT(Mem0[a1 + a4_23:byte], byte, word32);
		int32 t1_15 = a5 ^ a3;
		if (a5 != a3)
		{
			if (t1_15 == 32)
			{
				ui32 a5_18 = (a5 & -33) + -65;
				a5 = a5_18 & 0x00FF;
				if ((a5_18 & 0x00FF) <= 0x19)
					goto l2305DABA;
			}
			a3Out = a3;
			a4Out.u0 = <invalid>;
			a5Out = a5;
			a7Out.u0 = <invalid>;
			return ~0x00;
		}
l2305DABA:
		a4_23 = (word32) a4_23 + 1;
	}
	a3Out = a3;
	a4Out.u0 = <invalid>;
	a5Out = a5;
	a7Out.u0 = <invalid>;
	return 0x00;
}

// 2305DAC2: Register Eq_2 x509_name_cmp(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 a6Out, Register out ptr32 a7Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      x509_crt_check_parent
//      x509_crt_verify_child
Eq_2 x509_name_cmp(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & a6Out, ptr32 & a7Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	Eq_2 s1_15 = a0;
	Eq_2 s0_17 = a1;
	while (true)
	{
		ptr32 a0_166;
		if (s1_15 == 0x00)
			break;
		if (s0_17 == 0x00)
		{
l2305DAE4:
			a0_166 = ~0x00;
			goto l2305DAE6;
		}
		s1_15 = *a4;
		if (a4 != a5)
			goto l2305DAE4;
		s1_15 = *((word32) a2 + 4);
		if (a2 != a5)
			goto l2305DAE4;
		s1_15 = *((word32) a0 + 8);
		a0 = memcmp(a0, a1, a2, out a1, out a2, out a3, out a4, out a5);
		if (a0 != 0x00)
			goto l2305DAE4;
		struct Eq_310506 * s0_44;
		if (a4 != a5 || a2 != a5)
		{
l2305DB16:
			s1_15 = *((word32) a5 + 0x0C);
			if (a5 != 0x0C && a5 != 0x13 || a5 != 0x0C && a5 != 0x13)
				goto l2305DAE4;
			s1_15 = *((word32) a2 + 16);
			if (a2 != a5)
				goto l2305DAE4;
			s0_44 = (struct Eq_310506 *) *((word32) a1 + 20);
			s1_15 = *((word32) a0 + 20);
			a0 = x509_memcasecmp(a0, a1, a2, out a3, out a4, out a5, out a7);
			if (a0 != 0x00)
				goto l2305DAE4;
			goto l2305DB4C;
		}
		s0_44 = (struct Eq_310506 *) *((word32) a1 + 20);
		s1_15 = *((word32) a0 + 20);
		a0 = memcmp(a0, a1, a2, out a1, out a2, out a3, out a4, out a5);
		if (a0 != 0x00)
			goto l2305DB16;
l2305DB4C:
		a4 = (word32) *((word32) s1_15 + 28);
		a5 = (word32) s0_44->b001C;
		if (a4 != a5)
			goto l2305DAE4;
		s1_15 = *((word32) s1_15 + 24);
		s0_17 = s0_44->t0018;
	}
	a0_166 = 0x00 - (word32) (s0_17 != 0x00);
l2305DAE6:
	a0Out = a0_166;
	a1Out = a1;
	a2Out = dwArg48;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	a6Out = dwArg28;
	a7Out = a7;
	s2Out = 0x0C;
	s3Out = 0x13;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return s1_15;
}

// 2305DB64: Register Eq_2 x509_check_wildcard(Register Eq_2 a0, Register out (ptr32 Eq_2) a0Out, Register out (ptr32 Eq_2) a5Out, Register out (ptr32 Eq_310575) s8Out)
// Called from:
//      mbedtls_x509_crt_verify_with_profile
Eq_2 x509_check_wildcard(Eq_2 a0, union Eq_2 & a0Out, union Eq_2 & a5Out, struct Eq_310575 & s8Out)
{
	union Eq_2 * a5_21;
	struct Eq_310577 * a3_13;
	up32 a4_14;
	word32 a1_90;
	word32 a2_91;
	word32 a5_92;
	Eq_2 a0_12 = strlen(a0, out a1_90, out a2_91, out a3_13, out a4_14, out a5_92);
	if (a4_14 > 0x02)
	{
		a5_21 = null;
		if ((word32) a3_13->b0000 == 42 && (word32) a3_13->b0001 == 46)
		{
			Eq_2 a2_28 = 0x00;
			while (a2_28 != a0_12)
			{
				word32 a1_33 = a0 + a2_28;
				if ((word32) *a1_33 == 46)
				{
					a5_21 = (union Eq_2 *) ~0x00;
					if (a2_28 != 0x00)
					{
						Eq_2 a2_40 = a0_12 - a2_28;
						if (a2_40 == a4_14 + ~0x00)
						{
							word32 a3_93;
							word32 a4_94;
							word32 a5_95;
							word32 a7_96;
							a5_21 = 0x00 - (word32) (x509_memcasecmp(&a3_13->b0001, a1_33, a2_40, out a3_93, out a4_94, out a5_95, out a7_96) != 0x00);
						}
					}
					goto l2305DBA4;
				}
				a2_28 = (word32) a2_28 + 1;
			}
			a5_21 = (union Eq_2 *) ~0x00;
		}
	}
	else
		a5_21 = null;
l2305DBA4:
	a0Out = a5_21;
	a5Out = a5_21;
	s8Out = dwLoc1C;
	return a0;
}

// 2305DBE2: Register Eq_310646 x509_profile_check_key(Register word32 a1, Register Eq_2 a2, Register out ptr32 a2Out, Register out Eq_310646 a4Out, Register out ptr32 a5Out)
// Called from:
//      x509_crt_verify_top.isra.7
//      x509_crt_verify_child
//      mbedtls_x509_crt_verify_with_profile
Eq_310646 x509_profile_check_key(word32 a1, Eq_2 a2, ptr32 & a2Out, union Eq_310646 & a4Out, ptr32 & a5Out)
{
	Eq_310646 a4_16;
	ptr32 a5_23 = 0x01;
	if (a1 != 0x01 && a1 != 0x06)
	{
		a4_16.u0 = ~0x00;
		if ((a1 + ~0x01 & 0x00FF) > 0x02)
			goto l2305DC06;
		word32 a0_18 = (word32) *(union Eq_2 *) ~0x00;
		a5_23 = (word32) ((0x01 << a0_18 + ~0x00 & a0_18 + ~0x00) < 1);
	}
	else
	{
		up32 a5_29;
		a5_23 = (word32) (mbedtls_pk_get_bitlen(a2, 0x01, out a5_29) < a5_29);
	}
	a4_16 = 0x00 - a5_23;
l2305DC06:
	a2Out = dwArg10;
	a4Out = a4_16;
	a5Out = a5_23;
	return a4_16;
}

// 2305DC34: Register Eq_2 mbedtls_x509_crt_info(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_7997 a1, Register Eq_2 a3, Register Eq_2 s2, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg6C, Stack Eq_2 dwArgC8, Stack Eq_7997 dwArg0174, Register out Eq_7997 s0Out, Register out Eq_2 s1Out, Register out ptr32 a3Out, Register out (ptr32 Eq_268670) s2Out, Register out ptr32 s3Out, Register out Eq_268672 s4Out, Register out ptr32 s5Out, Register out Eq_2 s7Out, Register out ptr32 s10Out)
// Called from:
//      iot_tls_connect
//      _iot_tls_verify_cert
//      mbedtls_debug_print_crt
Eq_2 mbedtls_x509_crt_info(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_7997 a1, Eq_2 a3, Eq_2 s2, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg5C, Eq_2 dwArg6C, Eq_2 dwArgC8, Eq_7997 dwArg0174, union Eq_7997 & s0Out, union Eq_2 & s1Out, ptr32 & a3Out, struct Eq_268670 & s2Out, ptr32 & s3Out, union Eq_268672 & s4Out, ptr32 & s5Out, union Eq_2 & s7Out, ptr32 & s10Out)
{
	Eq_7997 s0_100;
	ptr32 s10_1002;
	Eq_268672 s4_1006;
	ptr32 s3_1005;
	struct Eq_268670 * s2_1004;
	Eq_2 s7_1009;
	if (a3 == 0x00)
	{
		Eq_268672 a0_1480;
		word32 a1_2144;
		word32 s1_2143;
		word32 a7_2149;
		word32 a3_2146;
		word32 a2_2145;
		word32 a5_2148;
		word32 a4_2147;
		word32 s6_2151;
		word32 s8_2152;
		word32 s5_2150;
		word32 s11_2154;
		word32 s9_2153;
		snprintf(ra, a0, a1, &g_t2308A3B4, dwLoc48, dwLoc28, dwArg04, dwArg20, dwArg24, s1, dwArg6C, out s0_100, out s1_2143, out a0_1480, out a1_2144, out a2_2145, out a3_2146, out a4_2147, out a5_2148, out a7_2149, out s2_1004, out s3_1005, out s4_1006, out s5_2150, out s6_2151, out s7_1009, out s8_2152, out s9_2153, out s10_1002, out s11_2154);
		if (a0_1480 >= 0x00 && a0_1480 < s4_1006)
			goto l2305DC66;
		goto l2305DC5A;
	}
	Eq_268672 a0_33;
	word32 s1_42;
	word32 a5_2136;
	word32 a7_2137;
	word32 s6_2139;
	word32 a1_2132;
	word32 s5_2138;
	word32 a4_2135;
	word32 a3_2134;
	word32 s9_2141;
	word32 s8_2140;
	word32 a2_2133;
	word32 s11_2142;
	Eq_2 ra_40 = snprintf(ra, a0, a1, &g_t2308A3D4, dwLoc48, dwLoc28, dwArg04, dwArg20, dwArg24, s1, dwArg6C, out s0_100, out s1_42, out a0_33, out a1_2132, out a2_2133, out a3_2134, out a4_2135, out a5_2136, out a7_2137, out s2_1004, out s3_1005, out s4_1006, out s5_2138, out s6_2139, out s7_1009, out s8_2140, out s9_2141, out s10_1002, out s11_2142);
	if (a0_33 < 0x00 || a0_33 >= s4_1006)
		goto l2305DC5A;
	Eq_7997 a0_63;
	word32 s1_72;
	Eq_2 s9_82;
	word32 a5_2159;
	word32 a4_2158;
	word32 a2_2156;
	word32 a3_2157;
	word32 a1_2155;
	word32 a7_2160;
	word32 s5_2161;
	word32 s11_2164;
	word32 s6_2162;
	word32 s8_2163;
	Eq_2 ra_70 = snprintf(ra_40, (word32) a0_33 + s1_42, s4_1006 - a0_33, &g_t2308A3F0, dwLoc48, dwLoc28, dwArg04, dwArg20, dwArg24, s1, dwArg6C, out s0_100, out s1_72, out a0_63, out a1_2155, out a2_2156, out a3_2157, out a4_2158, out a5_2159, out a7_2160, out s2_1004, out s3_1005, out s4_1006, out s5_2161, out s6_2162, out s7_1009, out s8_2163, out s9_82, out s10_1002, out s11_2164);
	if (a0_63 >= 0x00 && a0_63 < s0_100)
	{
		Eq_7997 a0_91;
		word32 s1_101;
		Eq_2 ra_99 = mbedtls_x509_serial_gets(ra_70, (word32) a0_63 + s1_72, s0_100 - a0_63, (char *) &s2_1004->t000C + 16, s7_1009, s9_82, dwLoc58, dwLoc44, dwLoc2C, dwArg18, dwArg3C, dwArgC8, out s0_100, out s1_101, out a0_91, out s2_1004, out s3_1005, out s4_1006, out s7_1009, out s10_1002);
		if (a0_91 < 0x00 || a0_91 >= s0_100)
			goto l2305DC5A;
		Eq_7997 a0_123;
		word32 s1_132;
		word32 a2_2166;
		word32 a3_2167;
		word32 a4_2168;
		word32 a1_2165;
		word32 s5_2171;
		word32 s6_2172;
		word32 s8_2173;
		word32 a7_2170;
		word32 a5_2169;
		word32 s9_2174;
		word32 s11_2175;
		Eq_2 ra_130 = snprintf(ra_99, (word32) a0_91 + s1_101, s0_100 - a0_91, &g_t2308A408, dwLoc48, dwLoc28, dwArg04, dwArg20, dwArg24, s1, dwArg6C, out s0_100, out s1_132, out a0_123, out a1_2165, out a2_2166, out a3_2167, out a4_2168, out a5_2169, out a7_2170, out s2_1004, out s3_1005, out s4_1006, out s5_2171, out s6_2172, out s7_1009, out s8_2173, out s9_2174, out s10_1002, out s11_2175);
		if (a0_123 >= 0x00 && a0_123 < s0_100)
		{
			s0_100 -= a0_123;
			Eq_2 s1_147 = (word32) a0_123 + s1_132;
			Eq_7997 a0_151 = mbedtls_x509_dn_gets(ra_130, s1_147, s0_100, (char *) &s2_1004->t000C + 64, out s10_1002);
			if (a0_151 < 0x00 || a0_151 >= s0_100)
				goto l2305DC5A;
			Eq_7997 a0_173;
			word32 s1_182;
			word32 s8_2184;
			word32 a4_2179;
			word32 a1_2176;
			word32 a2_2177;
			word32 a3_2178;
			word32 a7_2181;
			word32 a5_2180;
			word32 s11_2186;
			word32 s5_2182;
			word32 s6_2183;
			word32 s9_2185;
			word32 ra_180 = snprintf(ra_130, s1_147 + a0_151, s0_100 - a0_151, 587768868, dwLoc48, dwLoc28, dwArg04, dwArg20, dwArg24, s1, dwArg6C, out s0_100, out s1_182, out a0_173, out a1_2176, out a2_2177, out a3_2178, out a4_2179, out a5_2180, out a7_2181, out s2_1004, out s3_1005, out s4_1006, out s5_2182, out s6_2183, out s7_1009, out s8_2184, out s9_2185, out s10_1002, out s11_2186);
			if (a0_173 >= 0x00 && a0_173 < s0_100)
			{
				s0_100 -= a0_173;
				Eq_2 s1_197 = (word32) a0_173 + s1_182;
				Eq_7997 a0_201 = mbedtls_x509_dn_gets(ra_180, s1_197, s0_100, (char *) &s2_1004->t000C + 96, out s10_1002);
				if (a0_201 < 0x00 || a0_201 >= s0_100)
					goto l2305DC5A;
				Eq_7997 a0_231;
				word32 s1_240;
				word32 a4_2190;
				word32 a1_2187;
				word32 a5_2191;
				word32 a7_2192;
				word32 s5_2193;
				word32 a2_2188;
				word32 a3_2189;
				word32 s9_2196;
				word32 s6_2194;
				word32 s8_2195;
				word32 s11_2197;
				word32 ra_238 = snprintf(ra_180, s1_197 + a0_201, s0_100 - a0_201, 587768896, dwLoc48, dwLoc28, dwArg04, Mem19[s2_1004 + 0x00A0:int32], dwArg24, s1, dwArg6C, out s0_100, out s1_240, out a0_231, out a1_2187, out a2_2188, out a3_2189, out a4_2190, out a5_2191, out a7_2192, out s2_1004, out s3_1005, out s4_1006, out s5_2193, out s6_2194, out s7_1009, out s8_2195, out s9_2196, out s10_1002, out s11_2197);
				if (a0_231 >= 0x00 && a0_231 < s0_100)
				{
					Eq_2 a5_254 = s2_1004->t00B8;
					Eq_7997 a0_269;
					word32 s1_278;
					word32 a2_2199;
					word32 a3_2200;
					word32 a4_2201;
					word32 s6_2205;
					word32 s5_2204;
					word32 a7_2203;
					word32 a5_2202;
					word32 a1_2198;
					word32 s8_2206;
					word32 s9_2207;
					word32 s11_2208;
					Eq_2 ra_276 = snprintf(ra_238, (word32) a0_231 + s1_240, s0_100 - a0_231, &g_t2308A478, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_278, out a0_269, out a1_2198, out a2_2199, out a3_2200, out a4_2201, out a5_2202, out a7_2203, out s2_1004, out s3_1005, out s4_1006, out s5_2204, out s6_2205, out s7_1009, out s8_2206, out s9_2207, out s10_1002, out s11_2208);
					if (a0_269 < 0x00 || a0_269 >= s0_100)
						goto l2305DC5A;
					Eq_7997 a0_299;
					word32 s5_2216;
					word32 a7_2215;
					word32 s6_2217;
					word32 s8_2218;
					word32 s9_2219;
					word32 s11_2220;
					word32 a5_2214;
					word32 a2_2211;
					word32 a3_2212;
					word32 a4_2213;
					word32 s1_2209;
					word32 a1_2210;
					Eq_2 ra_306 = snprintf(ra_276, (word32) a0_269 + s1_278, s0_100 - a0_269, &g_t2308A4B0, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_2209, out a0_299, out a1_2210, out a2_2211, out a3_2212, out a4_2213, out a5_2214, out a7_2215, out s2_1004, out s3_1005, out s4_1006, out s5_2216, out s6_2217, out s7_1009, out s8_2218, out s9_2219, out s10_1002, out s11_2220);
					if (a0_299 >= 0x00 && a0_299 < s0_100)
					{
						Eq_7997 a0_330;
						word32 a5_335;
						Eq_2 ra_337 = mbedtls_x509_sig_alg_gets(ra_306, s0_100 - a0_299, (char *) &s2_1004->t000C + 28, s2_1004->t012C, dwLoc48, dwLoc1C, dwArg00, dwArg28, ra, out s0_100, out a0_330, out a5_335, out s2_1004, out s3_1005, out s4_1006, out s7_1009, out s10_1002);
						if (a0_330 < 0x00 || a0_330 >= s0_100)
							goto l2305DC5A;
						mbedtls_pk_get_name((char *) &s2_1004->t00B8 + 4, a5_335);
						word32 a0_362;
						Eq_2 a5_367;
						word32 s1_370;
						up32 s5_376;
						Eq_2 s6_377;
						Eq_2 ra_369 = mbedtls_x509_key_size_helper(ra_337, fp + -52, 0x12, dwLoc58, s2, dwLoc0C, dwArg10, dwArg38, dwArg5C, out s1_370, out a0_362, out a5_367, out s2_1004, out s3_1005, out s4_1006, out s5_376, out s6_377, out s7_1009, out s10_1002);
						if (a0_362 != 0x00)
						{
l2305DC66:
							s0Out = s0_100;
							s1Out = dwArg28;
							a3Out = dwArg08;
							s2Out = s2_1004;
							s3Out = s3_1005;
							s4Out = s4_1006;
							s5Out = s4;
							s7Out = s7_1009;
							s10Out = s10_1002;
							return dwArg68;
						}
						word32 a5_2221;
						mbedtls_pk_get_bitlen(s6_377, a5_367, out a5_2221);
						Eq_7997 a0_397;
						word32 s1_406;
						word32 s8_2230;
						word32 s9_2231;
						word32 s11_2232;
						word32 s6_2229;
						word32 s5_2228;
						word32 a4_2225;
						word32 a5_2226;
						word32 a7_2227;
						word32 a3_2224;
						word32 a2_2223;
						word32 a1_2222;
						Eq_2 ra_1027 = snprintf(ra_369, s1_370 + s5_376, s0_100 - s5_376, &g_t2308A4CC, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_406, out a0_397, out a1_2222, out a2_2223, out a3_2224, out a4_2225, out a5_2226, out a7_2227, out s2_1004, out s3_1005, out s4_1006, out s5_2228, out s6_2229, out s7_1009, out s8_2230, out s9_2231, out s10_1002, out s11_2232);
						if (a0_397 >= 0x00 && a0_397 < s0_100)
						{
							s0_100 -= a0_397;
							Eq_2 s1_1017 = (word32) a0_397 + s1_406;
							if ((s2_1004->dw00F8 & 0x0100) != 0x00)
							{
								s2_1004->dw00FC != 0x00;
								Eq_7997 a0_440;
								word32 s1_449;
								word32 s9_2253;
								word32 s11_2254;
								word32 s8_2252;
								word32 s6_2251;
								word32 a1_2244;
								word32 a2_2245;
								word32 a3_2246;
								word32 a4_2247;
								word32 a5_2248;
								word32 a7_2249;
								word32 s5_2250;
								ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A4E0, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_449, out a0_440, out a1_2244, out a2_2245, out a3_2246, out a4_2247, out a5_2248, out a7_2249, out s2_1004, out s3_1005, out s4_1006, out s5_2250, out s6_2251, out s7_1009, out s8_2252, out s9_2253, out s10_1002, out s11_2254);
								if (a0_440 < 0x00 || a0_440 >= s0_100)
									goto l2305DC5A;
								s0_100 -= a0_440;
								s1_1017 = (word32) a0_440 + s1_449;
								if (s2_1004->dw0100 > 0x00)
								{
									Eq_7997 a0_471;
									word32 s1_480;
									word32 s11_2243;
									word32 s9_2242;
									word32 s8_2241;
									word32 s6_2240;
									word32 a3_2235;
									word32 a4_2236;
									word32 a5_2237;
									word32 a7_2238;
									word32 s5_2239;
									word32 a1_2233;
									word32 a2_2234;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A500, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_480, out a0_471, out a1_2233, out a2_2234, out a3_2235, out a4_2236, out a5_2237, out a7_2238, out s2_1004, out s3_1005, out s4_1006, out s5_2239, out s6_2240, out s7_1009, out s8_2241, out s9_2242, out s10_1002, out s11_2243);
									if (a0_471 < 0x00 || a0_471 >= s0_100)
										goto l2305DC5A;
									s0_100 -= a0_471;
									s1_1017 = (word32) a0_471 + s1_480;
								}
							}
							if ((s2_1004->dw00F8 & 32) != 0x00)
							{
								Eq_7997 a0_510;
								word32 s1_519;
								word32 a5_2258;
								word32 a7_2259;
								word32 s9_2263;
								word32 s11_2264;
								word32 s6_2261;
								word32 s8_2262;
								word32 s5_2260;
								word32 a3_2257;
								word32 a2_2256;
								word32 a1_2255;
								struct Eq_311368 * a4_514;
								ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A514, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_519, out a0_510, out a1_2255, out a2_2256, out a3_2257, out a4_514, out a5_2258, out a7_2259, out s2_1004, out s3_1005, out s4_1006, out s5_2260, out s6_2261, out s7_1009, out s8_2262, out s9_2263, out s10_1002, out s11_2264);
								if (a0_510 < 0x00 || a0_510 >= s0_100)
									goto l2305DC5A;
								s0_100 -= a0_510;
								s1_1017 = (word32) a0_510 + s1_519;
								struct Eq_311368 * a3_1518 = (char *) &g_t23088E48 + 24;
								int32 a1_539 = 0x00;
								do
								{
									Eq_7997 a4_545 = a4_514 + a1_539 / 8;
									if (a4_545 >= s0_100)
									{
										s1_1017->u1 = 0x00;
										goto l2305DC5A;
									}
									s0_100 -= a4_545;
									int32 a4_548 = 0x00;
									while (true)
									{
										byte * a0_551 = (word32) s1_1017 + a4_548;
										if (a4_548 == a1_539)
											break;
										*a0_551 = (byte) (word32) a3_1518[a4_548 / 8];
										++a4_548;
									}
									a4_514 = null;
									while (true)
									{
										struct Eq_311430 * a5_562 = a3_1518->ptr0004;
										s1_1017 = a0_551 + a4_514;
										if (a4_514 >= a3_1518)
											break;
										a3_1518 = CONVERT(Mem561[a3_1518 + a4_514:byte], byte, word32);
										s1_1017->u1 = (byte) a3_1518;
										a4_514 = (struct Eq_311368 *) ((char *) a4_514 + 1);
									}
									a1_539 = 0x02;
									a3_1518 = (struct Eq_311368 *) &g_t23080648;
								} while (a5_562->dw000C != 0x00);
								s1_1017->u1 = 0x00;
							}
							if (s2_1004->dw00F8 << 0x0F < 0x00)
							{
								Eq_7997 a0_606;
								word32 s1_615;
								word32 s6_2272;
								word32 s8_2273;
								word32 s9_2274;
								word32 s11_2275;
								word32 s5_2271;
								word32 a7_2270;
								word32 a5_2269;
								word32 a4_2268;
								word32 a1_2265;
								word32 a2_2266;
								word32 a3_2267;
								ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A530, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_615, out a0_606, out a1_2265, out a2_2266, out a3_2267, out a4_2268, out a5_2269, out a7_2270, out s2_1004, out s3_1005, out s4_1006, out s5_2271, out s6_2272, out s7_1009, out s8_2273, out s9_2274, out s10_1002, out s11_2275);
								if (a0_606 < 0x00 || a0_606 >= s0_100)
									goto l2305DC5A;
								ui32 s5_629 = (word32) s2_1004->b0118;
								s0_100 -= a0_606;
								s1_1017 = (word32) a0_606 + s1_615;
								if ((int32) (byte) s5_629 < 0x00)
								{
									Eq_7997 a0_640;
									word32 s1_649;
									word32 s11_2285;
									word32 s9_2284;
									word32 a7_2281;
									word32 s6_2282;
									word32 s8_2283;
									word32 a5_2280;
									word32 a4_2279;
									word32 a1_2276;
									word32 a2_2277;
									word32 a3_2278;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A54C, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_649, out a0_640, out a1_2276, out a2_2277, out a3_2278, out a4_2279, out a5_2280, out a7_2281, out s2_1004, out s3_1005, out s4_1006, out s5_629, out s6_2282, out s7_1009, out s8_2283, out s9_2284, out s10_1002, out s11_2285);
									if (a0_640 < 0x00 || a0_640 >= s0_100)
										goto l2305DC5A;
									s0_100 -= a0_640;
									s1_1017 = (word32) a0_640 + s1_649;
								}
								if ((s5_629 & 64) != 0x00)
								{
									Eq_7997 a0_678;
									word32 s1_687;
									word32 a1_2286;
									word32 a2_2287;
									word32 a7_2291;
									word32 s6_2292;
									word32 s8_2293;
									word32 s9_2294;
									word32 s11_2295;
									word32 a4_2289;
									word32 a5_2290;
									word32 a3_2288;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A55C, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_687, out a0_678, out a1_2286, out a2_2287, out a3_2288, out a4_2289, out a5_2290, out a7_2291, out s2_1004, out s3_1005, out s4_1006, out s5_629, out s6_2292, out s7_1009, out s8_2293, out s9_2294, out s10_1002, out s11_2295);
									if (a0_678 < 0x00 || a0_678 >= s0_100)
										goto l2305DC5A;
									s0_100 -= a0_678;
									s1_1017 = (word32) a0_678 + s1_687;
								}
								if ((s5_629 & 32) != 0x00)
								{
									Eq_7997 a0_716;
									word32 s1_725;
									word32 s11_2326;
									word32 s9_2325;
									word32 s8_2324;
									word32 a3_2319;
									word32 a4_2320;
									word32 a5_2321;
									word32 a7_2322;
									word32 s6_2323;
									word32 a1_2317;
									word32 a2_2318;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A56C, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_725, out a0_716, out a1_2317, out a2_2318, out a3_2319, out a4_2320, out a5_2321, out a7_2322, out s2_1004, out s3_1005, out s4_1006, out s5_629, out s6_2323, out s7_1009, out s8_2324, out s9_2325, out s10_1002, out s11_2326);
									if (a0_716 < 0x00 || a0_716 >= s0_100)
										goto l2305DC5A;
									s0_100 -= a0_716;
									s1_1017 = (word32) a0_716 + s1_725;
								}
								if ((s5_629 & 16) != 0x00)
								{
									Eq_7997 a0_754;
									word32 s1_763;
									word32 s11_2346;
									word32 s9_2345;
									word32 s8_2344;
									word32 s6_2343;
									word32 a7_2342;
									word32 a5_2341;
									word32 a4_2340;
									word32 a1_2337;
									word32 a2_2338;
									word32 a3_2339;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A574, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_763, out a0_754, out a1_2337, out a2_2338, out a3_2339, out a4_2340, out a5_2341, out a7_2342, out s2_1004, out s3_1005, out s4_1006, out s5_629, out s6_2343, out s7_1009, out s8_2344, out s9_2345, out s10_1002, out s11_2346);
									if (a0_754 < 0x00 || a0_754 >= s0_100)
										goto l2305DC5A;
									s0_100 -= a0_754;
