pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
									s1_1017 = (word32) a0_754 + s1_763;
								}
								if ((s5_629 & 8) != 0x00)
								{
									Eq_7997 a0_792;
									word32 s1_801;
									word32 s11_2366;
									word32 s9_2365;
									word32 s8_2364;
									word32 s6_2363;
									word32 a7_2362;
									word32 a5_2361;
									word32 a4_2360;
									word32 a3_2359;
									word32 a2_2358;
									word32 a1_2357;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A588, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_801, out a0_792, out a1_2357, out a2_2358, out a3_2359, out a4_2360, out a5_2361, out a7_2362, out s2_1004, out s3_1005, out s4_1006, out s5_629, out s6_2363, out s7_1009, out s8_2364, out s9_2365, out s10_1002, out s11_2366);
									if (a0_792 < 0x00 || a0_792 >= s0_100)
										goto l2305DC5A;
									s0_100 -= a0_792;
									s1_1017 = (word32) a0_792 + s1_801;
								}
								if ((s5_629 & 4) != 0x00)
								{
									Eq_7997 a0_830;
									word32 s1_839;
									word32 s11_2386;
									word32 s9_2385;
									word32 s8_2384;
									word32 s6_2383;
									word32 a7_2382;
									word32 a5_2381;
									word32 a4_2380;
									word32 a3_2379;
									word32 a2_2378;
									word32 a1_2377;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A594, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_839, out a0_830, out a1_2377, out a2_2378, out a3_2379, out a4_2380, out a5_2381, out a7_2382, out s2_1004, out s3_1005, out s4_1006, out s5_629, out s6_2383, out s7_1009, out s8_2384, out s9_2385, out s10_1002, out s11_2386);
									if (a0_830 < 0x00 || a0_830 >= s0_100)
										goto l2305DC5A;
									s0_100 -= a0_830;
									s1_1017 = (word32) a0_830 + s1_839;
								}
								if ((s5_629 & 2) != 0x00)
								{
									Eq_7997 a0_868;
									word32 s1_877;
									word32 s11_2406;
									word32 s9_2405;
									word32 s8_2404;
									word32 s6_2403;
									word32 a7_2402;
									word32 a5_2401;
									word32 a4_2400;
									word32 a3_2399;
									word32 a2_2398;
									word32 a1_2397;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A5A0, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_877, out a0_868, out a1_2397, out a2_2398, out a3_2399, out a4_2400, out a5_2401, out a7_2402, out s2_1004, out s3_1005, out s4_1006, out s5_629, out s6_2403, out s7_1009, out s8_2404, out s9_2405, out s10_1002, out s11_2406);
									if (a0_868 < 0x00 || a0_868 >= s0_100)
										goto l2305DC5A;
									s0_100 -= a0_868;
									s1_1017 = (word32) a0_868 + s1_877;
								}
								if ((s5_629 & 1) != 0x00)
								{
									Eq_7997 a0_906;
									word32 s1_915;
									word32 s11_2467;
									word32 s9_2466;
									word32 s8_2465;
									word32 s6_2464;
									word32 s5_2463;
									word32 a7_2462;
									word32 a5_2461;
									word32 a4_2460;
									word32 a3_2459;
									word32 a2_2458;
									word32 a1_2457;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A5AC, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_915, out a0_906, out a1_2457, out a2_2458, out a3_2459, out a4_2460, out a5_2461, out a7_2462, out s2_1004, out s3_1005, out s4_1006, out s5_2463, out s6_2464, out s7_1009, out s8_2465, out s9_2466, out s10_1002, out s11_2467);
									if (a0_906 < 0x00 || a0_906 >= s0_100)
										goto l2305DC5A;
									s0_100 -= a0_906;
									s1_1017 = (word32) a0_906 + s1_915;
								}
							}
							if ((s2_1004->dw00F8 & 0x04) != 0x00)
							{
								Eq_7997 a0_959;
								word32 s1_968;
								word32 a5_2300;
								word32 a7_2301;
								word32 s5_2302;
								word32 s6_2303;
								word32 s8_2304;
								word32 s9_2305;
								word32 s11_2306;
								word32 a4_2299;
								word32 a3_2298;
								word32 a2_2297;
								word32 a1_2296;
								ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A5C0, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_968, out a0_959, out a1_2296, out a2_2297, out a3_2298, out a4_2299, out a5_2300, out a7_2301, out s2_1004, out s3_1005, out s4_1006, out s5_2302, out s6_2303, out s7_1009, out s8_2304, out s9_2305, out s10_1002, out s11_2306);
								if (a0_959 < 0x00 || a0_959 >= s0_100)
									goto l2305DC5A;
								int32 s5_1007 = s2_1004->dw0104;
								s0_100 -= a0_959;
								s1_1017 = (word32) a0_959 + s1_968;
								if ((s5_1007 & 0x0080) != 0x00)
								{
									Eq_7997 a0_992;
									word32 s1_1001;
									word32 s8_2314;
									word32 s9_2315;
									word32 s11_2316;
									word32 s6_2313;
									word32 a7_2312;
									word32 a3_2309;
									word32 a4_2310;
									word32 a5_2311;
									word32 a2_2308;
									word32 a1_2307;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A5DC, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_1001, out a0_992, out a1_2307, out a2_2308, out a3_2309, out a4_2310, out a5_2311, out a7_2312, out s2_1004, out s3_1005, out s4_1006, out s5_1007, out s6_2313, out s7_1009, out s8_2314, out s9_2315, out s10_1002, out s11_2316);
									if (a0_992 < 0x00 || a0_992 >= s0_100)
										goto l2305DC5A;
									s0_100 -= a0_992;
									s1_1017 = (word32) a0_992 + s1_1001;
								}
								if ((s5_1007 & 64) != 0x00)
								{
									Eq_7997 a0_1030;
									word32 s1_1039;
									word32 s11_2336;
									word32 s9_2335;
									word32 a2_2328;
									word32 a3_2329;
									word32 a4_2330;
									word32 a5_2331;
									word32 a7_2332;
									word32 s6_2333;
									word32 s8_2334;
									word32 a1_2327;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A5F0, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_1039, out a0_1030, out a1_2327, out a2_2328, out a3_2329, out a4_2330, out a5_2331, out a7_2332, out s2_1004, out s3_1005, out s4_1006, out s5_1007, out s6_2333, out s7_1009, out s8_2334, out s9_2335, out s10_1002, out s11_2336);
									if (a0_1030 < 0x00 || a0_1030 >= s0_100)
										goto l2305DC5A;
									s0_100 -= a0_1030;
									s1_1017 = (word32) a0_1030 + s1_1039;
								}
								if ((s5_1007 & 32) != 0x00)
								{
									Eq_7997 a0_1068;
									word32 s1_1077;
									word32 s11_2356;
									word32 s9_2355;
									word32 s8_2354;
									word32 s6_2353;
									word32 a7_2352;
									word32 a5_2351;
									word32 a4_2350;
									word32 a3_2349;
									word32 a2_2348;
									word32 a1_2347;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A604, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_1077, out a0_1068, out a1_2347, out a2_2348, out a3_2349, out a4_2350, out a5_2351, out a7_2352, out s2_1004, out s3_1005, out s4_1006, out s5_1007, out s6_2353, out s7_1009, out s8_2354, out s9_2355, out s10_1002, out s11_2356);
									if (a0_1068 < 0x00 || a0_1068 >= s0_100)
										goto l2305DC5A;
									s0_100 -= a0_1068;
									s1_1017 = (word32) a0_1068 + s1_1077;
								}
								if ((s5_1007 & 16) != 0x00)
								{
									Eq_7997 a0_1106;
									word32 s1_1115;
									word32 s11_2376;
									word32 s9_2375;
									word32 s8_2374;
									word32 s6_2373;
									word32 a7_2372;
									word32 a5_2371;
									word32 a4_2370;
									word32 a3_2369;
									word32 a2_2368;
									word32 a1_2367;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A618, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_1115, out a0_1106, out a1_2367, out a2_2368, out a3_2369, out a4_2370, out a5_2371, out a7_2372, out s2_1004, out s3_1005, out s4_1006, out s5_1007, out s6_2373, out s7_1009, out s8_2374, out s9_2375, out s10_1002, out s11_2376);
									if (a0_1106 < 0x00 || a0_1106 >= s0_100)
										goto l2305DC5A;
									s0_100 -= a0_1106;
									s1_1017 = (word32) a0_1106 + s1_1115;
								}
								if ((s5_1007 & 8) != 0x00)
								{
									Eq_7997 a0_1144;
									word32 s1_1153;
									word32 s11_2396;
									word32 s9_2395;
									word32 s8_2394;
									word32 s6_2393;
									word32 a7_2392;
									word32 a5_2391;
									word32 a4_2390;
									word32 a3_2389;
									word32 a2_2388;
									word32 a1_2387;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A62C, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_1153, out a0_1144, out a1_2387, out a2_2388, out a3_2389, out a4_2390, out a5_2391, out a7_2392, out s2_1004, out s3_1005, out s4_1006, out s5_1007, out s6_2393, out s7_1009, out s8_2394, out s9_2395, out s10_1002, out s11_2396);
									if (a0_1144 < 0x00 || a0_1144 >= s0_100)
										goto l2305DC5A;
									s0_100 -= a0_1144;
									s1_1017 = (word32) a0_1144 + s1_1153;
								}
								if ((s5_1007 & 4) != 0x00)
								{
									Eq_7997 a0_1182;
									word32 s1_1191;
									word32 s11_2446;
									word32 s9_2445;
									word32 s8_2444;
									word32 s6_2443;
									word32 a7_2442;
									word32 a5_2441;
									word32 a4_2440;
									word32 a3_2439;
									word32 a2_2438;
									word32 a1_2437;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A63C, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_1191, out a0_1182, out a1_2437, out a2_2438, out a3_2439, out a4_2440, out a5_2441, out a7_2442, out s2_1004, out s3_1005, out s4_1006, out s5_1007, out s6_2443, out s7_1009, out s8_2444, out s9_2445, out s10_1002, out s11_2446);
									if (a0_1182 < 0x00 || a0_1182 >= s0_100)
										goto l2305DC5A;
									s0_100 -= a0_1182;
									s1_1017 = (word32) a0_1182 + s1_1191;
								}
								if ((s5_1007 & 2) != 0x00)
								{
									Eq_7997 a0_1220;
									word32 s1_1229;
									word32 s11_2456;
									word32 s9_2455;
									word32 s8_2454;
									word32 s6_2453;
									word32 a7_2452;
									word32 a5_2451;
									word32 a4_2450;
									word32 a3_2449;
									word32 a2_2448;
									word32 a1_2447;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A64C, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_1229, out a0_1220, out a1_2447, out a2_2448, out a3_2449, out a4_2450, out a5_2451, out a7_2452, out s2_1004, out s3_1005, out s4_1006, out s5_1007, out s6_2453, out s7_1009, out s8_2454, out s9_2455, out s10_1002, out s11_2456);
									if (a0_1220 < 0x00 || a0_1220 >= s0_100)
										goto l2305DC5A;
									s0_100 -= a0_1220;
									s1_1017 = (word32) a0_1220 + s1_1229;
								}
								if ((s5_1007 & 1) != 0x00)
								{
									word32 a5_2472;
									word32 a3_2470;
									word32 a2_2469;
									word32 s8_2475;
									word32 s9_2476;
									word32 s6_2474;
									word32 a7_2473;
									word32 s11_2477;
									Eq_7997 a0_1258;
									word32 s1_1267;
									word32 a4_2471;
									word32 a1_2468;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A658, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_1267, out a0_1258, out a1_2468, out a2_2469, out a3_2470, out a4_2471, out a5_2472, out a7_2473, out s2_1004, out s3_1005, out s4_1006, out s5_1007, out s6_2474, out s7_1009, out s8_2475, out s9_2476, out s10_1002, out s11_2477);
									if (a0_1258 < 0x00 || a0_1258 >= s0_100)
										goto l2305DC5A;
									s0_100 -= a0_1258;
									s1_1017 = (word32) a0_1258 + s1_1267;
								}
								if (s5_1007 << 0x10 < 0x00)
								{
									word32 a2_2479;
									word32 a1_2478;
									word32 a3_2480;
									word32 s5_2484;
									word32 a7_2483;
									word32 s9_2487;
									word32 a5_2482;
									word32 a4_2481;
									word32 s8_2486;
									word32 s11_2488;
									word32 s6_2485;
									Eq_7997 a0_1296;
									word32 s1_1305;
									ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A668, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_1305, out a0_1296, out a1_2478, out a2_2479, out a3_2480, out a4_2481, out a5_2482, out a7_2483, out s2_1004, out s3_1005, out s4_1006, out s5_2484, out s6_2485, out s7_1009, out s8_2486, out s9_2487, out s10_1002, out s11_2488);
									if (a0_1296 < 0x00 || a0_1296 >= s0_100)
										goto l2305DC5A;
									s0_100 -= a0_1296;
									s1_1017 = (word32) a0_1296 + s1_1305;
								}
							}
							if (s2_1004->dw00F8 << 0x14 >= 0x00)
							{
l2305E2BA:
								Eq_7997 a0_1451;
								word32 s11_2418;
								word32 s9_2417;
								word32 s8_2416;
								word32 s6_2415;
								word32 s5_2414;
								word32 a7_2413;
								word32 a5_2412;
								word32 a4_2411;
								word32 a3_2410;
								word32 a2_2409;
								word32 a1_2408;
								word32 s1_2407;
								snprintf(ra_1027, s1_1017, s0_100, &g_t230727FC, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_2407, out a0_1451, out a1_2408, out a2_2409, out a3_2410, out a4_2411, out a5_2412, out a7_2413, out s2_1004, out s3_1005, out s4_1006, out s5_2414, out s6_2415, out s7_1009, out s8_2416, out s9_2417, out s10_1002, out s11_2418);
								if (a0_1451 >= 0x00 && a0_1451 < s0_100)
									goto l2305DC66;
								goto l2305DC5A;
							}
							Eq_7997 a0_1351;
							word32 s11_2428;
							word32 s9_2427;
							word32 s8_2426;
							word32 s6_2425;
							word32 s5_2424;
							word32 a7_2423;
							word32 a4_2422;
							word32 a3_2421;
							word32 a1_2420;
							word32 s1_2419;
							Eq_2 a5_1356;
							Eq_2 a2_1353;
							ra_1027 = snprintf(ra_1027, s1_1017, s0_100, &g_t2308A678, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_2419, out a0_1351, out a1_2420, out a2_1353, out a3_2421, out a4_2422, out a5_1356, out a7_2423, out s2_1004, out s3_1005, out s4_1006, out s5_2424, out s6_2425, out s7_1009, out s8_2426, out s9_2427, out s10_1002, out s11_2428);
							if (a0_1351 >= 0x00 && a0_1351 < s0_100)
							{
								Eq_2 s2_1379 = &s2_1004->dw0104 + 1;
								word32 s6_1382 = 0x23081000;
								do
								{
									word32 a0_1392;
									Eq_2 s1_1398 = mbedtls_oid_get_extended_key_usage(s2_1379, fp + -56, a2_1353, a5_1356, dwLoc28, out a0_1392);
									Eq_7997 a0_1415;
									word32 s1_1424;
									word32 s11_2436;
									word32 s9_2435;
									word32 s8_2434;
									word32 s5_2433;
									word32 a7_2432;
									word32 a4_2431;
									word32 a3_2430;
									word32 a1_2429;
									ra_1027 = snprintf(ra_1027, s1_1398, dwArg0174, s6_1382 + 680, dwLoc48, dwLoc28, dwArg04, a5_254, dwArg24, s1, dwArg6C, out s0_100, out s1_1424, out a0_1415, out a1_2429, out a2_1353, out a3_2430, out a4_2431, out a5_1356, out a7_2432, out s2_1004, out s3_1005, out s4_1006, out s5_2433, out s6_1382, out s7_1009, out s8_2434, out s9_2435, out s10_1002, out s11_2436);
									if (a0_1415 < 0x00 || a0_1415 >= s0_100)
										goto l2305DC5A;
									s2_1379 = s2_1004->t000C;
									s0_100 -= a0_1415;
									s1_1017 = (word32) a0_1415 + s1_1424;
								} while (s2_1379 != 0x00);
								goto l2305E2BA;
							}
						}
					}
				}
			}
		}
	}
l2305DC5A:
	goto l2305DC66;
}

