pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305E2F8: Register Eq_2 mbedtls_x509_crt_verify_info(Register Eq_2 ra, Register Eq_2 a0, Register Eq_7997 a1, Register Eq_268475 a3, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg18, Stack Eq_2 dwArg44, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Register out Eq_268475 a3Out)
// Called from:
//      iot_tls_connect
Eq_2 mbedtls_x509_crt_verify_info(Eq_2 ra, Eq_2 a0, Eq_7997 a1, Eq_268475 a3, Eq_2 s3, Eq_2 s5, Eq_2 dwArg18, Eq_2 dwArg44, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgAC, union Eq_268475 & a3Out)
{
	Eq_2 s3_132 = a0;
	Eq_268475 s4_128 = a3;
	Eq_7997 s0_131 = a1;
	struct Eq_312428 * s2_30 = &g_t2308AB30;
	word32 s6_130 = 0x2308A000;
	while (s2_30->dw0004 != 0x00)
	{
		if ((s4_128 & s2_30->dw0000) != 0x00)
		{
			Eq_312486 a0_48;
			Eq_312486 s0_56;
			word32 s3_61;
			word32 s4_62;
			word32 s1_301;
			word32 a1_302;
			word32 a2_303;
			word32 a4_304;
			word32 a5_305;
			word32 a7_306;
			word32 s5_307;
			word32 s7_308;
			word32 s8_309;
			word32 s9_310;
			word32 s10_311;
			word32 s11_312;
			ra = snprintf(ra, s3_132, s0_131, s6_130 + 1772, dwLoc08, dwArg18, dwArg44, s5, s3, dwArg88, dwArgAC, out s0_56, out s1_301, out a0_48, out a1_302, out a2_303, out a3, out a4_304, out a5_305, out a7_306, out s2_30, out s3_61, out s4_62, out s5_307, out s6_130, out s7_308, out s8_309, out s9_310, out s10_311, out s11_312);
			if (a0_48 < 0x00 || a0_48 >= s0_56)
				goto l2305E368;
			s0_131 = s0_56 - a0_48;
			s3_132 = (word32) a0_48 + s3_61;
			s4_128 = s4_62 ^ s2_30->dw0000;
		}
		++s2_30;
	}
	if (s4_128 != 0x00)
	{
		Eq_312440 a0_82;
		Eq_312440 s0_90;
		word32 s1_285;
		word32 a1_286;
		word32 a2_287;
		word32 a4_288;
		word32 a5_289;
		word32 a7_290;
		word32 s2_291;
		word32 s3_292;
		word32 s4_293;
		word32 s5_294;
		word32 s6_295;
		word32 s7_296;
		word32 s8_297;
		word32 s9_298;
		word32 s10_299;
		word32 s11_300;
		ra = snprintf(ra, s3_132, s0_131, &g_t2308A6F4, dwLoc08, dwArg18, dwArg44, s5, s3, dwArg88, dwArgAC, out s0_90, out s1_285, out a0_82, out a1_286, out a2_287, out a3, out a4_288, out a5_289, out a7_290, out s2_291, out s3_292, out s4_293, out s5_294, out s6_295, out s7_296, out s8_297, out s9_298, out s10_299, out s11_300);
		if (a0_82 < 0x00 || a0_82 >= s0_90)
		{
l2305E368:
l2305E36E:
			0x00 = (uint16) dwArgA8;
			a3Out = a3;
			return ra;
		}
	}
	goto l2305E36E;
}

// 2305E396: Register Eq_2 mbedtls_x509_crt_check_key_usage(Register Eq_2 a0, Register int32 a1, Register out Eq_299498 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      mbedtls_ssl_check_cert_usage
//      x509_crt_check_parent
Eq_2 mbedtls_x509_crt_check_key_usage(Eq_2 a0, int32 a1, union Eq_299498 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a5_5 = *((word32) a0 + 0x00F8);
	Eq_2 a5_18 = a5_5 & 0x04;
	if ((a5_5 & 0x04) != 0x00)
	{
		a4 = *((word32) a0 + 260);
		a3 = a1 & ~0x08000001 & a4;
		if ((a1 & ~0x08000001) != a3)
		{
l2305E3C2:
			a5_18.u0 = ~0x020007FF;
			goto l2305E3C8;
		}
		a3 = a1 & 0x08000001;
		a5_18.u0 = 0x00;
		if ((a1 & 0x08000001) != ((a1 | a4) & 0x08000001))
			goto l2305E3C2;
	}
l2305E3C8:
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_18;
	return a5_18;
}

// 2305E3CC: Register word32 x509_crt_check_parent(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_312580 a4Out, Register out Eq_2 a5Out, Register out ptr32 a6Out, Register out ptr32 a7Out, Register out (ptr32 Eq_312584) s2Out, Register out (ptr32 Eq_312585) s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      x509_crt_verify_top.isra.7
//      x509_crt_verify_child
//      mbedtls_x509_crt_verify_with_profile
word32 x509_crt_check_parent(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_2 a5, Eq_2 dwArg0128, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_312580 & a4Out, union Eq_2 & a5Out, ptr32 & a6Out, ptr32 & a7Out, struct Eq_312584 & s2Out, struct Eq_312585 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	ptr32 s0_44;
	ptr32 a0_26;
	Eq_2 a1_27;
	ptr32 a6_32;
	ptr32 a7_33;
	struct Eq_312584 * s2_36;
	ptr32 s4_38;
	ptr32 s8_39;
	word32 a2_175;
	Eq_2 a5_132;
	Eq_312580 a4_128;
	ptr32 a3_124;
	struct Eq_312585 * s3_148;
	Eq_2 s1_142 = x509_name_cmp((word32) a0 + 76, (word32) a1 + 0x006C, a2, a4, a5, out a0_26, out a1_27, out a2_175, out a3_124, out a4_128, out a5_132, out a6_32, out a7_33, out s2_36, out s3_148, out s4_38, out s8_39);
	if (a0_26 != 0x00)
	{
l2305E3F2:
		s0_44 = ~0x00;
		goto l2305E3F4;
	}
	if (a2 != 0x00)
	{
		s0_44 = a0_26;
		s3_148 = (struct Eq_312585 *) *((word32) s1_142 + 24);
		if (a3_124 != 0x00)
		{
			Eq_2 a2_46 = s2_36->t0004;
			s1_142 = *((word32) a5_132 + 4);
			if (a2_46 == a5_132)
			{
				s1_142 = *((word32) a1_27 + 8);
				word32 a1_176;
				word32 a2_177;
				if (memcmp(s2_36->t0008, a1_27, a2_46, out a1_176, out a2_177, out a3_124, out a4_128, out a5_132) == 0x00)
					goto l2305E3F4;
			}
		}
		a5_132.u0 = 0x02;
		if (s3_148 <= (struct Eq_312585 *) 0x02)
			goto l2305E3F4;
	}
	a5_132 = *((word32) s1_142 + 252);
	if (a5_132 == 0x00)
		goto l2305E3F2;
	s0_44 = 0x00 - (word32) (mbedtls_x509_crt_check_key_usage(s1_142, 0x04, out a3_124, out a4_128, out a5_132) != 0x00);
l2305E3F4:
	0x00 = (uint16) dwArg0128;
	s1Out = s1_142;
	a0Out = s0_44;
	a2Out = dwArg0100;
	a3Out = a3_124;
	a4Out = a4_128;
	a5Out = a5_132;
	a6Out = a6_32;
	a7Out = a7_33;
	s2Out = s2_36;
	s3Out = s3_148;
	s4Out = s4_38;
	s8Out = s8_39;
	return dwArgE4;
}

// 2305E446: Register Eq_2 x509_crt_verify_top.isra.7(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_308611 a7, Register Eq_2 s3, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg64, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArg0118, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 a6Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out Eq_2 s6Out, Register out Eq_308611 s7Out, Register out Eq_2 s8Out, Register out ptr32 s9Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      x509_crt_verify_child
//      mbedtls_x509_crt_verify_with_profile
Eq_2 x509_crt_verify_top.isra.7(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_308611 a7, Eq_2 s3, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg64, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArg0118, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & a6Out, ptr32 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, union Eq_2 & s6Out, union Eq_308611 & s7Out, union Eq_2 & s8Out, ptr32 & s9Out, union Eq_2 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 s0_106 = a0;
	Eq_2 s2_129 = a1;
	Eq_2 s6_226 = a2;
	Eq_2 s4_151 = a3;
	Eq_2 s8_152 = a4;
	Eq_2 s5_225 = a6;
	Eq_308611 s7_227 = a7;
	if (mbedtls_x509_time_is_past() != 0x00)
	{
		*(a5 | 1) = (word32) *a5;
		a5 |= 1;
	}
	if (mbedtls_x509_time_is_future() != 0x00)
		*(a5 | 0x0200) = (word32) *a5;
	word32 * a5_69 = 0x01 << (word32) (*((word32) a0 + 296)) + -1 & *a2;
	if (a5_69 == null)
		*(a5_69 | 0x04000000) = *a5_69;
	Eq_2 a4_136 = *((word32) a2 + 4);
	union Eq_2 * a5_82 = 0x01 << (word32) (*((word32) a0 + 297)) + -1 & a4_136;
	if (a5_82 == null)
	{
		*(a5_82 | 0x08000000) = *a5_82;
		a4_136.u0 = 0x08000000;
		a5_82 |= 0x08000000;
	}
	ptr32 a0_441;
	Eq_2 s1_148 = *a5_82;
	*(a5_82 | 8) = (union Eq_2 *) s1_148;
	Eq_2 a5_118;
	Eq_2 a0_94 = mbedtls_md_info_from_type((word32) *((word32) a0 + 296), out a5_118);
	Eq_2 s9_451 = a0_94;
	if (a0_94 != 0x00)
	{
		s0_106 = *((word32) a1 + 20);
		s3.u0 = 0x00;
		word32 a1_1160;
		ra = mbedtls_md(ra, a0_94, a1, a2, fp + -96, out a1_1160, out a5_118);
		s10 = (word32) (a3 < 1);
		s11 = (word32) a3 + 1;
		while (s2_129 != 0x00)
		{
			Eq_2 a2_141;
			Eq_2 a3_142;
			Eq_2 a0_156;
			s0_106 = x509_crt_check_parent(s0_106, s2_129, 0x01, a4_136, a5_118, dwArgA8, out s1_148, out a0_156, out a2_141, out a3_142, out a4_136, out a5_118, out a6, out a7, out s2_129, out s3, out s4_151, out s8_152);
			if (a0_156 == 0x00)
			{
				s0_106 = *((word32) a3_142 + 0x0044);
				Eq_2 a5_160 = s11;
				if (a3_142 == *((word32) s2_129 + 0x0044))
				{
					s0_106 = *((word32) a0_156 + 72);
					word32 a1_1161;
					word32 a2_1162;
					word32 a3_1163;
					word32 a4_1164;
					if (memcmp(a0_156, *((word32) s2_129 + 72), a2_141, out a1_1161, out a2_1162, out a3_1163, out a4_1164, out a5_160) == 0x00)
						a5_160 = s4_151;
				}
				a4_136 = *((word32) s2_129 + 0x0100);
				if (a4_136 > 0x00)
				{
					a5_118 = a5_160 - s8_152;
					if (a4_136 >= a5_118)
						goto l2305E548;
				}
				else
				{
l2305E548:
					word32 a0_215;
					ra = mbedtls_pk_verify_ext(ra, (word32) *((word32) s0_106 + 297), *((word32) s0_106 + 300), (word32) s2_129 + 188, (word32) *((word32) s0_106 + 296), mbedtls_md_get_size(a0_94), *((word32) s0_106 + 292), *((word32) s0_106 + 288), s10, s11, mstatus, dwLoc80, dwLoc3C, s11, dwArg44, dwArgB8, dwArg0118, out s0_106, out s1_148, out a0_215, out a4_136, out a5_118, out a6, out a7, out s2_129, out s3, out s4_151, out s5_225, out s6_226, out s7_227, out s8_152, out s10, out s11, out mstatus);
					if (a0_215 == 0x00)
					{
						if (mbedtls_x509_time_is_past() == 0x00 && mbedtls_x509_time_is_future() == 0x00)
						{
							s3 = s2_129;
							goto l2305E5A0;
						}
						if (s3 == 0x00)
							s3 = s2_129;
					}
				}
			}
			s2_129 = *((word32) s2_129 + 304);
		}
		if (s3 != 0x00)
		{
l2305E5A0:
			s1_148 = *a5_118;
			*(a5_118 & ~0x08) = (union Eq_2 *) s1_148;
			Eq_2 a2_275;
			union Eq_2 * a5_277;
			Eq_2 a0_274 = x509_profile_check_key((word32) *((word32) s0_106 + 297), (word16) s3.u0 + 188, out a2_275, out a4_136, out a5_277);
			if (a0_274 != 0x00)
			{
				s1_148 = *a5_277;
				*(a5_277 | 0x10000000) = (union Eq_2 *) s1_148;
				a4_136.u0 = 0x10000000;
			}
			s0_106 = *((word16) a4_136.u0 + 0x0044);
			a5_118 = *((word16) s3.u0 + 0x0044);
			if (a4_136 == a5_118)
			{
				s0_106 = *((word32) a0_274 + 72);
				word32 a2_1166;
				word32 a3_1167;
				word32 a1_1165;
				if (memcmp(a0_274, *((word16) s3.u0 + 72), a2_275, out a1_1165, out a2_1166, out a3_1167, out a4_136, out a5_118) == 0x00)
					goto l2305E504;
			}
			if (mbedtls_x509_time_is_past() != 0x00)
				a5_118 |= 1;
			if (mbedtls_x509_time_is_future() != 0x00)
				a5_118 |= 0x0200;
			if (s5_225 == 0x00)
			{
l2305E5FE:
				a5_118 |= a4_136;
				*a5_118 = *a5_118;
				a0_441 = 0x00;
				goto l2305E608;
			}
			word32 tp_461;
			word32 t1_465;
			word32 t5_467;
			word32 t6_468;
			s5_225();
			if (a0_441 != 0x00)
			{
l2305E608:
				s0Out = s0_106;
				s1Out = dwArg0118;
				a0Out = a0_441;
				a4Out = a4_136;
				a5Out = a5_118;
				a6Out = a6;
				a7Out = dwLoc34;
				s2Out = s2_129;
				s3Out = s3;
				s4Out = s4_151;
				s5Out = s8;
				s6Out = s6_226;
				s7Out = s7_227;
				s8Out = s8_152;
				s9Out = dwLoc74;
				s10Out = s10;
				s11Out = s11;
				mstatusOut = mstatus;
				return dwArg0158;
			}
l2305E634:
			word32 tp_552;
			word32 t1_556;
			word32 t5_558;
			word32 t6_559;
			s5_225();
			if (a0_441 != 0x00)
				goto l2305E608;
			goto l2305E5FE;
		}
	}
l2305E504:
	if (s5_225 == 0x00)
		goto l2305E5FE;
	goto l2305E634;
}

