pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305E642: Register Eq_2 x509_crt_verify_child(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s7, Register Eq_308611 s8, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg58, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_313078 a4Out, Register out (ptr32 Eq_2) a5Out, Register out ptr32 a6Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out Eq_308611 s8Out, Register out ptr32 s9Out, Register out Eq_2 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      x509_crt_verify_child
//      mbedtls_x509_crt_verify_with_profile
Eq_2 x509_crt_verify_child(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 s2, Eq_2 s5, Eq_2 s7, Eq_308611 s8, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg58, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArg0108, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_313078 & a4Out, union Eq_2 & a5Out, ptr32 & a6Out, ptr32 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, union Eq_308611 & s8Out, ptr32 & s9Out, union Eq_2 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 s0_375;
	union Eq_2 * a5_393;
	ptr32 a6_394;
	Eq_2 a2_125;
	struct Eq_313097 * sp_3 = fp + -144;
	Eq_2 s1_32 = a0;
	Eq_2 s3_146 = a1;
	Eq_2 s10_235 = a3;
	Eq_2 s4_222 = a6;
	Eq_2 s2_220 = dwArg58;
	Eq_2 s6_224 = dwLoc84;
	a2_125 = a2;
	if (a5 != 0x00)
	{
		word32 a0_49;
		word32 a3_905;
		word32 a4_906;
		word32 a5_907;
		word32 a7_908;
		s1_32 = x509_name_cmp((word32) a0 + 76, (word32) a0 + 0x006C, a2, a4, a5, out a0_49, out a1, out a2_125, out a3_905, out a4_906, out a5_907, out a6_394, out a7_908, out s2_220, out s3_146, out s4_222, out s8);
		if (a0_49 == 0x00)
			s4_222 = (word32) s4_222 + 1;
		a5.u0 = 0x08;
		if (s2_220 == 0x08)
		{
			s0_375 = *(union Eq_2 *) 0x08;
			*(union Eq_2 *) 0x08 = s0_375;
			a5_393 = (union Eq_2 *) 0x08;
			goto l2305E69A;
		}
	}
	if (mbedtls_x509_time_is_past() != 0x00)
	{
		a5 |= 1;
		*a5.u0 = *a5.u0;
	}
	if (mbedtls_x509_time_is_future() != 0x00)
		*(a5 | 0x0200) = (word32) *a5.u0;
	word32 * a5_97 = 0x01 << (word32) (*((word32) s1_32 + 296)) + -1 & *dwLoc84;
	if (a5_97 == null)
		*(a5_97 | 0x04000000) = *a5_97;
	Eq_2 a4_109 = *((word32) dwLoc84 + 4);
	word32 * a5_110 = 0x01 << (word32) (*((word32) s1_32 + 297)) + -1 & a4_109;
	if (a5_110 == null)
	{
		*(a5_110 | 0x08000000) = *a5_110;
		a4_109.u0 = 0x08000000;
	}
	Eq_2 ra_232;
	Eq_2 a5_119;
	Eq_2 a0_118 = mbedtls_md_info_from_type((word32) *((word32) s1_32 + 296), out a5_119);
	ra_232 = ra;
	if (a0_118 != 0x00)
	{
		struct Eq_313229 * s1_134 = *((word32) a1 + 20);
		word32 a5_910;
		word32 a1_909;
		Eq_2 ra_160 = mbedtls_md(ra, a0_118, a1, a2_125, fp + -96, out a1_909, out a5_910);
		Eq_2 s5_148 = (word32) s3_146 + 188;
		word32 * a5_168;
		word32 a2_911;
		word32 a4_912;
		if (x509_profile_check_key((word32) s1_134->b0129, s5_148, out a2_911, out a4_912, out a5_168) != 0x00)
			*(a5_168 | 0x10000000) = *a5_168;
		Eq_2 a1_178 = s1_134->t012C;
		dwLoc84 = a1_178;
		word32 a0_213;
		word32 s1_914;
		word32 a6_915;
		word32 a7_916;
		word32 s5_917;
		word32 s11_918;
		word32 s0_913;
		ra_232 = mbedtls_pk_verify_ext(ra_160, (word32) s1_134->b0129, a1_178, s5_148, (word32) s1_134->b0128, mbedtls_md_get_size(a0_118), s1_134->t0124, s1_134->t0120, a3, a0_118, mstatus, dwLoc90, s0, dwArg14, ra, dwArgA8, dwArg0108, out s0_913, out s1_914, out a0_213, out a4_109, out a5_119, out a6_915, out a7_916, out s2_220, out s3_146, out s4_222, out s5_917, out s6_224, out s7, out s8, out s10_235, out s11_918, out mstatus);
		if (a0_213 == 0x00)
		{
l2305E786:
			Eq_2 s5_255 = a2;
			Eq_2 s11_263 = (word32) (s2_220 < 1);
			while (true)
			{
				ui32 a4_392;
				word32 a7_395;
				word32 s5_386;
				word32 ra_385;
				word32 s9_383;
				word32 s1_376;
				word32 a0_388;
				Eq_308611 a7_292;
				Eq_2 a4_296;
				Eq_2 a3_297;
				Eq_2 a1_300;
				if (s5_255 == 0x00)
					break;
				word32 a0_291;
				word32 a2_920;
				word32 a3_921;
				word32 a6_922;
				word32 a7_923;
				word32 s1_919;
				x509_crt_check_parent(s3_146, s5_255, 0x00, a4_109, a5_119, dwArg98, out s1_919, out a0_291, out a2_920, out a3_921, out a4_109, out a5_119, out a6_922, out a7_923, out s2_220, out s3_146, out s4_222, out s8);
				if (a0_291 == 0x00)
				{
					a7_292 = s8;
					a4_296 = s4_222;
					a3_297 = (word32) s2_220 + 1;
					a1_300 = s5_255;
					goto l2305E7DA;
				}
				s5_255 = *((word32) s5_255 + 304);
			}
			Eq_2 s5_304 = *((word32) s3_146 + 304);
			Eq_2 a4_305 = (word32) (s2_220 < 1);
			s11_263 = (word32) s2_220 + 2 - s4_222;
			while (s5_304 != 0x00)
			{
				Eq_2 a5_318 = *((word32) s5_304 + 0x0100);
				if (a5_318 <= 0x00 || a5_318 >= s11_263)
				{
					word32 a0_349;
					word32 a5_927;
					word32 a6_928;
					word32 a7_929;
					word32 s4_930;
					word32 s1_924;
					word32 a2_925;
					word32 a3_926;
					Eq_2 s0_340 = x509_crt_check_parent(s3_146, s5_304, 0x00, a4_305, a5_318, dwArg98, out s1_924, out a0_349, out a2_925, out a3_926, out a4_305, out a5_927, out a6_928, out a7_929, out s2_220, out s3_146, out s4_930, out s8);
					s4_222 = ra;
					if (a0_349 == 0x00)
					{
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						Eq_2 stackArg20 = <invalid>;
						Eq_2 stackArg24 = <invalid>;
						Eq_2 stackArg88 = <invalid>;
						Eq_2 stackArg136 = <invalid>;
						Eq_2 stackArg152 = <invalid>;
						Eq_2 stackArg264 = <invalid>;
						dwLoc90 = s7;
						ra_385 = x509_crt_verify_child(ra_232, s0_340, s3_146, s5_304, a2, s10_235, s6_224, (word32) s2_220 + 1, ra, s2_220, s5_304, s7, s8, mstatus, stackArg20, stackArg24, stackArg88, stackArg136, stackArg152, dwArg18, stackArg264, out s0_375, out s1_376, out a0_388, out a4_392, out a5_393, out a6_394, out a7_395, out s2_220, out s3_146, out s4_222, out s5_386, out s6_224, out s7, out s8, out s9_383, out s10_235, out s11, out mstatus);
						goto l2305E80E;
					}
				}
				s5_304 = *((word32) s5_304 + 304);
			}
			a7_292 = s8;
			a4_296 = s4_222;
			a3_297 = (word32) s2_220 + 1;
			a1_300 = a2;
l2305E7DA:
			ra_385 = x509_crt_verify_top.isra.7(ra_232, s3_146, a1_300, s6_224, a3_297, a4_296, fp + -100, s7, a7_292, s3_146, s10_235, s11_263, mstatus, s2, s0, dwLoc2C, dwArg18, s5, dwArg88, out s0_375, out s1_376, out a0_388, out a4_392, out a5_393, out a6_394, out a7_395, out s2_220, out s3_146, out s4_222, out s5_386, out s6_224, out s7, out s8, out s9_383, out s10_235, out s11, out mstatus);
l2305E80E:
			sp_3 = fp + -144;
			if (a0_388 == 0x00)
			{
				if (s7 != 0x00)
				{
					word32 a0_520;
					word32 tp_533;
					word32 t5_534;
					word32 t6_535;
					s7();
					if (a0_520 != 0x00)
						goto l2305E69A;
				}
				s0_375 = *a5_393;
				a5_393 |= a4_392;
				*a5_393 = (union Eq_2 *) s0_375;
			}
l2305E69A:
			struct Eq_313419 * sp_556 = sp_3->ptr0048;
			Eq_313078 a4_553 = sp_3->t0020;
			ptr32 a0_554 = sp_3->ptr0004;
			ptr32 s9_558 = sp_556->ptr0198;
			ptr32 s5_559 = sp_556->ptr01B8;
			ptr32 a7_560 = sp_556->ptr01D8;
			ptr32 s1_562 = sp_556->ptr011C;
			Eq_2 ra_564 = sp_556->t015C;
			s0Out = s0_375;
			s1Out = s1_562;
			a0Out = a0_554;
			a4Out = a4_553;
			a5Out = a5_393;
			a6Out = a6_394;
			a7Out = a7_560;
			s2Out = s2_220;
			s3Out = s3_146;
			s4Out = s4_222;
			s5Out = s5_559;
			s6Out = s6_224;
			s7Out = s7;
			s8Out = s8;
			s9Out = s9_558;
			s10Out = s10_235;
			s11Out = s11;
			mstatusOut = mstatus;
			return ra_564;
		}
	}
	a5_119 |= 8;
	*a5_119 = *a5_119;
	goto l2305E786;
}

// 2305E842: Register Eq_2 mbedtls_x509_crt_check_extended_key_usage(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a5Out, Register out ptr32 s3Out)
// Called from:
//      mbedtls_ssl_check_cert_usage
Eq_2 mbedtls_x509_crt_check_extended_key_usage(Eq_2 a0, Eq_2 a1, Eq_2 a2, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a5Out, ptr32 & s3Out)
{
	Eq_2 a5_151 = *((word32) a0 + 0x00F8);
	if (a5_151 << 0x14 >= 0x00)
	{
		s1Out = s1;
		a0Out = 0x00;
		a5Out = a5_151;
		s3Out = s3;
		return s0;
	}
	else
	{
		a1_41 = a1;
		do
		{
			ptr32 a0_132;
			Eq_2 a1_41;
			if (a5_151 == a2)
			{
				word32 a3_176;
				word32 a2_175;
				word32 a4_177;
				a0 = memcmp(a0, a1, a2, out a1_41, out a2_175, out a3_176, out a4_177, out a5_151);
				if (a0 == 0x00)
					goto l2305E8AA;
			}
			Eq_2 s0_45 = *((word32) a5_151 + 4);
			if (a5_151 == 0x04)
			{
				s0_45 = *((word32) a1_41 + 8);
				word32 a2_178;
				word32 a3_179;
				word32 a4_180;
				a0 = memcmp(587768748, a1_41, 0x04, out a1_41, out a2_178, out a3_179, out a4_180, out a5_151);
				if (a0 != 0x00)
					goto l2305E884;
l2305E8AA:
				a0_132 = 0x00;
				goto l2305E88E;
			}
l2305E884:
		} while (*((word32) s0_45 + 0x0C) != 0x00);
		a0_132 = ~0x020007FF;
l2305E88E:
		s1Out = a2;
		a0Out = a0_132;
		a5Out = a5_151;
		s3Out = 0x2308A000;
		return s1;
	}
}

// 2305E8B2: Register Eq_2 mbedtls_x509_crt_verify_with_profile(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_308611 a7, Register Eq_308611 s3, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg58, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Register out ptr32 a0Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s5Out)
// Called from:
//      mbedtls_ssl_parse_certificate
Eq_2 mbedtls_x509_crt_verify_with_profile(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_308611 a7, Eq_308611 s3, Eq_2 s7, Eq_2 s9, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg58, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, ptr32 & a0Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s5Out)
{
	if (a3 == 0x00)
	{
		a0Out = ~0x020007FF;
		a4Out = a4;
		a5Out = a5;
		s5Out = s5;
		return ra;
	}
	else
	{
		Eq_2 s10_113;
		a5->u0 = 0x00;
		Eq_2 s0_102 = a5;
		Eq_2 s2_273 = a3;
		Eq_2 s4_275 = a1;
		Eq_2 s1_258 = a0;
		s10_113 = s10;
		if (a4 != 0x00)
		{
			word32 a4_1003;
			word32 a3_1002;
			word32 a1_1000;
			word32 a2_1001;
			word32 a5_1004;
			Eq_2 a0_50 = strlen(a4, out a1_1000, out a2_1001, out a3_1002, out a4_1003, out a5_1004);
			Eq_2 a5_56 = *((word32) a0 + 0x00F8);
			s7 = a0_50;
			a5 = a5_56 & 32;
			if ((a5_56 & 32) == 0x00)
			{
				struct Eq_313642 * s8_111 = (word32) a0 + 0x006C;
				s10_113.u0 = 0x02;
				s11.u0 = 0x2308A000;
				do
				{
					a5.u0 = 0x03;
					if (s8_111->dw0004 == 0x03)
					{
						word32 a2_1006;
						word32 a1_1005;
						word32 a3_1007;
						word32 a4_1008;
						if (memcmp(587769636, s8_111->t0008, 0x03, out a1_1005, out a2_1006, out a3_1007, out a4_1008, out a5) == 0x00)
						{
							Eq_2 a4_129 = s8_111->t0010;
							if (a4_129 == a0_50)
							{
								word32 a7_1010;
								word32 a3_1009;
								if (x509_memcasecmp(s8_111->t0014, a4, a0_50, out a3_1009, out a4_129, out a5, out a7_1010) == 0x00)
									goto l2305E96C;
							}
							if (a4_129 > 0x02)
							{
								word32 a1_1011;
								word32 a2_1012;
								word32 a3_1013;
								word32 a4_1014;
								if (memcmp(s8_111->t0014, 0x2308A720, 0x02, out a1_1011, out a2_1012, out a3_1013, out a4_1014, out a5) == 0x00)
								{
									word32 a0_164;
									s0_102 = x509_check_wildcard(a4, out a0_164, out a5, out s8_111);
									if (a0_164 == 0x00)
										goto l2305E96C;
								}
							}
						}
					}
					s8_111 = s8_111->ptr0018;
				} while (s8_111 != null);
			}
			else
			{
				struct Eq_313637 * s9_110 = (word32) a0 + 232;
				s10_113.u0 = 0x02;
				s11.u0 = 0x2308A000;
				do
				{
					Eq_2 s8_64 = s9_110->t0004;
					if (s8_64 == a0_50)
					{
						word32 a3_1015;
						word32 a7_1017;
						word32 a4_1016;
						if (x509_memcasecmp(a4, s9_110->t0008, a0_50, out a3_1015, out a4_1016, out a5, out a7_1017) == 0x00)
							goto l2305E96C;
					}
					if (s8_64 > 0x02)
					{
						word32 a4_1021;
						word32 a1_1018;
						word32 a2_1019;
						word32 a3_1020;
						if (memcmp(s9_110->t0008, 0x2308A720, 0x02, out a1_1018, out a2_1019, out a3_1020, out a4_1021, out a5) == 0x00)
						{
							word32 a0_96;
							word32 s8_1022;
							s0_102 = x509_check_wildcard(a4, out a0_96, out a5, out s8_1022);
							if (a0_96 == 0x00)
								goto l2305E96C;
						}
					}
					s9_110 = s9_110->ptr000C;
				} while (s9_110 != null);
			}
			s0_102 = *a5.u0;
			a5 |= 4;
			*a5.u0 = s0_102;
			s11.u0 = 0x2308A000;
			s10_113.u0 = 0x02;
		}
l2305E96C:
		word32 a0_208 = mbedtls_pk_get_type((word32) a0 + 188, a5);
		union Eq_2 * a5_223 = 0x01 << a0_208 + -1 & *((word32) a3 + 4);
		if (a5_223 == null)
		{
			s0_102 = *a5_223;
			*(a5_223 | 0x08000000) = (union Eq_2 *) s0_102;
		}
		word32 a2_1023;
		Eq_2 a4_234;
		Eq_2 a5_235;
		if (x509_profile_check_key(a0_208, (word32) a0 + 188, out a2_1023, out a4_234, out a5_235) != 0x00)
		{
			s0_102 = *a5_235;
			*(a5_235 | 0x10000000) = (union Eq_2 *) s0_102;
			a4_234.u0 = 0x10000000;
			a5_235 |= 0x10000000;
		}
		Eq_2 s3_253 = a1;
		while (true)
		{
			Eq_2 a4_338;
			ptr32 a0_334;
			Eq_2 a5_339;
			Eq_2 a5_285;
			Eq_2 a2_288;
			Eq_2 a1_289;
			Eq_2 s3_274;
			if (s3_253 == 0x00)
				break;
			word32 a0_280;
			word32 a2_1024;
			word32 a3_1025;
			word32 a6_1026;
			word32 a7_1027;
			word32 s8_1028;
			s0_102 = x509_crt_check_parent(s1_258, s3_253, 0x00, a4_234, a5_235, dwArgC8, out s1_258, out a0_280, out a2_1024, out a3_1025, out a4_234, out a5_235, out a6_1026, out a7_1027, out s2_273, out s3_274, out s4_275, out s8_1028);
			if (a0_280 == 0x00)
			{
				a5_285 = s0_102;
				a2_288 = s2_273;
				a1_289 = s3_274;
				goto l2305EA38;
			}
			s3_253 = *((word32) s3_274 + 304);
		}
		s3_274 = *((word32) s1_258 + 304);
		while (s3_274 != 0x00)
		{
			Eq_2 a3_304;
			Eq_2 s3_312;
			word32 a0_318;
			word32 a6_1030;
			word32 a7_1031;
			word32 s8_1032;
			word32 a2_1029;
			s0_102 = x509_crt_check_parent(s1_258, s3_274, 0x00, a4_234, a5_235, dwArgC8, out s1_258, out a0_318, out a2_1029, out a3_304, out a4_234, out a5_235, out a6_1030, out a7_1031, out s2_273, out s3_312, out s4_275, out s8_1032);
			if (a0_318 == 0x00)
			{
				word32 s0_1033;
				word32 a7_1036;
				word32 s2_1037;
				word32 s3_1038;
				word32 s4_1039;
				word32 s5_1040;
				word32 s6_1041;
				word32 s7_1042;
				word32 s8_1043;
				word32 s9_1044;
				word32 s10_1045;
				word32 mstatus_1047;
				word32 s11_1046;
				word32 s1_1034;
				word32 a6_1035;
				x509_crt_verify_child(ra, s0_102, s1_258, s3_312, s4_275, a3_304, s2_273, 0x00, 0x00, s2_273, a6, s7, s3, mstatus, dwLoc4C, s10, dwLoc08, dwArg28, s9, s1, dwArgA8, out s0_1033, out s1_1034, out a0_334, out a4_338, out a5_339, out a6_1035, out a7_1036, out s2_1037, out s3_1038, out s4_1039, out s5_1040, out s6_1041, out s7_1042, out s8_1043, out s9_1044, out s10_1045, out s11_1046, out mstatus_1047);
				goto l2305EA60;
			}
			s3_274 = *((word32) s3_312 + 304);
		}
		a5_285 = s0_102;
		a2_288 = s2_273;
		a1_289 = s4_275;
l2305EA38:
		word32 a7_1051;
		word32 s2_1052;
		word32 s3_1053;
		word32 s4_1054;
		word32 s5_1055;
		word32 s6_1056;
		word32 s7_1057;
		word32 s8_1058;
		word32 s9_1059;
		word32 s10_1060;
		word32 mstatus_1062;
		word32 s11_1061;
		word32 s0_1048;
		word32 s1_1049;
		word32 a6_1050;
		x509_crt_verify_top.isra.7(ra, s1_258, a1_289, a2_288, 0x00, 0x00, a5_285, a6, a7, s3_274, s10_113, s11, mstatus, dwLoc20, dwLoc1C, dwArg04, s1, dwArg58, dwArgB8, out s0_1048, out s1_1049, out a0_334, out a4_338, out a5_339, out a6_1050, out a7_1051, out s2_1052, out s3_1053, out s4_1054, out s5_1055, out s6_1056, out s7_1057, out s8_1058, out s9_1059, out s10_1060, out s11_1061, out mstatus_1062);
l2305EA60:
		if (a0_334 == 0x00)
		{
			a0_334 = 0x00;
			if (a5_339 != 0x00)
				a0_334 = ~0x020006FF;
		}
		a0Out = a0_334;
		a4Out = a4_338;
		a5Out = a5_339;
		s5Out = s4;
		return dwArg68;
	}
}

// 2305EA9C: Register Eq_2 mbedtls_x509_crt_init(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a5Out)
// Called from:
//      iot_tls_connect
//      mbedtls_ssl_parse_certificate
//      mbedtls_x509_crt_parse_der
Eq_2 mbedtls_x509_crt_init(Eq_2 ra, Eq_2 a0, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a5Out)
{
	ptr32 a0_7;
	ptr32 a1_8;
	ptr32 a3_10;
	ptr32 a5_12;
	word32 t1_20;
	word32 a2_21;
	word32 a4_22;
	Eq_2 ra_13 = memset(ra, a0, 0x00, 308, out t1_20, out a0_7, out a1_8, out a2_21, out a3_10, out a4_22, out a5_12);
	a0Out = a0_7;
	a1Out = a1_8;
	a3Out = a3_10;
	a5Out = a5_12;
	return ra_13;
}

// 2305EAA6: Register Eq_2 mbedtls_x509_crt_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a5Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      iot_tls_destroy
//      mbedtls_ssl_session_free
//      mbedtls_ssl_parse_certificate
//      mbedtls_x509_crt_parse_der
Eq_2 mbedtls_x509_crt_free(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0138, Eq_2 dwArg0178, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a5Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = a0;
		a1Out = a1;
		a2Out = a2;
		a5Out = a5;
		s3Out = s3;
		s4Out = s4;
		s8Out = s8;
		return ra;
	}
	else
	{
		Eq_2 s1_124 = a0;
		Eq_2 s0_102 = a0;
		do
		{
			Eq_2 a0_126;
			Eq_2 a2_118;
			ra = mbedtls_pk_free(ra, (word32) s0_102 + 188, a5, out a0_126, out a2_118, out a5);
			Eq_2 s2_26 = *((word32) s0_102 + 100);
			while (s2_26 != 0x00)
			{
				s3 = *((word32) s2_26 + 24);
				word32 a1_361;
				mbedtls_zeroize(s2_26, 32, out a1_361);
				word32 a3_362;
				word32 a4_363;
				word32 a6_364;
				word32 s4_365;
				word32 t3_366;
				vPortFree(s2_26, a2_118, a5, mstatus, dwArg0138, dwArg0178, out s0_102, out s1_124, out a0_126, out a1, out a2_118, out a3_362, out a4_363, out a5, out a6_364, out s4_365, out t3_366);
				s2_26 = s3;
			}
			Eq_2 s2_53 = *((word32) s0_102 + 0x0084);
			while (s2_53 != 0x00)
			{
				s3 = *((word32) s2_53 + 24);
				word32 a1_367;
				mbedtls_zeroize(s2_53, 32, out a1_367);
				word32 a3_368;
				word32 a4_369;
				word32 a6_370;
				word32 s4_371;
				word32 t3_372;
				vPortFree(s2_53, a2_118, a5, mstatus, dwArg0138, dwArg0178, out s0_102, out s1_124, out a0_126, out a1, out a2_118, out a3_368, out a4_369, out a5, out a6_370, out s4_371, out t3_372);
				s2_53 = s3;
			}
			Eq_2 s2_105 = *((word32) s0_102 + 0x0114);
			while (s2_105 != 0x00)
			{
				s3 = *((word32) s2_105 + 0x0C);
				word32 a1_373;
				mbedtls_zeroize(s2_105, 0x10, out a1_373);
				word32 a3_374;
				word32 a4_375;
				word32 a6_376;
				word32 s4_377;
				word32 t3_378;
				vPortFree(s2_105, a2_118, a5, mstatus, dwArg0138, dwArg0178, out s0_102, out s1_124, out a0_126, out a1, out a2_118, out a3_374, out a4_375, out a5, out a6_376, out s4_377, out t3_378);
				s2_105 = s3;
			}
			Eq_2 s2_107 = *((word32) s0_102 + 244);
			while (s2_107 != 0x00)
			{
				s3 = *((word32) s2_107 + 0x0C);
				word32 a1_379;
				mbedtls_zeroize(s2_107, 0x10, out a1_379);
				word32 s0_380;
				word32 a3_381;
				word32 a4_382;
				word32 a6_383;
				word32 s4_384;
				word32 t3_385;
				vPortFree(s2_107, a2_118, a5, mstatus, dwArg0138, dwArg0178, out s0_380, out s1_124, out a0_126, out a1, out a2_118, out a3_381, out a4_382, out a5, out a6_383, out s4_384, out t3_385);
				s2_107 = s3;
			}
			struct Eq_314119 * s0_137 = *((word32) a0_126 + 8);
			if (a0_126 != 0x00)
			{
				word32 a1_386;
				word32 a0_387;
				word32 a3_388;
				word32 a4_389;
				word32 a6_390;
				word32 s4_391;
				word32 t3_392;
				vPortFree(mbedtls_zeroize(a0_126, a1, out a1_386), a2_118, a5, mstatus, dwArg0138, dwArg0178, out s0_137, out s1_124, out a0_387, out a1, out a2_118, out a3_388, out a4_389, out a5, out a6_390, out s4_391, out t3_392);
			}
			s0_102 = s0_137->t0130;
		} while (s0_102 != 0x00);
		Eq_2 s0_168 = s1_124;
		do
		{
			Eq_2 s2_173 = *((word32) s0_168 + 304);
			Eq_2 a1_175;
			Eq_2 a0_174 = mbedtls_zeroize(s0_168, 308, out a1_175);
			if (s1_124 != s0_168)
			{
				word32 s0_393;
				word32 a3_394;
				word32 a4_395;
				word32 a6_396;
				word32 s4_397;
				word32 t3_398;
				vPortFree(s0_168, a2_118, a5, mstatus, dwArg0138, dwArg0178, out s0_393, out s1_124, out a0_174, out a1_175, out a2_118, out a3_394, out a4_395, out a5, out a6_396, out s4_397, out t3_398);
			}
			s0_168 = s2_173;
		} while (s2_173 != 0x00);
		s0Out = s2_173;
		s1Out = s1_124;
		a0Out = a0_174;
		a1Out = a1_175;
		a2Out = dwArg48;
		a5Out = a5;
		s3Out = s3;
		s4Out = dwArg04;
		s8Out = dwLoc1C;
		return ra;
	}
}

