pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305F1F4: Register Eq_2 mbedtls_x509_crt_parse(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s8, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack word32 dwArgF4, Stack Eq_2 dwArgF8, Stack word32 dwArg010C, Stack Eq_2 dwArg0138, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      iot_tls_connect
//      mbedtls_x509_crt_parse_file
Eq_2 mbedtls_x509_crt_parse(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s5, Eq_2 s6, Eq_2 s8, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgB8, word32 dwArgF4, Eq_2 dwArgF8, word32 dwArg010C, Eq_2 dwArg0138, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a5Out, ptr32 & mstatusOut)
{
	Eq_2 s0_143;
	if (a0 != 0x00)
	{
		Eq_2 s1_133 = a1;
		if (a1 != 0x00)
		{
			Eq_2 s5_107;
			Eq_2 s3_132 = a2;
			s5_107 = s5;
			if (a2 != 0x00)
			{
				a5 = CONVERT(Mem29[a1 + a2 + -1:byte], byte, word32);
				s5_107 = s5;
				if (a5 == 0x00)
				{
					s5_107.u0 = 0x2308A000;
					if (strstr(ra, a1, 587769492, out a1, out a3, out a4, out a5) != 0x00)
					{
						Eq_2 s4_129 = 0x00;
						s0_143.u0 = 0x00;
						word32 s8_160 = 0x00;
						word32 s9_118 = 0x2308A000;
						s2_119 = s2;
						while (true)
						{
							Eq_2 s2_119;
							a5.u0 = 0x01;
							if (s3_132 <= 0x01)
								break;
							Eq_2 a0_90;
							Eq_2 a2_91;
							Eq_2 a3_92;
							Eq_2 a4_102;
							word32 s3_106;
							Eq_2 s6_108;
							Eq_2 s7_109;
							Eq_2 s10_116;
							Eq_2 s11_117;
							word32 s2_653;
							word32 s1_652;
							word32 a5_651;
							ra = mbedtls_pem_read_buffer(mbedtls_pem_init(ra, fp + -76, out a5_651), s0_143, fp + -76, (word16) s5_107.u0 + 0x0694, s9_118 + 1712, s1_133, fp + -80, s2_119, mstatus, dwArg24, dwArg78, dwArgB8, dwArgF8, out s0_143, out s1_652, out a0_90, out a1, out a2_91, out a3_92, out a4_102, out a5, out s2_653, out s3_106, out s4_129, out s5_107, out s6_108, out s7_109, out s8_160, out s9_118, out s10_116, out s11_117);
							s2_119 = a0_90;
							if (a0_90 != 0x00)
							{
								if (a0_90 == s10_116)
									goto l2305F2DC;
								if (a0_90 == s6_108)
									break;
								word32 a5_126;
								word32 a4_661;
								word32 a3_660;
								Eq_2 s1_128 = mbedtls_pem_free(fp + -76, a2_91, a5, mstatus, dwArgF8, dwArg0138, out a1, out a3_660, out a4_661, out a5_126, out s4_129);
								0x00 = (uint16) dwArg94;
								s3_132 = s3_106 - a5_126;
								s1_133 = (word32) s1_128 + a5_126;
								goto l2305F2BE;
							}
							0x00 = (uint16) dwArg94;
							Eq_2 a0_139;
							Eq_2 a2_151;
							Eq_2 a5_152;
							Eq_2 s11_167;
							word32 s10_657;
							word32 a1_654;
							word32 s6_655;
							word32 s7_656;
							ra = mbedtls_x509_crt_parse_der(ra, dwArg34, s7_109, a1, a2_91, a3_92, a4_102, a5, s5_107, s6_108, s7_109, s10_116, s11_117, mstatus, dwLoc4C, dwLoc48, s8, s6, dwLoc18, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg28, dwArg38, s5, dwArg58, dwArg74, dwArg78, dwArg98, dwArgB8, dwArgF4, out s0_143, out a0_139, out a1_654, out a2_151, out a5_152, out s3_132, out s5_107, out s6_655, out s7_656, out s8_160, out s9_118, out s10_657, out s11_167, out mstatus);
							s2_119 = a0_139;
							word32 a4_659;
							word32 a3_658;
							s1_133 = mbedtls_pem_free(fp + -76, a2_151, a5_152, mstatus, dwArgF8, dwArg0138, out a1, out a3_658, out a4_659, out a5, out s4_129);
							if (a0_139 != 0x00)
							{
								if (a0_139 == s11_167)
								{
l2305F2DC:
									s0_143 = s2_119;
									goto l2305F246;
								}
l2305F2BE:
								if (s0_143 == 0x00)
									s0_143 = s2_119;
								s4_129 = (word32) s4_129 + 1;
								continue;
							}
							s8_160 = 0x01;
						}
						if (s8_160 == 0x00)
						{
							if (s0_143 == 0x00)
								s0_143.u0 = ~0x0200077F;
						}
						else
							s0_143 = s4_129;
l2305F246:
						0x00 = dwArg010C;
						a0Out = s0_143;
						a1Out = a1;
						a3Out = s2;
						a5Out = a5;
						mstatusOut = mstatus;
						return dwLoc08;
					}
				}
			}
			Eq_2 a0_222;
			word32 s0_641;
			word32 s7_646;
			word32 a2_642;
			word32 s5_644;
			word32 s6_645;
			word32 s3_643;
			word32 s9_648;
			word32 s8_647;
			word32 s10_649;
			word32 s11_650;
			mbedtls_x509_crt_parse_der(ra, s0, a0, a1, a2, a3, a4, a5, s5_107, s6, a0, s10, s11, mstatus, dwLoc4C, dwLoc48, s8, s6, dwLoc18, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg28, dwArg38, s5, dwArg58, dwArg74, dwArg78, dwArg98, dwArgB8, dwArgF4, out s0_641, out a0_222, out a1, out a2_642, out a5, out s3_643, out s5_644, out s6_645, out s7_646, out s8_647, out s9_648, out s10_649, out s11_650, out mstatus);
			s0_143 = a0_222;
			goto l2305F246;
		}
	}
	s0_143.u0 = ~0x020007FF;
	goto l2305F246;
}

// 2305F308: Register Eq_2 mbedtls_x509_crt_parse_file(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack word32 dwArgD4, Stack Eq_2 dwArgD8, Stack word32 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      iot_tls_connect
Eq_2 mbedtls_x509_crt_parse_file(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg98, Eq_2 dwArgB8, word32 dwArgD4, Eq_2 dwArgD8, word32 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a5Out, ptr32 & mstatusOut)
{
	ptr32 a0_21;
	Eq_2 a1_22;
	Eq_2 a4_25;
	Eq_2 s1_32;
	Eq_2 s10_33;
	Eq_2 s11_34;
	Eq_2 s2_35;
	Eq_2 s5_38;
	Eq_2 s6_39;
	Eq_2 s8_41;
	word32 a2_175;
	word32 s3_176;
	word32 s4_177;
	word32 s7_178;
	Eq_2 a3_148;
	Eq_2 a5_150;
	ptr32 mstatus_153;
	Eq_2 ra_154 = mbedtls_pk_load_file(ra, a0, a3, s2, s3, s4, mstatus, dwLoc20, dwLoc1C, dwLoc18, dwLoc08, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s1_32, out a0_21, out a1_22, out a2_175, out a3_148, out a4_25, out a5_150, out s2_35, out s3_176, out s4_177, out s5_38, out s6_39, out s7_178, out s8_41, out s10_33, out s11_34, out mstatus_153);
	ptr32 s0_102 = a0_21;
	if (a0_21 == 0x00)
	{
		Eq_2 a0_55;
		Eq_2 a1_67;
		Eq_2 a5_69;
		word32 a3_179;
		ra_154 = mbedtls_x509_crt_parse(ra_154, dwArg64, s1_32, a1_22, dwArg44, a3_148, a4_25, a5_150, s2_35, s5_38, s6_39, s8_41, s10_33, s11_34, mstatus_153, dwLoc1C, dwLoc18, dwLoc08, dwArg04, dwArg08, dwArg14, dwArg18, dwArg38, dwArg54, dwArg58, dwArg74, dwArg78, dwArg98, dwArgD4, dwArgD8, dwArgEC, dwArg0118, out a0_55, out a1_67, out a3_179, out a5_69, out mstatus_153);
		word32 a1_180;
		word32 s1_181;
		word32 a0_182;
		word32 a1_183;
		word32 a2_184;
		word32 a4_185;
		word32 a6_186;
		word32 s4_187;
		word32 t3_188;
		vPortFree(mbedtls_zeroize(a0_55, a1_67, out a1_180), dwArg24, a5_69, mstatus_153, dwArg0138, dwArg0178, out s0_102, out s1_181, out a0_182, out a1_183, out a2_184, out a3_148, out a4_185, out a5_150, out a6_186, out s4_187, out t3_188);
	}
	a0Out = s0_102;
	a3Out = a3_148;
	a5Out = a5_150;
	mstatusOut = mstatus_153;
	return ra_154;
}

