pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305F346: Register Eq_2 net_would_block.isra.0(Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg34)
// Called from:
//      mbedtls_net_recv
//      mbedtls_net_send
Eq_2 net_would_block.isra.0(Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg34)
{
	ui32 a0_11;
	word32 a3_48;
	lwip_fcntl(a0, 0x03, a3, mstatus, dwArg34, out a0_11, out a3_48);
	Eq_2 a0_23 = a0_11 & 0x01;
	if ((a0_11 & 0x01) != 0x00)
		a0_23 = (word32) (g_t4201FD50 < ~0x0B);
	return a0_23;
}

// 2305F36A: void mbedtls_net_init(Register Eq_2 a0)
// Called from:
//      iot_tls_connect
void mbedtls_net_init(Eq_2 a0)
{
	*(union Eq_2 *) ~0x00 = a0;
}

// 2305F370: Register Eq_2 mbedtls_net_connect(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0138, Register out Eq_267631 a0Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_267633) s3Out, Register out ptr32 s10Out)
// Called from:
//      iot_tls_connect
Eq_2 mbedtls_net_connect(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a2, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0138, union Eq_267631 & a0Out, union Eq_2 & a3Out, struct Eq_267633 & s3Out, ptr32 & s10Out)
{
	word32 a3_30;
	word32 a5_498;
	word32 a0_494;
	word32 t1_493;
	word32 a1_495;
	word32 a2_496;
	word32 a4_497;
	Eq_2 ra_33 = memset(ra, fp + -64, 0x00, 32, out t1_493, out a0_494, out a1_495, out a2_496, out a3_30, out a4_497, out a5_498);
	struct Eq_267633 * s3_115;
	Eq_267631 s1_209;
	Eq_2 s0_147;
	Eq_2 a4_109;
	Eq_2 a2_107;
	Eq_2 a1_106;
	Eq_2 a0_100;
	Eq_2 a3_104;
	Eq_2 ra_226 = lwip_getaddrinfo(ra_33, a1, a2, a1, a2, fp + -64, fp + -0x0044, 0x01, mstatus, dwArg38, dwArg78, dwArg88, dwArgB8, dwArgC8, dwArg0138, out s0_147, out a0_100, out a1_106, out a2_107, out a3_104, out a4_109);
	if (a0_100 != 0x00)
	{
		word32 a4_504;
		word32 a5_505;
		word32 a1_501;
		word32 s7_511;
		word32 s11_514;
		word32 t4_515;
		word32 s9_513;
		word32 a0_500;
		word32 s4_508;
		word32 s6_510;
		word32 s5_509;
		word32 s2_507;
		word32 a7_506;
		word32 a3_503;
		word32 s1_499;
		word32 a2_502;
		word32 s8_512;
		ra_226 = printf(ra_226, &g_t2308AC14, g_t4201FD50, dwLoc58, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_499, out a0_500, out a1_501, out a2_502, out a3_503, out a4_504, out a5_505, out a7_506, out s2_507, out s3_115, out s4_508, out s5_509, out s6_510, out s7_511, out s8_512, out s9_513, out s10, out s11_514, out t4_515);
		s1_209.u0 = -82;
	}
	else
	{
		s3_115 = (struct Eq_267633 *) &g_t42020000;
		while (s0_147 != 0x00)
		{
			Eq_2 s0_101 = *((word32) a0_100 + 4);
			word32 s5_516;
			union Eq_2 * s2_114;
			a0_100 = lwip_socket(ra_226, a1_106, a2_107, a3_104, mstatus, dwLoc2C, dwArg08, s1, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, out a1_106, out a2_107, out a3_104, out a4_109, out s2_114, out s3_115, out s5_516);
			*s2_114 = (union Eq_2 *) a0_100;
			if (a0_100 >= 0x00)
			{
				do
				{
					Eq_2 a2_141;
					int32 s4_151;
					s0_147 = lwip_connect(*s2_114, a1_106, mstatus, dwLoc2C, dwLoc18, dwArg28, dwArg68, out a0_100, out a1_106, out a2_141, out a3_104, out a4_109, out s2_114, out s3_115, out s4_151);
					if (a0_100 == 0x00)
						goto l2305F400;
				} while (s3_115->dwFFFFFD50 == s4_151);
				word32 s5_521;
				word32 s6_522;
				word32 s2_519;
				word32 s4_520;
				word32 a5_518;
				word32 s1_517;
				s0_101 = lwip_close(ra_226, *s2_114, a2_141, mstatus, dwLoc18, dwArg28, dwArg58, dwArg68, dwArg78, dwArgC8, out s1_517, out a0_100, out a1_106, out a2_107, out a3_104, out a4_109, out a5_518, out s2_519, out s3_115, out s4_520, out s5_521, out s6_522);
			}
			s0_147 = *((word32) s0_101 + 28);
		}
l2305F400:
		s1_209 = lwip_freeaddrinfo(s0_147, a0_100, a3_104, a4_109, mstatus);
	}
	a0Out = s1_209;
	a3Out = dwArg08;
	s3Out = s3_115;
	s10Out = s10;
	return ra_226;
}

// 2305F448: Register word32 mbedtls_net_set_block(Register (ptr32 Eq_2) a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArg44, Register out ptr32 a0Out, Register out ptr32 a3Out)
// Called from:
//      iot_tls_connect
word32 mbedtls_net_set_block(union Eq_2 * a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArg44, ptr32 & a0Out, ptr32 & a3Out)
{
	Eq_2 a0_15;
	Eq_2 a3_26;
	lwip_fcntl(*a0, 0x03, a3, mstatus, dwArg34, out a0_15, out a3_26);
	ptr32 a0_32;
	ptr32 a3_43;
	word32 s0_40 = lwip_fcntl(a0_15, 0x04, a3_26, mstatus, dwArg44, out a0_32, out a3_43);
	a0Out = a0_32;
	a3Out = a3_43;
	return s0_40;
}

// 2305F46C: void mbedtls_net_recv(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_2) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArg0128)
// Called from:
//      mbedtls_net_recv_timeout
void mbedtls_net_recv(Eq_2 ra, Eq_2 s1, union Eq_2 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArg0128)
{
	Eq_2 a0_10 = *a0;
	if (a0_10 >= 0x00)
	{
		Eq_2 a0_18;
		Eq_2 a3_21;
		ptr32 mstatus_26;
		word32 s6_258;
		word32 s0_257;
		Eq_2 ra_27 = lwip_read(ra, s1, a0_10, a1, a2, s2, s3, s4, mstatus, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg28, dwArg48, dwArg58, dwArg78, dwArg88, dwArg0128, out s0_257, out a0_18, out a3_21, out s6_258, out mstatus_26);
		if (a0_18 >= 0x00)
			return;
		if (net_would_block.isra.0(a0_18, a3_21, mstatus_26, dwArg24) != 0x00)
			return;
		Eq_2 a3_60 = g_t4201FD50;
		if (a3_60 == 32 || a3_60 == 0x0068)
		{
			word32 a5_284;
			word32 a7_285;
			word32 s2_286;
			word32 a4_283;
			word32 a3_282;
			word32 a2_281;
			word32 a1_280;
			word32 a0_279;
			word32 s1_278;
			word32 s3_287;
			word32 s4_288;
			word32 s5_289;
			word32 s6_290;
			word32 s7_291;
			word32 s8_292;
			word32 s9_293;
			word32 s10_294;
			word32 s11_295;
			word32 t4_296;
			printf(ra_27, &g_t2308AC54, a3_60, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_278, out a0_279, out a1_280, out a2_281, out a3_282, out a4_283, out a5_284, out a7_285, out s2_286, out s3_287, out s4_288, out s5_289, out s6_290, out s7_291, out s8_292, out s9_293, out s10_294, out s11_295, out t4_296);
		}
		else
		{
			if (a3_60 == 0x04)
				return;
			word32 s1_297;
			word32 a0_298;
			word32 a1_299;
			word32 a2_300;
			word32 a3_301;
			word32 a4_302;
			word32 a5_303;
			word32 a7_304;
			word32 s2_305;
			word32 s3_306;
			word32 s4_307;
			word32 s5_308;
			word32 s6_309;
			word32 s7_310;
			word32 s8_311;
			word32 s9_312;
			word32 s10_313;
			word32 s11_314;
			word32 t4_315;
			printf(ra_27, &g_t2308AC74, a3_60, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_297, out a0_298, out a1_299, out a2_300, out a3_301, out a4_302, out a5_303, out a7_304, out s2_305, out s3_306, out s4_307, out s5_308, out s6_309, out s7_310, out s8_311, out s9_312, out s10_313, out s11_314, out t4_315);
		}
	}
	else
	{
		word32 t4_277;
		word32 s11_276;
		word32 s10_275;
		word32 s9_274;
		word32 s8_273;
		word32 s7_272;
		word32 s6_271;
		word32 s5_270;
		word32 s4_269;
		word32 s3_268;
		word32 s2_267;
		word32 a7_266;
		word32 a5_265;
		word32 a4_264;
		word32 a3_263;
		word32 a2_262;
		word32 a1_261;
		word32 a0_260;
		word32 s1_259;
		printf(ra, &g_t2308AC38, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_259, out a0_260, out a1_261, out a2_262, out a3_263, out a4_264, out a5_265, out a7_266, out s2_267, out s3_268, out s4_269, out s5_270, out s6_271, out s7_272, out s8_273, out s9_274, out s10_275, out s11_276, out t4_277);
	}
}

// 2305F510: void mbedtls_net_send(Register Eq_2 ra, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC)
void mbedtls_net_send(Eq_2 ra, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgAC)
{
	if (a5 < 0x00)
		return;
	Eq_2 a3_18;
	word32 s8_259;
	Eq_2 a0_15 = lwip_write(a5, mstatus, dwArg18, dwArg58, dwArg98, out a3_18, out s8_259);
	if (a0_15 >= 0x00)
		return;
	if (net_would_block.isra.0(a0_15, a3_18, mstatus, dwArg24) != 0x00)
		return;
	Eq_2 a3_53 = g_t4201FD50;
	if (a3_53 == 32 || a3_53 == 0x0068)
	{
		word32 t4_278;
		word32 s11_277;
		word32 s10_276;
		word32 s9_275;
		word32 s8_274;
		word32 s7_273;
		word32 s4_270;
		word32 s6_272;
		word32 s5_271;
		word32 s3_269;
		word32 s2_268;
		word32 a4_265;
		word32 a7_267;
		word32 a5_266;
		word32 a1_262;
		word32 a3_264;
		word32 a2_263;
		word32 a0_261;
		word32 s1_260;
		printf(ra, &g_t2308AC54, a3_53, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_260, out a0_261, out a1_262, out a2_263, out a3_264, out a4_265, out a5_266, out a7_267, out s2_268, out s3_269, out s4_270, out s5_271, out s6_272, out s7_273, out s8_274, out s9_275, out s10_276, out s11_277, out t4_278);
	}
	else
	{
		if (a3_53 == 0x04)
			return;
		word32 s5_290;
		word32 s4_289;
		word32 s3_288;
		word32 s2_287;
		word32 a7_286;
		word32 a5_285;
		word32 a4_284;
		word32 a3_283;
		word32 a2_282;
		word32 a1_281;
		word32 a0_280;
		word32 s1_279;
		word32 s6_291;
		word32 s7_292;
		word32 s8_293;
		word32 s9_294;
		word32 s10_295;
		word32 s11_296;
		word32 t4_297;
		printf(ra, &g_t2308AC98, a3_53, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_279, out a0_280, out a1_281, out a2_282, out a3_283, out a4_284, out a5_285, out a7_286, out s2_287, out s3_288, out s4_289, out s5_290, out s6_291, out s7_292, out s8_293, out s9_294, out s10_295, out s11_296, out t4_297);
	}
}

// 2305F59E: void mbedtls_net_recv_timeout(Register uint32 a3, Register Eq_316268 a5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack word32 dwArg0128)
void mbedtls_net_recv_timeout(uint32 a3, Eq_316268 a5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, word32 dwArg0128)
{
	if (a5 < 0x00)
		return;
	int32 a4_16;
	for (a4_16 = 0x00; a4_16 != 0x08; ++a4_16)
		fp + -40 + a4_16 = (byte *) 0x00;
	struct Eq_316298 * a4_29 = (a5 >> 0x05 << 2) + (fp + -16);
	a4_29->dw0FE8 = 0x01 << a5 | a4_29->dwFFFFFFE8;
	int32 a0_68;
	Eq_2 a3_71;
	union Eq_2 * s0_77;
	Eq_2 s1_78;
	Eq_2 s2_81;
	Eq_2 s3_82;
	Eq_2 s4_83;
	word32 a5_296;
	word32 a2_294;
	word32 a4_295;
	Eq_2 ra_76 = lwip_select((word32) a5 + 1, fp + -40, 0x00, 0x00, mstatus, dwLoc2C, dwArg48, 0x00, dwArg88, dwArg98, dwArgA8, dwArgD4, dwArgD8, dwArgE8, out s0_77, out s1_78, out a0_68, out a2_294, out a3_71, out a4_295, out a5_296, out s2_81, out s3_82, out s4_83);
	if (a0_68 != 0x00 && a0_68 >= 0x00)
		mbedtls_net_recv(ra_76, s1_78, s0_77, s1_78, s2_81, a3_71, s2_81, s3_82, s4_83, mstatus, dwLoc2C, a3 >> 1000, dwLoc18, dwLoc0C, dwLoc08, dwArg18, dwArg28, dwArg30, dwArg34, dwArg48, 0x00, dwArg7C, dwArgF8);
	0x00 = dwArg0128;
}

