pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305F652: Register word32 mbedtls_net_free(Register Eq_2 ra, Register (ptr32 Eq_2) a0, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Register out ptr32 a5Out)
// Called from:
//      iot_tls_destroy
word32 mbedtls_net_free(Eq_2 ra, union Eq_2 * a0, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArg0118, ptr32 & a5Out)
{
	Eq_2 a0_12 = *a0;
	if (a0_12 != ~0x00)
	{
		Eq_2 a2_22;
		union Eq_2 * s1_49;
		word32 a0_125;
		word32 a2_126;
		word32 a3_127;
		word32 a4_128;
		word32 s2_129;
		word32 s3_130;
		word32 s4_131;
		word32 s5_132;
		word32 s6_133;
		*s1_49 = (union Eq_2 *) lwip_close(ra, lwip_shutdown(a0_12, 0x02, mstatus, dwArg48, dwArg88, dwArgC8, out a2_22), a2_22, mstatus, dwArg38, dwArg78, dwArgA8, dwArgB8, dwArgC8, dwArg0118, out s1_49, out a0_125, out a1, out a2_126, out a3_127, out a4_128, out a5, out s2_129, out s3_130, out s4_131, out s5_132, out s6_133);
	}
	a5Out = a5;
	return a1;
}

// 2305F67C: Register Eq_2 mycalloc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out (ptr32 Eq_285617) s1Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_285621) a4Out, Register out Eq_285622 a5Out, Register out Eq_285623 s2Out, Register out (ptr32 Eq_285624) s3Out, Register out Eq_285625 s4Out, Register out Eq_285626 s8Out)
// Called from:
//      mbedtls_pk_load_file
//      rsa_alloc_wrap
//      eckey_alloc_wrap
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_ssl_conf_own_cert
//      mbedtls_ssl_set_hostname
//      mbedtls_ssl_setup
//      mbedtls_ssl_write_record
//      mbedtls_ssl_prepare_handshake_record
//      mbedtls_ssl_parse_certificate
//      mbedtls_x509_crt_parse_der
//      mbedtls_asn1_get_sequence_of
//      mbedtls_mpi_grow
//      mbedtls_mpi_shrink
//      gcm_ctx_alloc
//      aes_ctx_alloc
//      ecp_normalize_jac_many
//      mbedtls_ecp_mul
//      mbedtls_md_setup
//      md5_ctx_alloc
//      sha1_ctx_alloc
//      sha224_ctx_alloc
//      mbedtls_pem_read_buffer
//      mbedtls_x509_get_name
Eq_2 mycalloc(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg0118, Eq_2 dwArg0158, union Eq_2 & s0Out, struct Eq_285617 & s1Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, struct Eq_285621 & a4Out, union Eq_285622 & a5Out, union Eq_285623 & s2Out, struct Eq_285624 & s3Out, union Eq_285625 & s4Out, union Eq_285626 & s8Out)
{
	word32 a2_5 = a0 + a1;
	Eq_2 a0_18;
	struct Eq_285617 * s1_26;
	Eq_285623 s2_27;
	struct Eq_285624 * s3_28;
	Eq_285625 s4_29;
	word32 a1_69;
	word32 a2_70;
	word32 a3_71;
	word32 a4_72;
	word32 a5_73;
	word32 a6_74;
	word32 s8_75;
	pvPortMalloc(ra, s1, a2_5, a3, a4, a5, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_26, out a0_18, out a1_69, out a2_70, out a3_71, out a4_72, out a5_73, out a6_74, out s2_27, out s3_28, out s4_29, out s8_75);
	ptr32 a1_37;
	ptr32 a2_38;
	ptr32 a3_39;
	struct Eq_285621 * a4_40;
	Eq_285622 a5_41;
	word32 t1_76;
	word32 a0_77;
	Eq_2 ra_42 = memset(ra, a0_18, 0x00, a2_5, out t1_76, out a0_77, out a1_37, out a2_38, out a3_39, out a4_40, out a5_41);
	s0Out = a0_18;
	s1Out = s1_26;
	a1Out = a1_37;
	a2Out = a2_38;
	a3Out = a3_39;
	a4Out = a4_40;
	a5Out = a5_41;
	s2Out = s2_27;
	s3Out = s3_28;
	s4Out = s4_29;
	s8Out = dwLoc1C;
	return ra_42;
}

// 2305F6A2: Register int32 aes_gen_tables(Stack Eq_2 dwArg0148, Register out Eq_316456 a0Out, Register out (ptr32 byte) a1Out, Register out (ptr32 Eq_316458) a3Out, Register out Eq_316459 a4Out)
// Called from:
//      mbedtls_aes_setkey_enc
int32 aes_gen_tables(Eq_2 dwArg0148, union Eq_316456 & a0Out, byte & a1Out, struct Eq_316458 & a3Out, union Eq_316459 & a4Out)
{
	ptr32 a2_19 = fp + -2080;
	ptr32 * a5_20 = (ptr32 *) 0x01;
	int32 a3_21;
	for (a3_21 = 0x00; a3_21 != 0x0100; ++a3_21)
	{
		((a5_20 << 0x02) + (fp + 0x00FFEFE0))->dw0C00 = a3_21;
		*a5_20 = a2_19;
		ui32 a1_34 = a5_20 & 0x0080;
		ui32 a4_35 = a5_20 << 0x01;
		if (a1_34 != 0x00)
			a1_34 = 0x1B;
		a5_20 = (a5_20 ^ a4_35 ^ a1_34) & 0x00FF;
		a2_19 += 0x04;
	}
	word32 a4_50;
	word32 * a5_52 = (word32 *) 0x01;
	for (a4_50 = 0x42017D18; a4_50 != 0x42017D40; a4_50 += 0x04)
	{
		*a5_52 = a4_50;
		ui32 a3_56 = a5_52 << 0x01;
		ui32 a5_57 = a5_52 & 0x0080;
		if (a5_57 != 0x00)
			a5_57 = 0x1B;
		a5_52 = (a5_57 ^ a3_56) & 0x00FF;
	}
	g_b42017C18 = 99;
	g_b42017DA3 = 0x00;
	int32 * t1_76 = fp + -0x0420 + 4;
	struct Eq_316532 * a7_117 = (struct Eq_316532 *) 0x01;
	byte * a1_148 = g_a42016C18;
	byte * a2_187 = g_a42017D40;
	do
	{
		int32 t5_93 = ((0x00FF - *t1_76 << 2) + (fp + 0x00FFEFE0))->dwFFFFF800;
		ui32 a5_97 = t5_93 << 0x01 | t5_93 >> 0x07;
		ui32 a0_101 = (a5_97 & 0x00FF) << 0x01 | (a5_97 & 0x00FF) >> 0x07;
		ui32 a3_105 = (a0_101 & 0x00FF) << 0x01 | (a0_101 & 0x00FF) >> 0x07;
		ui32 a5_114 = ((a3_105 & 0x00FF) >> 0x07 | (a3_105 & 0x00FF) << 0x01) & 0x00FF ^ t5_93 ^ a5_97 & 0x00FF ^ a0_101 & 0x00FF ^ a3_105 & 0x00FF;
		a7_117[0x42016C18] = (struct Eq_316532) (byte) (a5_114 ^ 99);
		(a5_114 ^ 99)->b42017D40 = (byte) a7_117;
		++t1_76;
		++a7_117;
	} while (a7_117 != (struct Eq_316532 *) 0x0100);
	struct Eq_316458 * a3_137 = null;
	do
	{
		int32 s5_189;
		ui32 s4_190;
		ui32 a4_150 = (word32) *a1_148;
		ui32 s4_156 = a4_150 << 0x01 ^ (int32) ((byte) a4_150) >> 31 & 0x1B;
		ptr32 * a5_164 = a4_150 << 0x08 ^ a4_150 << 0x10 ^ s4_156 & 0x00FF ^ (a4_150 ^ s4_156 & 0x00FF) << 24;
		*a5_164 = a3_137 + 276847430;
		a3_137[276847686] = (struct Eq_316458) (a5_164 << 0x08 | a5_164 >> 0x18);
		a3_137[276847942] = (struct Eq_316458) (a5_164 << 0x10 | a5_164 >> 0x10);
		a3_137[276848198] = (struct Eq_316458) (a5_164 << 24 | a5_164 >> 0x08);
		ui32 a5_188 = (word32) *a2_187;
		if (a5_188 != 0x00)
		{
			int32 a4_197 = ((a5_188 << 0x02) + (fp + 0x00FFEFE0))->dwFFFFFC00;
			s5_189 = (((dwLoc03E8 + a4_197 | 0x00FF) << 2) + (fp + 0x00FFEFE0))->dwFFFFF800;
			s4_190 = (((a4_197 + dwLoc03FC | 0x00FF) << 2) + (fp + 0x00FFEFE0))->dwFFFFF800 << 8;
		}
		else
		{
			s5_189 = 0x00;
			s4_190 = 0x00;
		}
		ui32 s4_218 = s4_190 ^ s5_189;
		ui32 a4_219 = 0x00;
		if (a5_188 != 0x00)
			a4_219 = (((((a5_188 << 0x02) + (fp + 0x00FFEFE0))->dwFFFFFC00 + dwLoc03EC | 0x00FF) << 2) + (fp + 0x00FFEFE0))->dwFFFFF800 << 16;
		ui32 s4_242 = s4_218 ^ a4_219;
		ui32 a4_243 = 0x00;
		if (a5_188 != 0x00)
			a4_243 = (((((a5_188 << 2) + (fp + 0x00FFEFE0))->dwFFFFFC00 + dwLoc03F4 | 0x00FF) << 2) + (fp + 0x00FFEFE0))->dwFFFFF800 << 0x18;
		word32 * a5_267 = s4_242 ^ a4_243;
		*a5_267 = a3_137 + 0x10805F90;
		a3_137[0x10806090] = (struct Eq_316458) (a5_267 << 0x08 | a5_267 >> 0x18);
		a3_137[0x10806190] = (struct Eq_316458) (a5_267 << 0x10 | a5_267 >> 0x10);
		a3_137[0x10806290] = (struct Eq_316458) (a5_267 << 24 | a5_267 >> 0x08);
		++a3_137;
		++a1_148;
		++a2_187;
	} while (a3_137 != (struct Eq_316458 *) 0x0400);
	0x00 = (uint16) dwArg0148;
	a0Out.u0 = 0x00FF;
	a1Out = a1_148;
	a3Out = a3_137;
	a4Out = a5_267 >> 0x08;
	return dwLoc03FC;
}

// 2305F996: Register Eq_2 mbedtls_aes_init(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 a1Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      block_cipher_df
//      mbedtls_ctr_drbg_seed
//      mbedtls_aes_setkey_dec
//      aes_ctx_alloc
//      pem_aes_decrypt
Eq_2 mbedtls_aes_init(Eq_2 ra, Eq_2 a0, ptr32 & a1Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a1_8;
	ptr32 a4_11;
	ptr32 a5_12;
	word32 t1_19;
	word32 a0_20;
	word32 a2_21;
	word32 a3_22;
	Eq_2 ra_13 = memset(ra, a0, 0x00, 0x0118, out t1_19, out a0_20, out a1_8, out a2_21, out a3_22, out a4_11, out a5_12);
	a1Out = a1_8;
	a4Out = a4_11;
	a5Out = a5_12;
	return ra_13;
}

