pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305F9A0: Register word32 mbedtls_aes_free(Register Eq_2 a0)
// Called from:
//      block_cipher_df
//      mbedtls_ctr_drbg_free
//      mbedtls_aes_setkey_dec
//      aes_ctx_free
//      pem_aes_decrypt
word32 mbedtls_aes_free(Eq_2 a0)
{
	a0_5 = a0;
	if (a0 != 0x00)
	{
		while (true)
		{
			Eq_2 a0_5;
			if (a0_5 == (word32) a0 + 0x0118)
				break;
			a0_5->u1 = 0x00;
			a0_5 = (word32) a0_5 + 1;
		}
	}
	return (word32) a0 + 0x0118;
}

// 2305F9B4: Register (ptr32 Eq_282274) mbedtls_aes_setkey_enc(Register (ptr32 Eq_282274) a0, Register (ptr32 Eq_282275) a1, Register Eq_282276 a2, Register (ptr32 Eq_282277) a4, Register Eq_282256 a5, Stack (ptr32 Eq_282274) dwArg44, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_282274) a0Out, Register out (ptr32 Eq_282275) a1Out, Register out (ptr32 Eq_282283) a3Out, Register out (ptr32 Eq_282277) a4Out)
// Called from:
//      block_cipher_df
//      ctr_drbg_update_internal
//      mbedtls_ctr_drbg_seed
//      mbedtls_aes_setkey_dec
//      aes_setkey_enc_wrap
struct Eq_282274 * mbedtls_aes_setkey_enc(struct Eq_282274 * a0, struct Eq_282275 * a1, Eq_282276 a2, struct Eq_282277 * a4, Eq_282256 a5, struct Eq_282274 * dwArg44, Eq_2 dwArg0128, struct Eq_282274 & a0Out, struct Eq_282275 & a1Out, struct Eq_282283 & a3Out, struct Eq_282277 & a4Out)
{
	struct Eq_282274 * s0_14 = a0;
	if (a5 == 0x00)
	{
		*(union Eq_2 *) 0x01 = aes_gen_tables(dwArg0128, out a0, out a1, out a3, out a4);
		s0_14 = dwArg44;
	}
	struct Eq_282274 ** a5_48;
	if (a2 != 0x00C0)
	{
		if (a2 != 0x0100)
		{
			a0 = (struct Eq_282274 *) ~0x1F;
			if (a2 != 0x0080)
				goto l2305FA9E;
			a5_48 = (struct Eq_282274 **) 0x0A;
		}
		else
			a5_48 = (struct Eq_282274 **) 0x0E;
	}
	else
		a5_48 = (struct Eq_282274 **) 0x0C;
	*a5_48 = (struct Eq_282274 **) s0_14;
	struct Eq_316880 * a5_61 = (char *) &s0_14->ptr0000 + 8;
	a5_61[1] = (struct Eq_316880) s0_14;
	struct Eq_316880 * a3_63 = a5_61;
	struct Eq_282275 * a2_66 = a1 + ((a2 >> 5) << 2) / 4;
	while (a2_66 != a1)
	{
		++a1;
		ui32 a0_80 = (word32) a1->bFFFFFFFF;
		++a3_63;
		a4 = (word32) a1->b0001 << 8 | (word32) a1->b0002 << 16 | (word32) a1->b0000 | a0_80 << 24;
		a3_63[0x03FF] = (struct Eq_316880) a4;
		a0 = a0_80 << 24;
	}
	s0_14 = a4->ptr0000;
	a3 = (struct Eq_282283 *) 0x0C;
	if (a4 != (struct Eq_282277 *) 0x0C)
	{
		a3 = (struct Eq_282283 *) 0x0E;
		if (a4 != (struct Eq_282277 *) 0x0E)
		{
			a3 = (struct Eq_282283 *) 0x0A;
			a0 = null;
			if (a4 != (struct Eq_282277 *) 0x0A)
				goto l2305FA9E;
			a1 = (struct Eq_282275 *) g_a42017D18;
			s0_14 = (struct Eq_282274 *) ((char *) &s0_14->ptr0000 + 0x00A8);
			do
			{
				struct Eq_316931 * a5_236 = a0->ptr0000;
				ptr32 * a4_261 = (word32) g_a42016C18[0] ^ (a0 ^ a1->b0000) ^ (word32) g_a42016C18[0] << 16 ^ (word32) g_b42016C22 << 24 ^ (word32) g_a42016C18[0] << 8;
				int32 a0_262 = a5_236->dw0004;
				*a4_261 = &a5_236->ptr0010;
				struct Eq_316971 * a4_264 = a4_261 ^ a0_262;
				a0 = a5_236->ptr0008;
				a4_264->ptr0004 = &a5_236->ptr0010;
				struct Eq_316980 * a4_267 = a4_264 ^ a0;
				a4_267->ptr0008 = &a5_236->ptr0010;
				(a4_267 ^ 0x0A)->ptr000C = &a5_236->ptr0010;
				++a1;
				a4 = a4_267 ^ 0x0A;
			} while (&a5_236->ptr0010 != (char *) (&s0_14->ptr0000) + 0x00A8);
		}
		else
		{
			int32 * a0_146 = g_a42017D18;
			s0_14 = (struct Eq_282274 *) ((char *) &s0_14->ptr0000 + 232);
			do
			{
				struct Eq_317015 * a5_155 = a3->ptr0000;
				int32 a6_162 = a5_155->dw0010;
				ptr32 * a4_181 = (word32) (a1 >> 0x08 & 0x00FF)->b42016C18 ^ (a3 ^ *a0_146) ^ (word32) (a1 >> 0x18)->b42016C18 << 16 ^ (word32) (a1 & 0x00FF)->b42016C18 << 24 ^ (word32) (a1 >> 0x10 & 0x00FF)->b42016C18 << 8;
				int32 a3_182 = a5_155->dw0004;
				*a4_181 = (char *) &a5_155->ptr0018 + 8;
				struct Eq_317075 * a4_184 = a4_181 ^ a3_182;
				int32 a3_185 = a5_155->dw0008;
				a4_184->ptr0004 = (char *) &a5_155->ptr0018 + 8;
				struct Eq_317085 * a4_187 = a4_184 ^ a3_185;
				int32 a3_188 = a5_155->dw000C;
				a4_187->ptr0008 = (char *) &a5_155->ptr0018 + 8;
				struct Eq_317095 * a4_190 = a4_187 ^ a3_188;
				a4_190->ptr000C = (char *) &a5_155->ptr0018 + 8;
				struct Eq_317101 * a4_212 = (word32) (a4_190 >> 16 & 0x00FF)->b42016C18 << 16 ^ ((((word32) (a4_190 & 0x00FF)->b42016C18 ^ a6_162) ^ (word32) (a4_190 >> 0x18)->b42016C18 << 24) ^ (word32) (a4_190 >> 0x08 & 0x00FF)->b42016C18 << 8);
				int32 a3_213 = a5_155->dw0014;
				a4_212->ptr0010 = (char *) &a5_155->ptr0018 + 8;
				struct Eq_317148 * a4_215 = a4_212 ^ a3_213;
				a3 = a5_155->ptr0018;
				a4_215->ptr0014 = (char *) &a5_155->ptr0018 + 8;
				struct Eq_317157 * a4_218 = a4_215 ^ a3;
				a4_218->ptr0018 = (char *) &a5_155->ptr0018 + 8;
				a4 = a4_218 ^ a1;
				a4->ptr001C = (char *) &a5_155->ptr0018 + 8;
				++a0_146;
			} while ((char *) &a5_155->ptr0018 + 8 != (char *) (&s0_14->ptr0000) + 232);
		}
	}
	else
	{
		a1 = (struct Eq_282275 *) g_a42017D18;
		s0_14 = (struct Eq_282274 *) ((char *) &s0_14->ptr0000 + 200);
		do
		{
			struct Eq_316931 * a5_101 = a0->ptr0000;
			ptr32 * a4_126 = (word32) g_a42016C18[0] ^ (a0 ^ a1->b0000) ^ (word32) g_a42016C18[0] << 16 ^ (word32) g_b42016C24 << 24 ^ (word32) g_a42016C18[0] << 8;
			int32 a0_127 = a5_101->dw0004;
			*a4_126 = (char *) &a5_101->ptr0010 + 8;
			struct Eq_317213 * a4_129 = a4_126 ^ a0_127;
			struct Eq_282274 * a0_130 = a5_101->ptr0008;
			a4_129->ptr0004 = (char *) &a5_101->ptr0010 + 8;
			struct Eq_317223 * a4_132 = a4_129 ^ a0_130;
			int32 a0_133 = a5_101->dw000C;
			a4_132->ptr0008 = (char *) &a5_101->ptr0010 + 8;
			struct Eq_317233 * a4_135 = a4_132 ^ a0_133;
			a0 = a5_101->ptr0010;
			a4_135->ptr000C = (char *) &a5_101->ptr0010 + 8;
			struct Eq_317242 * a4_138 = a4_135 ^ a0;
			a4_138->ptr0010 = (char *) &a5_101->ptr0010 + 8;
			(a4_138 ^ 0x0C)->ptr0014 = (char *) &a5_101->ptr0010 + 8;
			++a1;
			a4 = a4_138 ^ 0x0C;
		} while ((char *) &a5_101->ptr0010 + 8 != (char *) (&s0_14->ptr0000) + 200);
	}
	a0 = null;
l2305FA9E:
	a0Out = a0;
	a1Out = a1;
	a3Out = a3;
	a4Out = a4;
	return s0_14;
}

