pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0005.c
// 2305FC44: void mbedtls_aes_setkey_dec(Register Eq_2 ra, Register (ptr32 Eq_317261) a1)
// Called from:
//      aes_setkey_dec_wrap
//      pem_aes_decrypt
void mbedtls_aes_setkey_dec(Eq_2 ra, struct Eq_317261 * a1)
{
	struct Eq_282275 * a1_18;
	struct Eq_282277 * a4_21;
	word32 a5_197;
	mbedtls_aes_init(ra, fp + -296, out a1_18, out a4_21, out a5_197);
	a1[0x0C] = (struct Eq_317261) a1;
	word32 a0_31;
	union Eq_2 * a1_32;
	word32 a4_199;
	word32 a3_198;
	Eq_2 s0_38 = mbedtls_aes_setkey_enc(fp + -296, a1_18, dwLocDC, a4_21, a1 + 8, dwLocFC, dwLoc18, out a0_31, out a1_32, out a3_198, out a4_199);
	if (a0_31 == 0x00)
	{
		*a1_32 = (union Eq_2 *) s0_38;
		((Eq_363397[]) 8)[a1_32].t0000 = s0_38;
		((Eq_363398[]) 0x0C)[a1_32].t0000 = s0_38;
		((Eq_363399[]) 16)[a1_32].t0000 = s0_38;
		ptr32 a5_119 = ((Eq_363400[]) 0x0C)[a1_32].dw0000 + ~0x0F;
		((Eq_363401[]) 20)[a1_32].t0000 = s0_38;
		struct Eq_317326 * a4_113 = a1_32 << 0x04;
		struct Eq_317329 * a2_116 = (word32) s0_38 + 24;
		Eq_317332 a1_118 = (char *) a1_32 - 1;
		while (a1_118 > 0x00)
		{
			int32 a6_71;
			for (a6_71 = 0x00; a6_71 != 0x10; a6_71 += 0x04)
			{
				uint32 a4_76 = a5_119 + a6_71;
				a4_113 = g_a42018640[(word32) (a4_76 >> 16 & 0x00FF)->b42016C18 * 0x04] ^ ((g_a42017E40[(word32) (a4_76 & 0x00FF)->b42016C18 * 0x04] ^ g_a42018A40[(word32) (a4_76 >> 0x18)->b42016C18 * 0x04]) ^ g_a42018240[(word32) (a4_76 >> 0x08 & 0x00FF)->b42016C18 * 0x04]);
				a2_116[a6_71 / 16] = (struct Eq_317329) a4_113;
			}
			a2_116 = (struct Eq_317329 *) ((char *) &a2_116->ptr000C + 4);
			a1_118 = (word32) a1_118 - 1;
			a5_119 += ~0x0F;
		}
		a4_113->ptr0000 = a2_116;
		a4_113->ptr0004 = a2_116;
		struct Eq_317329 * a5_127 = a4_113->ptr0008;
		a4_113->ptr0008 = a2_116;
		a5_127->ptr000C->ptr000C = a2_116;
	}
	mbedtls_aes_free(fp + -296);
}

// 2305FD5E: Register word32 mbedtls_aes_encrypt(Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Stack word32 dwArg3C, Stack Eq_59116 dwArg0148, Register out (ptr32 Eq_317426) s1Out, Register out (ptr32 byte) a3Out, Register out (ptr32 byte) a4Out, Register out Eq_317429 a5Out, Register out ptr32 a6Out, Register out (ptr32 byte) s2Out, Register out (ptr32 Eq_317432) s3Out, Register out ptr32 s4Out, Register out (ptr32 byte) s5Out, Register out (ptr32 Eq_317738) s6Out, Register out Eq_317436 s7Out, Register out ptr32 s8Out, Register out Eq_317438 s9Out, Register out Eq_317439 s10Out, Register out Eq_317440 s11Out)
// Called from:
//      mbedtls_aes_crypt_ecb
//      aes_crypt_ctr_wrap
//      aes_crypt_cfb128_wrap
word32 mbedtls_aes_encrypt(Eq_2 a1, Eq_2 a2, Eq_2 a4, word32 dwArg3C, Eq_59116 dwArg0148, struct Eq_317426 & s1Out, byte & a3Out, byte & a4Out, union Eq_317429 & a5Out, ptr32 & a6Out, byte & s2Out, struct Eq_317432 & s3Out, ptr32 & s4Out, byte & s5Out, union Eq_317738 & s6Out, union Eq_317436 & s7Out, ptr32 & s8Out, union Eq_317438 & s9Out, union Eq_317439 & s10Out, union Eq_317440 & s11Out)
{
	ui32 a3_39 = (word32) *((word32) a1 + 1) << 8 | (word32) (*a1) | (word32) (*((word32) a1 + 2)) << 16;
	ui32 a3_58 = (word32) *((word32) a1 + 6) << 16 | ((word32) (*((word32) a1 + 5)) << 8 | (word32) (*((word32) a1 + 4)));
	struct Eq_317479 * a3_71 = (word32) *((word32) a1 + 0x0A) << 16 | ((word32) (*((word32) a1 + 9)) << 8 | (word32) (*((word32) a1 + 8)));
	struct Eq_317498 * t6_107 = (word32) a4 + 16;
	uint32 a5_233 = ((word32) *((word32) a1 + 3) << 24 | a3_39) ^ a3_39;
	uint32 s10_103 = ((word32) *((word32) a1 + 7) << 24 | a3_58) ^ a3_58;
	uint32 s9_118 = ((word32) *((word32) a1 + 11) << 24 | a3_71) ^ a3_71;
	uint32 s8_276 = ((word32) *((word32) a1 + 0x0F) << 24 | ((word32) (*((word32) a1 + 0x0E)) << 16 | ((word32) (*((word32) a1 + 0x0D)) << 8 | (word32) (*((word32) a1 + 0x0C))))) ^ (a3_71->ptr0008)->dw000C;
	Eq_317436 s7_213 = (**((word32) a4 + 4) >> 0x01) + ~0x00;
	while (true)
	{
		uint32 a1_129 = a1 ^ g_a42017918[(s8_276 >> 0x18) * 0x04] ^ t6_107->dw0000 ^ (s10_103 >> 0x06 & 1020)->dw42017118 ^ (s9_118 >> 0x0E & 1020)->dw42017518;
		int32 s11_138 = t6_107->dw0010;
		uint32 a3_153 = g_a42016D18[(s10_103 & 0x00FF) * 0x04] ^ g_a42017918[(a5_233 >> 0x18) * 0x04] ^ t6_107->dw0004 ^ (s9_118 >> 0x06 & 1020)->dw42017118 ^ (s8_276 >> 0x0E & 1020)->dw42017518;
		uint32 a0_178 = g_a42016D18[(s9_118 & 0x00FF) * 0x04] ^ g_a42017918[(s10_103 >> 0x18) * 0x04] ^ t6_107->dw0008 ^ (s8_276 >> 0x06 & 1020)->dw42017118 ^ (a5_233 >> 0x0E & 1020)->dw42017518;
		uint32 a4_191 = g_a42016D18[(s8_276 & 0x00FF) * 0x04] ^ g_a42017918[(s9_118 >> 0x18) * 0x04] ^ t6_107->dw000C ^ (a5_233 >> 6 & 1020)->dw42017118 ^ (s10_103 >> 0x0E & 1020)->dw42017518;
		int32 s10_202 = t6_107->dw0014;
		int32 s9_205 = t6_107->dw0018;
		int32 s8_208 = t6_107->dw001C;
		if (s7_213 <= 0x00)
			break;
		union Eq_2 * a4_254 = g_a42016D18[(a4_191 & 0x00FF) * 0x04] ^ g_a42017918[(a0_178 >> 24) * 0x04];
		a5_233 = g_a42016D18[(a1_129 & 0x00FF) * 0x04] ^ g_a42017918[(a4_191 >> 0x18) * 0x04] ^ s11_138 ^ g_a42017118[(a3_153 >> 0x08 & 0x00FF) * 0x04] ^ g_a42017518[(a0_178 >> 0x10 & 0x00FF) * 0x04];
		s10_103 = g_a42016D18[(a3_153 & 0x00FF) * 0x04] ^ g_a42017918[(a1_129 >> 0x18) * 0x04] ^ s10_202 ^ g_a42017118[(a0_178 >> 0x08 & 0x00FF) * 0x04] ^ g_a42017518[(a4_191 >> 0x10 & 0x00FF) * 0x04];
		a1 = *a4_254;
		s9_118 = g_a42016D18[(a0_178 & 0x00FF) * 0x04] ^ g_a42017918[(a3_153 >> 0x18) * 0x04] ^ s9_205 ^ g_a42017118[(a4_191 >> 0x08 & 0x00FF) * 0x04] ^ g_a42017518[(a1_129 >> 0x10 & 0x00FF) * 0x04];
		++t6_107;
		s8_276 = a4_254 ^ s8_208 ^ a4_254 ^ a4_254;
		s7_213 = (word32) s7_213.u0 - 1;
	}
	union Eq_317738 * s6_280 = (a1_129 & 0x00FF) + 0x42016C18;
	byte * s5_294 = (a3_153 & 0x00FF) + 0x42016C18;
	struct Eq_317432 * s3_309 = (a0_178 & 0x00FF) + 0x42016C18;
	byte * s2_315 = (a3_153 >> 0x18) + 0x42016C18;
	byte * a4_320 = (a4_191 & 0x00FF) + 0x42016C18;
	byte * a3_325 = (a3_153 >> 16 & 0x00FF) + 0x42016C18;
	uint32 s11_296 = (word32) (a3_153 >> 0x08 & 0x00FF)->b42016C18 << 8 ^ ((word32) (*s6_280) ^ s11_138) ^ (word32) (a0_178 >> 0x10 & 0x00FF)->b42016C18 << 16 ^ (word32) (a4_191 >> 0x18)->b42016C18 << 24;
	uint32 s10_312 = (word32) (a0_178 >> 0x08 & 0x00FF)->b42016C18 << 8 ^ ((word32) (*s5_294) ^ s10_202) ^ (word32) (a4_191 >> 0x10 & 0x00FF)->b42016C18 << 16 ^ (word32) (a1_129 >> 0x18)->b42016C18 << 24;
	uint32 s9_328 = (word32) (a4_191 >> 0x08 & 0x00FF)->b42016C18 << 8 ^ ((word32) s3_309->b0000 ^ s9_205) ^ (word32) (a1_129 >> 0x10 & 0x00FF)->b42016C18 << 16 ^ (word32) (*s2_315) << 24;
	ui32 s8_336 = (word32) *a4_320 ^ s8_208 ^ (word32) (a1_129 >> 8 & 0x00FF)->b42016C18 << 8 ^ (word32) (*a3_325) << 16;
	ui32 a5_337 = (word32) (a0_178 >> 24)->b42016C18;
	a2->u1 = (byte) s11_296;
	((word32) a2 + 4)->u1 = (byte) s10_312;
	((word32) a2 + 1)->u1 = (byte) (s11_296 >> 0x08);
	((word32) a2 + 2)->u1 = (byte) (s11_296 >> 0x10);
	((word32) a2 + 5)->u1 = (byte) (s10_312 >> 0x08);
	*((word32) a2 + 6) = (byte) (s10_312 >> 0x10);
	((word32) a2 + 9)->u1 = (byte) (s9_328 >> 0x08);
	((word32) a2 + 0x0A)->u1 = (byte) (s9_328 >> 0x10);
	((word32) a2 + 8)->u1 = (byte) s9_328;
	uint32 s8_343 = s8_336 ^ a5_337 << 24;
	((word32) a2 + 0x0C)->u1 = (byte) s8_343;
	*((word32) a2 + 0x0D) = (byte) (s8_343 >> 0x08);
	*((word32) a2 + 3) = (byte) (s11_296 >> 0x18);
	*((word32) a2 + 7) = (byte) (s10_312 >> 0x18);
	((word32) a2 + 11)->u1 = (byte) (s9_328 >> 0x18);
	((word32) a2 + 0x0F)->u1 = (byte) (s8_343 >> 0x18);
	*((word32) a2 + 0x0E) = (byte) (s8_343 >> 0x10);
	0x00 = (word32) dwArg0148;
	0x00 = dwArg3C;
	s1Out = (struct Eq_317426 *) g_a42016D18;
	a3Out = a3_325;
	a4Out = a4_320;
	a5Out = s8_343 >> 0x10;
	a6Out = dwArgB8;
	s2Out = s2_315;
	s3Out = s3_309;
	s4Out = dwArg98;
	s5Out = s5_294;
	s6Out = s6_280;
	s7Out = s7_213;
	s8Out = dwArg78;
	s9Out = s9_328 >> 0x18;
	s10Out = s10_312 >> 0x18;
	s11Out = s11_296 >> 0x18;
	return dwLoc04;
}

// 2306019E: Register word32 mbedtls_aes_decrypt(Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Stack word32 dwArg3C, Stack Eq_59116 dwArg0148, Register out (ptr32 byte) s1Out, Register out (ptr32 byte) s2Out, Register out (ptr32 byte) s3Out, Register out ptr32 s4Out, Register out (ptr32 byte) s5Out, Register out (ptr32 byte) s6Out, Register out Eq_318107 s7Out, Register out ptr32 s8Out, Register out Eq_318109 s9Out, Register out Eq_318110 s10Out, Register out Eq_318111 s11Out)
// Called from:
//      mbedtls_aes_crypt_ecb
//      mbedtls_aes_crypt_cbc
word32 mbedtls_aes_decrypt(Eq_2 a1, Eq_2 a2, Eq_2 a5, word32 dwArg3C, Eq_59116 dwArg0148, byte & s1Out, byte & s2Out, byte & s3Out, ptr32 & s4Out, byte & s5Out, byte & s6Out, union Eq_318107 & s7Out, ptr32 & s8Out, union Eq_318109 & s9Out, union Eq_318110 & s10Out, union Eq_318111 & s11Out)
{
	struct Eq_318112 * a4_58 = (word32) *((word32) a1 + 0x0A) << 16 | ((word32) (*((word32) a1 + 9)) << 8 | (word32) (*((word32) a1 + 8)));
	struct Eq_318131 * a4_39 = (word32) *((word32) a1 + 6) << 16 | ((word32) (*((word32) a1 + 5)) << 8 | (word32) (*((word32) a1 + 4)));
	struct Eq_318150 * a5_64 = a4_58->ptr0008;
	uint32 s10_257 = ((word32) *((word32) a1 + 7) << 24 | a4_39) ^ a4_39;
	struct Eq_318163 * t5_106 = a4_39->dw0004 + 16;
	uint32 s9_117 = ((word32) *((word32) a1 + 11) << 24 | a4_58) ^ a4_58;
	uint32 s5_273 = ((word32) *((word32) a1 + 3) << 24 | ((word32) (*((word32) a1 + 2)) << 16 | ((word32) (*((word32) a1 + 1)) << 8 | (word32) (*a1)))) ^ a5_64->dw0000;
	uint32 s8_111 = ((word32) *((word32) a1 + 0x0F) << 24 | ((word32) (*((word32) a1 + 0x0E)) << 16 | ((word32) (*((word32) a1 + 0x0D)) << 8 | (word32) (*((word32) a1 + 0x0C))))) ^ a5_64->dw000C;
	Eq_318107 s7_213 = (**((word32) a5 + 4) >> 0x01) + ~0x00;
	while (true)
	{
		uint32 a1_129 = a1 ^ g_a42018A40[(s10_257 >> 0x18) * 0x04] ^ t5_106->dw0000 ^ (s8_111 >> 0x06 & 1020)->dw42018240 ^ (s9_117 >> 0x0E & 1020)->dw42018640;
		int32 s11_138 = t5_106->dw0010;
		uint32 a5_154 = g_a42017E40[(s8_111 & 0x00FF) * 0x04] ^ g_a42018A40[(s5_273 >> 0x18) * 0x04] ^ t5_106->dw000C ^ (s9_117 >> 0x06 & 1020)->dw42018240 ^ (s10_257 >> 0x0E & 1020)->dw42018640;
		uint32 a3_179 = g_a42017E40[(s9_117 & 0x00FF) * 0x04] ^ g_a42018A40[(s8_111 >> 0x18) * 0x04] ^ t5_106->dw0008 ^ (s10_257 >> 0x06 & 1020)->dw42018240 ^ (s5_273 >> 0x0E & 1020)->dw42018640;
		uint32 a4_195 = g_a42017E40[(s10_257 & 0x00FF) * 0x04] ^ g_a42018A40[(s9_117 >> 0x18) * 0x04] ^ t5_106->dw0004 ^ (s5_273 >> 0x06 & 1020)->dw42018240 ^ (s8_111 >> 0x0E & 1020)->dw42018640;
		int32 s10_203 = t5_106->dw0014;
		int32 s9_205 = t5_106->dw0018;
		int32 s8_208 = t5_106->dw001C;
		if (s7_213 <= 0x00)
			break;
		a1 = g_a42018A40[(a1_129 >> 24) * 0x04];
		ui32 a5_253 = g_a42017E40[(a5_154 & 0x00FF) * 0x04] ^ a1;
		s10_257 = g_a42017E40[(a4_195 & 0x00FF) * 0x04] ^ g_a42018A40[(a3_179 >> 0x18) * 0x04] ^ s10_203 ^ g_a42018240[(a1_129 >> 0x08 & 0x00FF) * 0x04] ^ g_a42018640[(a5_154 >> 0x10 & 0x00FF) * 0x04];
		s5_273 = g_a42017E40[(a1_129 & 0x00FF) * 0x04] ^ g_a42018A40[(a4_195 >> 0x18) * 0x04] ^ s11_138 ^ g_a42018240[(a5_154 >> 0x08 & 0x00FF) * 0x04] ^ g_a42018640[(a3_179 >> 0x10 & 0x00FF) * 0x04];
		s9_117 = g_a42017E40[(a3_179 & 0x00FF) * 0x04] ^ g_a42018A40[(a5_154 >> 0x18) * 0x04] ^ s9_205 ^ g_a42018240[(a4_195 >> 0x08 & 0x00FF) * 0x04] ^ g_a42018640[(a1_129 >> 0x10 & 0x00FF) * 0x04];
		++t5_106;
		s8_111 = a5_253 ^ s8_208 ^ a5_253 ^ a5_253;
		s7_213 = (word32) s7_213.u0 - 1;
	}
	byte * s6_280 = (a1_129 & 0x00FF) + 0x42017D40;
	byte * s5_289 = (a4_195 >> 0x18) + 0x42017D40;
	byte * s3_309 = (a3_179 >> 0x18) + 0x42017D40;
	byte * s2_318 = (a3_179 & 0x00FF) + 0x42017D40;
	byte * s1_332 = (a5_154 >> 0x18) + 0x42017D40;
	uint32 s11_299 = (word32) (a5_154 >> 0x08 & 0x00FF)->b42017D40 << 8 ^ ((word32) (*s6_280) ^ s11_138) ^ (word32) (a3_179 >> 0x10 & 0x00FF)->b42017D40 << 16 ^ (word32) (*s5_289) << 24;
	uint32 s10_321 = (word32) (a1_129 >> 0x08 & 0x00FF)->b42017D40 << 8 ^ ((word32) (a4_195 & 0x00FF)->b42017D40 ^ s10_203) ^ (word32) (a5_154 >> 0x10 & 0x00FF)->b42017D40 << 16 ^ (word32) (*s3_309) << 24;
	ui32 s9_334 = (word32) (a4_195 >> 0x08 & 0x00FF)->b42017D40 << 8 ^ ((word32) (*s2_318) ^ s9_205) ^ (word32) (a1_129 >> 0x10 & 0x00FF)->b42017D40 << 16;
	ui32 a0_336 = (word32) *s1_332;
	uint32 s8_337 = (word32) (a5_154 & 0x00FF)->b42017D40 ^ s8_208 ^ (word32) (a3_179 >> 8 & 0x00FF)->b42017D40 << 8 ^ (word32) (a4_195 >> 16 & 0x00FF)->b42017D40 << 16 ^ (word32) (a1_129 >> 24)->b42017D40 << 24;
	((word32) a2 + 1)->u1 = (byte) (s11_299 >> 0x08);
	((word32) a2 + 2)->u1 = (byte) (s11_299 >> 0x10);
	((word32) a2 + 5)->u1 = (byte) (s10_321 >> 0x08);
	*((word32) a2 + 6) = (byte) (s10_321 >> 0x10);
	uint32 s9_346 = s9_334 ^ a0_336 << 24;
	((word32) a2 + 9)->u1 = (byte) (s9_346 >> 0x08);
	((word32) a2 + 0x0A)->u1 = (byte) (s9_346 >> 0x10);
	a2->u1 = (byte) s11_299;
	((word32) a2 + 4)->u1 = (byte) s10_321;
	((word32) a2 + 8)->u1 = (byte) s9_346;
	((word32) a2 + 0x0C)->u1 = (byte) s8_337;
	*((word32) a2 + 0x0D) = (byte) (s8_337 >> 0x08);
	*((word32) a2 + 3) = (byte) (s11_299 >> 0x18);
	*((word32) a2 + 7) = (byte) (s10_321 >> 0x18);
	((word32) a2 + 11)->u1 = (byte) (s9_346 >> 0x18);
	((word32) a2 + 0x0F)->u1 = (byte) (s8_337 >> 0x18);
	*((word32) a2 + 0x0E) = (byte) (s8_337 >> 0x10);
	0x00 = (word32) dwArg0148;
	0x00 = dwArg3C;
	s1Out = s1_332;
	s2Out = s2_318;
	s3Out = s3_309;
	s4Out = dwArg98;
	s5Out = s5_289;
	s6Out = s6_280;
	s7Out = s7_213;
	s8Out = dwArg78;
	s9Out = s9_346 >> 0x18;
	s10Out = s10_321 >> 0x18;
	s11Out = s11_299 >> 0x18;
	return dwLoc04;
}

